[NoCoverage] StringLiteral
components/layouts/dashboard/DashboardSidebar.tsx:44:16
     const exactMatch = hrefAndPathnameExactMatch(href, currentPathname);
 
     return (
-      <li key={`${k}-sidebar-btn-component`}>
+      <li key={``}>
         <Link
           className={cn('flex w-fit max-w-full flex-col rounded-lg', sidebarButtonClassName)}

[NoCoverage] EqualityOperator
components/layouts/dashboard/DashboardSidebar.tsx:55:10
           <span className="sr-only">{title}</span>
           {btnComponent}
         </Link>
-        {k !== lastKey && sidebarBtnsSeparator}
+        {k === lastKey && sidebarBtnsSeparator}
       </li>
     );

[NoCoverage] BooleanLiteral
components/layouts/dashboard/DashboardSidebar.tsx:63:40
 
 // {ToDo} https://github.com/Tirraa/dashboard_rtm/issues/126
 const DashboardSidebar: FunctionComponent<DashboardSidebarProps> = () => {
-  const wasCollapsed = useRef<boolean>(false);
+  const wasCollapsed = useRef<boolean>(true);
   const [isCollapsed, setIsCollapsed] = useState<boolean>(wasCollapsed.current);
   const sidebarRef = useRef<HTMLDivElement>(null);

[NoCoverage] StringLiteral
components/layouts/dashboard/DashboardSidebar.tsx:74:29
     const sidebarInstance = getRefCurrentPtr(sidebarRef);
     if (!sidebarInstance) return;
 
-    const EFFECT_CLASSES = ['transition-all', 'duration-300'];
+    const EFFECT_CLASSES = ["", 'duration-300'];
 
     function applyUncollapsedStyles() {

[NoCoverage] StringLiteral
components/layouts/dashboard/DashboardSidebar.tsx:86:43
     function applyCollapsedStyles() {
       const direction = getDirection();
       if (isLargeScreen) {
-        sidebarInstance.style.marginTop = '0';
+        sidebarInstance.style.marginTop = "";
         if (direction === 'rtl') {
           sidebarInstance.style.marginRight = '-' + sidebarInstance.getBoundingClientRect().width + 'px';

[NoCoverage] ConditionalExpression
components/layouts/dashboard/DashboardSidebar.tsx:87:13
       const direction = getDirection();
       if (isLargeScreen) {
         sidebarInstance.style.marginTop = '0';
-        if (direction === 'rtl') {
+        if (false) {
           sidebarInstance.style.marginRight = '-' + sidebarInstance.getBoundingClientRect().width + 'px';
           sidebarInstance.style.marginLeft = '0';

[NoCoverage] EqualityOperator
components/layouts/dashboard/DashboardSidebar.tsx:87:13
       const direction = getDirection();
       if (isLargeScreen) {
         sidebarInstance.style.marginTop = '0';
-        if (direction === 'rtl') {
+        if (direction !== 'rtl') {
           sidebarInstance.style.marginRight = '-' + sidebarInstance.getBoundingClientRect().width + 'px';
           sidebarInstance.style.marginLeft = '0';

[NoCoverage] StringLiteral
components/layouts/dashboard/DashboardSidebar.tsx:88:101
       if (isLargeScreen) {
         sidebarInstance.style.marginTop = '0';
         if (direction === 'rtl') {
-          sidebarInstance.style.marginRight = '-' + sidebarInstance.getBoundingClientRect().width + 'px';
+          sidebarInstance.style.marginRight = '-' + sidebarInstance.getBoundingClientRect().width + "";
           sidebarInstance.style.marginLeft = '0';
         } else {

[NoCoverage] StringLiteral
components/layouts/dashboard/DashboardSidebar.tsx:88:47
       if (isLargeScreen) {
         sidebarInstance.style.marginTop = '0';
         if (direction === 'rtl') {
-          sidebarInstance.style.marginRight = '-' + sidebarInstance.getBoundingClientRect().width + 'px';
+          sidebarInstance.style.marginRight = "" + sidebarInstance.getBoundingClientRect().width + 'px';
           sidebarInstance.style.marginLeft = '0';
         } else {

[NoCoverage] StringLiteral
components/layouts/dashboard/DashboardSidebar.tsx:91:46
           sidebarInstance.style.marginRight = '-' + sidebarInstance.getBoundingClientRect().width + 'px';
           sidebarInstance.style.marginLeft = '0';
         } else {
-          sidebarInstance.style.marginLeft = '-' + sidebarInstance.getBoundingClientRect().width + 'px';
+          sidebarInstance.style.marginLeft = "" + sidebarInstance.getBoundingClientRect().width + 'px';
           sidebarInstance.style.marginRight = '0';
         }

[NoCoverage] StringLiteral
components/layouts/dashboard/DashboardSidebar.tsx:91:100
           sidebarInstance.style.marginRight = '-' + sidebarInstance.getBoundingClientRect().width + 'px';
           sidebarInstance.style.marginLeft = '0';
         } else {
-          sidebarInstance.style.marginLeft = '-' + sidebarInstance.getBoundingClientRect().width + 'px';
+          sidebarInstance.style.marginLeft = '-' + sidebarInstance.getBoundingClientRect().width + "";
           sidebarInstance.style.marginRight = '0';
         }

[NoCoverage] StringLiteral
components/layouts/dashboard/DashboardSidebar.tsx:95:44
           sidebarInstance.style.marginRight = '0';
         }
       } else {
-        sidebarInstance.style.marginLeft = '0';
+        sidebarInstance.style.marginLeft = "";
         sidebarInstance.style.marginTop = '-' + sidebarInstance.getBoundingClientRect().height + 'px';
       }

[NoCoverage] StringLiteral
components/layouts/dashboard/DashboardSidebar.tsx:96:98
         }
       } else {
         sidebarInstance.style.marginLeft = '0';
-        sidebarInstance.style.marginTop = '-' + sidebarInstance.getBoundingClientRect().height + 'px';
+        sidebarInstance.style.marginTop = '-' + sidebarInstance.getBoundingClientRect().height + "";
       }
       wasCollapsed.current = true;

[NoCoverage] BlockStatement
components/layouts/dashboard/DashboardSidebar.tsx:101:23
       wasCollapsed.current = true;
     }
 
-    if (!isCollapsed) {
-      if (!wasCollapsed.current) sidebarInstance.classList.remove(...EFFECT_CLASSES);
-      else sidebarInstance.classList.add(...EFFECT_CLASSES);
-
-      applyUncollapsedStyles();
-      return;
-    }
+    if (!isCollapsed) {}
 
     if (wasCollapsed.current) sidebarInstance.classList.remove(...EFFECT_CLASSES);

[NoCoverage] StringLiteral
components/layouts/dashboard/DashboardSidebar.tsx:121:29
         ref={sidebarRef}
       >
         <nav className="py-4 text-white lg:overflow-y-auto lg:px-[22px]">
-          <ul className={cn('flex flex-wrap justify-center gap-2 lg:block')} role="menu">
+          <ul className={cn("")} role="menu">
             {sidebarBtnsGenerator(currentPathname)}
           </ul>
