[NoCoverage] StringLiteral
components/layouts/navbar/NavbarLoginButton.tsx:29:21
 
 const NavbarLoginButtonMobile: FunctionComponent<NavbarLoginButtonMobileProps> = ({ currentPathname, session }) => {
   const scopedT = useScopedI18n(i18ns.auth);
-  const className = 'h-full min-w-0 p-0';
+  const className = "";
 
   if (session) {

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarLoginButton.tsx:31:7
   const scopedT = useScopedI18n(i18ns.auth);
   const className = 'h-full min-w-0 p-0';
 
-  if (session) {
+  if (true) {
     return (
       <Button onClick={() => handleSignOut(currentPathname)} withTransparentBackground className={className}>

[NoCoverage] BlockStatement
components/layouts/navbar/NavbarLoginButton.tsx:31:16
   const scopedT = useScopedI18n(i18ns.auth);
   const className = 'h-full min-w-0 p-0';
 
-  if (session) {
-    return (
-      <Button onClick={() => handleSignOut(currentPathname)} withTransparentBackground className={className}>
-        <UserImage className="absolute rounded-full brightness-75" user={session?.user} height={SIZE} width={SIZE} />
-        <SignalSlashIcon className="relative shadow-xl" height={SIZE} width={SIZE} />
-        <span className="sr-only">{scopedT('logout')}</span>
-      </Button>
-    );
-  }
+  if (session) {}
 
   return (

[NoCoverage] ArrowFunction
components/layouts/navbar/NavbarLoginButton.tsx:33:24
 
   if (session) {
     return (
-      <Button onClick={() => handleSignOut(currentPathname)} withTransparentBackground className={className}>
+      <Button onClick={() => undefined} withTransparentBackground className={className}>
         <UserImage className="absolute rounded-full brightness-75" user={session?.user} height={SIZE} width={SIZE} />
         <SignalSlashIcon className="relative shadow-xl" height={SIZE} width={SIZE} />

[NoCoverage] OptionalChaining
components/layouts/navbar/NavbarLoginButton.tsx:34:74
   if (session) {
     return (
       <Button onClick={() => handleSignOut(currentPathname)} withTransparentBackground className={className}>
-        <UserImage className="absolute rounded-full brightness-75" user={session?.user} height={SIZE} width={SIZE} />
+        <UserImage className="absolute rounded-full brightness-75" user={session.user} height={SIZE} width={SIZE} />
         <SignalSlashIcon className="relative shadow-xl" height={SIZE} width={SIZE} />
         <span className="sr-only">{scopedT('logout')}</span>

[NoCoverage] ArrowFunction
components/layouts/navbar/NavbarLoginButton.tsx:42:22
   }
 
   return (
-    <Button onClick={() => signIn('discord', { callbackUrl: ROUTES_ROOTS.DASHBOARD })} withTransparentBackground className={className}>
+    <Button onClick={() => undefined} withTransparentBackground className={className}>
       <KeyIcon height={SIZE} width={SIZE} />
       <span className="sr-only">{scopedT('login')}</span>

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarLoginButton.tsx:54:7
   const currentPathname = usePathname();
   const { auth } = i18ns;
 
-  if (isMobile) return <NavbarLoginButtonMobile currentPathname={currentPathname} session={session} />;
+  if (true) return <NavbarLoginButtonMobile currentPathname={currentPathname} session={session} />;
 
   if (session) {

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarLoginButton.tsx:54:7
   const currentPathname = usePathname();
   const { auth } = i18ns;
 
-  if (isMobile) return <NavbarLoginButtonMobile currentPathname={currentPathname} session={session} />;
+  if (false) return <NavbarLoginButtonMobile currentPathname={currentPathname} session={session} />;
 
   if (session) {

[NoCoverage] BlockStatement
components/layouts/navbar/NavbarLoginButton.tsx:56:16
 
   if (isMobile) return <NavbarLoginButtonMobile currentPathname={currentPathname} session={session} />;
 
-  if (session) {
-    return (
-      <NavbarButton
-        icon={<UserImage className="rounded-full" user={session?.user} height={SIZE} width={SIZE} />}
-        onClick={() => handleSignOut(currentPathname)}
-        i18nTitle={`${auth}.logout`}
-      />
-    );
-  }
+  if (session) {}
 
   return <NavbarButton onClick={() => signIn('discord', { callbackUrl: ROUTES_ROOTS.DASHBOARD })} i18nTitle={`${auth}.login`} />;

[NoCoverage] OptionalChaining
components/layouts/navbar/NavbarLoginButton.tsx:59:57
   if (session) {
     return (
       <NavbarButton
-        icon={<UserImage className="rounded-full" user={session?.user} height={SIZE} width={SIZE} />}
+        icon={<UserImage className="rounded-full" user={session.user} height={SIZE} width={SIZE} />}
         onClick={() => handleSignOut(currentPathname)}
         i18nTitle={`${auth}.logout`}

[NoCoverage] ArrowFunction
components/layouts/navbar/NavbarLoginButton.tsx:60:18
     return (
       <NavbarButton
         icon={<UserImage className="rounded-full" user={session?.user} height={SIZE} width={SIZE} />}
-        onClick={() => handleSignOut(currentPathname)}
+        onClick={() => undefined}
         i18nTitle={`${auth}.logout`}
       />

[NoCoverage] ArrowFunction
components/layouts/navbar/NavbarLoginButton.tsx:66:33
     );
   }
 
-  return <NavbarButton onClick={() => signIn('discord', { callbackUrl: ROUTES_ROOTS.DASHBOARD })} i18nTitle={`${auth}.login`} />;
+  return <NavbarButton onClick={() => undefined} i18nTitle={`${auth}.login`} />;
 };
 

[NoCoverage] StringLiteral
components/layouts/navbar/NavbarLoginButton.tsx:66:46
     );
   }
 
-  return <NavbarButton onClick={() => signIn('discord', { callbackUrl: ROUTES_ROOTS.DASHBOARD })} i18nTitle={`${auth}.login`} />;
+  return <NavbarButton onClick={() => signIn("", { callbackUrl: ROUTES_ROOTS.DASHBOARD })} i18nTitle={`${auth}.login`} />;
 };
 
