[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:123:9
   if (seo === undefined) {
     const alternates = { canonical, languages };
     const openGraph: OpenGraph = { url: currentPost.url };
-    if (openGraphImages === undefined) return { metadataBase, description, alternates, openGraph, title };
+    if (false) return { metadataBase, description, alternates, openGraph, title };
     openGraph.images = openGraphImages;
     return { metadataBase, description, alternates, openGraph, title };

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:123:9
   if (seo === undefined) {
     const alternates = { canonical, languages };
     const openGraph: OpenGraph = { url: currentPost.url };
-    if (openGraphImages === undefined) return { metadataBase, description, alternates, openGraph, title };
+    if (true) return { metadataBase, description, alternates, openGraph, title };
     openGraph.images = openGraphImages;
     return { metadataBase, description, alternates, openGraph, title };

[NoCoverage] ObjectLiteral
src/lib/blog/staticGeneration.ts:125:12
     const openGraph: OpenGraph = { url: currentPost.url };
     if (openGraphImages === undefined) return { metadataBase, description, alternates, openGraph, title };
     openGraph.images = openGraphImages;
-    return { metadataBase, description, alternates, openGraph, title };
+    return {};
   }
 

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:138:7
 
   if (openGraph === undefined) openGraph = {};
   (openGraph as OpenGraph).url = currentPost.url;
-  if (alternates) (alternates as AlternateURLs).languages = languages;
+  if (true) (alternates as AlternateURLs).languages = languages;
   if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;
 

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:138:7
 
   if (openGraph === undefined) openGraph = {};
   (openGraph as OpenGraph).url = currentPost.url;
-  if (alternates) (alternates as AlternateURLs).languages = languages;
+  if (false) (alternates as AlternateURLs).languages = languages;
   if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;
 
