[Killed] BooleanLiteral
src/config/Auth/authOptions.ts:16:7
   const freshProfile = await __discordApi.getFreshProfile(sub);
 
   const { epicFail, avatar, id } = freshProfile;
-  if (!avatar || !id) return null;
+  if (avatar || !id) return null;
   if (epicFail) return avatar;
 
killedBy: getDiscordProfilePicture (rate limited) should cache a fallback ImageURL, given unhappy path (all is valid, but we got rate limited and empty cache)
statusReason: .toMatch() expects to receive a string, but got object

[Killed] ConditionalExpression
src/config/Auth/authOptions.ts:16:7
   const freshProfile = await __discordApi.getFreshProfile(sub);
 
   const { epicFail, avatar, id } = freshProfile;
-  if (!avatar || !id) return null;
+  if (false) return null;
   if (epicFail) return avatar;
 
killedBy: getDiscordProfilePicture should return null, given empty avatar field
statusReason: expected 'https://cdn.discordapp.com/avatars/FA…' to be null // Object.is equality

[Killed] ConditionalExpression
src/config/Auth/authOptions.ts:17:7
 
   const { epicFail, avatar, id } = freshProfile;
   if (!avatar || !id) return null;
-  if (epicFail) return avatar;
+  if (true) return avatar;
 
   const format = avatar.startsWith('a_') ? 'gif' : 'png';
killedBy: getDiscordProfilePicture should return a PNG Discord avatar URL, given a plain avatar/id couple
statusReason: expected 'FAKE_AVATAR' to be 'https://cdn.discordapp.com/avatars/FA…' // Object.is equality

[Killed] ConditionalExpression
src/config/Auth/authOptions.ts:17:7
 
   const { epicFail, avatar, id } = freshProfile;
   if (!avatar || !id) return null;
-  if (epicFail) return avatar;
+  if (false) return avatar;
 
   const format = avatar.startsWith('a_') ? 'gif' : 'png';
killedBy: getDiscordProfilePicture (rate limited) should cache a fallback ImageURL, given unhappy path (all is valid, but we got rate limited and empty cache)
statusReason: expected 'https://cdn.discordapp.com/avatars/FA…' to match /^https:\/\/cdn\.discordapp\.com\/emb…/\

[Killed] MethodExpression
src/config/Auth/authOptions.ts:19:18
   if (!avatar || !id) return null;
   if (epicFail) return avatar;
 
-  const format = avatar.startsWith('a_') ? 'gif' : 'png';
+  const format = avatar.endsWith('a_') ? 'gif' : 'png';
   const imageURL = `https://cdn.discordapp.com/avatars/${id}/${avatar}.${format}`;
 
killedBy: getDiscordProfilePicture should return a GIF Discord avatar URL, given an avatar field starting with "a_"
statusReason: expected 'https://cdn.discordapp.com/avatars/FA…' to be 'https://cdn.discordapp.com/avatars/FA…' // Object.is equality

[Killed] StringLiteral
src/config/Auth/authOptions.ts:20:20
   if (epicFail) return avatar;
 
   const format = avatar.startsWith('a_') ? 'gif' : 'png';
-  const imageURL = `https://cdn.discordapp.com/avatars/${id}/${avatar}.${format}`;
+  const imageURL = ``;
 
   return imageURL;
killedBy: getDiscordProfilePicture should return a PNG Discord avatar URL, given a plain avatar/id couple
statusReason: expected '' to be 'https://cdn.discordapp.com/avatars/FA…' // Object.is equality

[Killed] BooleanLiteral
src/config/Auth/authOptions.ts:27:7
 
 export async function getSession(session: Session, token: JWT, __discordApi: IDiscordApi = discordApi) {
   const BOT_TOKEN = process.env.DISCORD_BOT_TOKEN;
-  if (!BOT_TOKEN) return session;
+  if (BOT_TOKEN) return session;
 
   const { sub: id } = token;
killedBy: getDiscordProfilePicture (rate limited) should cache a fallback ImageURL, given unhappy path (all is valid, but we got rate limited and empty cache)
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] ConditionalExpression
src/config/Auth/authOptions.ts:27:7
 
 export async function getSession(session: Session, token: JWT, __discordApi: IDiscordApi = discordApi) {
   const BOT_TOKEN = process.env.DISCORD_BOT_TOKEN;
-  if (!BOT_TOKEN) return session;
+  if (false) return session;
 
   const { sub: id } = token;
killedBy: Caching test should return session as is, given unhappy path (undefined DISCORD_BOT_TOKEN)
statusReason: expected 'https://cdn.discordapp.com/avatars/FA…' to be undefined // Object.is equality

[Killed] ConditionalExpression
src/config/Auth/authOptions.ts:41:7
     660_000
   )) as MaybeNull<Href>; // TTL: https://discord.com/developers/docs/topics/rate-limits#invalid-request-limit-aka-cloudflare-bans
 
-  if (imageURL === null) return session;
+  if (true) return session;
 
   return {
killedBy: getDiscordProfilePicture (rate limited) should cache a fallback ImageURL, given unhappy path (all is valid, but we got rate limited and empty cache)
statusReason: expected { user: { …(2) }, …(1) } to strictly equal { user: { …(3) }, …(1) }

[Killed] ConditionalExpression
src/config/Auth/authOptions.ts:41:7
     660_000
   )) as MaybeNull<Href>; // TTL: https://discord.com/developers/docs/topics/rate-limits#invalid-request-limit-aka-cloudflare-bans
 
-  if (imageURL === null) return session;
+  if (false) return session;
 
   return {
killedBy: Caching test should return session as is, given unhappy path (failed to get imageURL)
statusReason: expected { user: { …(3) }, …(1) } to strictly equal { user: { …(2) }, …(1) }
