[NoCoverage] ObjectLiteral
src/lib/landingPages/staticGeneration.ts:74:39
   const [xDefault, canonical] = getXDefaultAndCanonical(currentLp, slug, language, middlewareStrategy);
   if (xDefault !== undefined) languages['x-default'] = xDefault;
 
-  const defaultOpenGraph: OpenGraph = { url: currentLp.url };
+  const defaultOpenGraph: OpenGraph = {};
   if (seo === undefined) return { alternates: { canonical, languages }, openGraph: defaultOpenGraph, metadataBase, description, title };
 

[NoCoverage] ConditionalExpression
src/lib/landingPages/staticGeneration.ts:79:7
 
   const { openGraph = defaultOpenGraph, alternates, robots } = seo;
 
-  if ((openGraph as OpenGraph).url === undefined) (openGraph as OpenGraph).url = currentLp.url;
+  if (true) (openGraph as OpenGraph).url = currentLp.url;
   if (alternates) (alternates as AlternateURLs).languages = languages;
   if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;

[NoCoverage] EqualityOperator
src/lib/landingPages/staticGeneration.ts:79:7
 
   const { openGraph = defaultOpenGraph, alternates, robots } = seo;
 
-  if ((openGraph as OpenGraph).url === undefined) (openGraph as OpenGraph).url = currentLp.url;
+  if ((openGraph as OpenGraph).url !== undefined) (openGraph as OpenGraph).url = currentLp.url;
   if (alternates) (alternates as AlternateURLs).languages = languages;
   if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;

[NoCoverage] ConditionalExpression
src/lib/landingPages/staticGeneration.ts:80:7
   const { openGraph = defaultOpenGraph, alternates, robots } = seo;
 
   if ((openGraph as OpenGraph).url === undefined) (openGraph as OpenGraph).url = currentLp.url;
-  if (alternates) (alternates as AlternateURLs).languages = languages;
+  if (true) (alternates as AlternateURLs).languages = languages;
   if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;
 

[NoCoverage] ConditionalExpression
src/lib/landingPages/staticGeneration.ts:80:7
   const { openGraph = defaultOpenGraph, alternates, robots } = seo;
 
   if ((openGraph as OpenGraph).url === undefined) (openGraph as OpenGraph).url = currentLp.url;
-  if (alternates) (alternates as AlternateURLs).languages = languages;
+  if (false) (alternates as AlternateURLs).languages = languages;
   if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;
 
