[NoCoverage] ConditionalExpression
src/lib/pages/staticGeneration.ts:75:7
   }
 
   const maybeDefaultLanguagePage = getPageByLanguageAndPathUnstrict(DEFAULT_LANGUAGE, path);
-  if (maybeDefaultLanguagePage !== null) languages['x-default'] = getPathnameWithoutI18nFlag(currentPage.url);
+  if (true) languages['x-default'] = getPathnameWithoutI18nFlag(currentPage.url);
 
   const [xDefault, canonical] = getXDefaultAndCanonical(currentPage, path, language, middlewareStrategy);

[NoCoverage] EqualityOperator
src/lib/pages/staticGeneration.ts:75:7
   }
 
   const maybeDefaultLanguagePage = getPageByLanguageAndPathUnstrict(DEFAULT_LANGUAGE, path);
-  if (maybeDefaultLanguagePage !== null) languages['x-default'] = getPathnameWithoutI18nFlag(currentPage.url);
+  if (maybeDefaultLanguagePage === null) languages['x-default'] = getPathnameWithoutI18nFlag(currentPage.url);
 
   const [xDefault, canonical] = getXDefaultAndCanonical(currentPage, path, language, middlewareStrategy);

[NoCoverage] ConditionalExpression
src/lib/pages/staticGeneration.ts:85:7
 
   const { openGraph = defaultOpenGraph, alternates, robots } = seo;
 
-  if ((openGraph as OpenGraph).url === undefined) (openGraph as OpenGraph).url = currentPage.url;
+  if (true) (openGraph as OpenGraph).url = currentPage.url;
   if (alternates) (alternates as AlternateURLs).languages = languages;
   if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;

[NoCoverage] EqualityOperator
src/lib/pages/staticGeneration.ts:85:7
 
   const { openGraph = defaultOpenGraph, alternates, robots } = seo;
 
-  if ((openGraph as OpenGraph).url === undefined) (openGraph as OpenGraph).url = currentPage.url;
+  if ((openGraph as OpenGraph).url !== undefined) (openGraph as OpenGraph).url = currentPage.url;
   if (alternates) (alternates as AlternateURLs).languages = languages;
   if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;

[NoCoverage] ConditionalExpression
src/lib/pages/staticGeneration.ts:86:7
   const { openGraph = defaultOpenGraph, alternates, robots } = seo;
 
   if ((openGraph as OpenGraph).url === undefined) (openGraph as OpenGraph).url = currentPage.url;
-  if (alternates) (alternates as AlternateURLs).languages = languages;
+  if (true) (alternates as AlternateURLs).languages = languages;
   if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;
 

[NoCoverage] ConditionalExpression
src/lib/pages/staticGeneration.ts:86:7
   const { openGraph = defaultOpenGraph, alternates, robots } = seo;
 
   if ((openGraph as OpenGraph).url === undefined) (openGraph as OpenGraph).url = currentPage.url;
-  if (alternates) (alternates as AlternateURLs).languages = languages;
+  if (false) (alternates as AlternateURLs).languages = languages;
   if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;
 
