[NoCoverage] BlockStatement
(pages)/(withfooter)/[...path]/page.tsx:15:63
 import { notFound } from 'next/navigation';
 import { cn } from '@/lib/tailwind';
 
-export async function generateMetadata({ params }: PageProps) {
-  const metadatas = await getPageMetadatas({ params }, I18N_MIDDLEWARE_CONFIG.urlMappingStrategy);
-  return metadatas;
-}
+export async function generateMetadata({ params }: PageProps) {}
 
 export function generateStaticParams() {

[NoCoverage] BlockStatement
(pages)/(withfooter)/[...path]/page.tsx:20:40
   return metadatas;
 }
 
-export function generateStaticParams() {
-  const staticParams = getPageStaticParams();
-  return staticParams;
-}
+export function generateStaticParams() {}
 
 export default function Page({ params }: PageProps) {

[NoCoverage] BlockStatement
(pages)/(withfooter)/[...path]/page.tsx:25:53
   return staticParams;
 }
 
-export default function Page({ params }: PageProps) {
-  const language = params[I18nTaxonomy.LANGUAGE];
-  setStaticParamsLocale(language);
-
-  const path = params[PageTaxonomy.PATH].join('/');
-  if (isSkippedPath(path)) notFound();
-
-  const page = getPageByLanguageAndPathUnstrict(language, path);
-  if (!page) notFound();
-
-  return (
-    <main className={cn('max-w-full', MAIN_CLS)}>
-      <PageMDX code={page.body.code} />
-    </main>
-  );
-}
+export default function Page({ params }: PageProps) {}
 

[NoCoverage] StringLiteral
(pages)/(withfooter)/[...path]/page.tsx:29:47
   const language = params[I18nTaxonomy.LANGUAGE];
   setStaticParamsLocale(language);
 
-  const path = params[PageTaxonomy.PATH].join('/');
+  const path = params[PageTaxonomy.PATH].join("");
   if (isSkippedPath(path)) notFound();
 

[NoCoverage] ConditionalExpression
(pages)/(withfooter)/[...path]/page.tsx:30:7
   setStaticParamsLocale(language);
 
   const path = params[PageTaxonomy.PATH].join('/');
-  if (isSkippedPath(path)) notFound();
+  if (false) notFound();
 
   const page = getPageByLanguageAndPathUnstrict(language, path);
