[NoCoverage] BlockStatement
(pages)/(withfooter)/blog/page.tsx:9:40
 import { getStaticParams } from '@/i18n/server';
 import { cn } from '@/lib/tailwind';
 
-export function generateStaticParams() {
-  return getStaticParams();
-}
+export function generateStaticParams() {}
 
 export default function Page({ params }: I18nPageProps) {

[NoCoverage] BlockStatement
(pages)/(withfooter)/blog/page.tsx:13:57
   return getStaticParams();
 }
 
-export default function Page({ params }: I18nPageProps) {
-  const language = params[I18nTaxonomy.LANGUAGE];
-  setStaticParamsLocale(language);
-
-  return (
-    <main className={cn('flex flex-1 flex-col justify-center', MAIN_CLS)}>
-      <p className="text-center">ToDo</p>
-    </main>
-  );
-}
+export default function Page({ params }: I18nPageProps) {}
 
