[Killed] BlockStatement
src/cache/blog.ts:24:47
     return emptySet;
   }
 
-  for (const { subcategory } of relatedPosts) {
-    subcategoriesSet.add(subcategory as BlogSubcategoryFromUnknownCategory);
-  }
+  for (const { subcategory } of relatedPosts) {}
 
   return subcategoriesSet;
killedBy: getPostStrict (happy paths) should return a valid post
statusReason: Cannot read properties of null (reading 'category')

[Killed] BlockStatement
src/cache/blog.ts:31:101
   return subcategoriesSet;
 }
 
-async function populateSubcategoriesCollectionCache(category: BlogCategory, language: LanguageFlag) {
-  const subcategsSet: Set<BlogSubcategoryFromUnknownCategory> = await buildSubcategoriesSet(category, language);
-  BlogCache.subcategoriesCollection[language][category] = Array.from(subcategsSet);
-}
+async function populateSubcategoriesCollectionCache(category: BlogCategory, language: LanguageFlag) {}
 
 async function subcategoriesByCategoryGetter(category: BlogCategory, language: LanguageFlag) {
killedBy: getPostStrict (happy paths) should return a valid post
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] BlockStatement
src/cache/blog.ts:39:66
 async function subcategoriesByCategoryGetter(category: BlogCategory, language: LanguageFlag) {
   // Stryker Workaround 1. Mutant will be killed with `if (false)` as expected, but `if (true)` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
-  if (BlogCache.subcategoriesCollection[language] === undefined) {
-    BlogCache.subcategoriesCollection[language] = {} as Record<BlogCategory, BlogSubcategoryFromUnknownCategory[]>;
-  }
+  if (BlogCache.subcategoriesCollection[language] === undefined) {}
 
   // Idem (see Stryker Workaround 1).
killedBy: getAllBlogPostsByCategoryAndSubcategoryAndLanguageStrict (happy paths) should return 5 posts, given the fake language 'posts'
statusReason: Cannot read properties of undefined (reading 'blog-testing-category')

[Killed] EqualityOperator
src/cache/blog.ts:39:7
 async function subcategoriesByCategoryGetter(category: BlogCategory, language: LanguageFlag) {
   // Stryker Workaround 1. Mutant will be killed with `if (false)` as expected, but `if (true)` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
-  if (BlogCache.subcategoriesCollection[language] === undefined) {
+  if (BlogCache.subcategoriesCollection[language] !== undefined) {
     BlogCache.subcategoriesCollection[language] = {} as Record<BlogCategory, BlogSubcategoryFromUnknownCategory[]>;
   }
killedBy: getAllBlogPostsByCategoryAndSubcategoryAndLanguageStrict (happy paths) should return 5 posts, given the fake language 'posts'
statusReason: Cannot read properties of undefined (reading 'blog-testing-category')

[Killed] EqualityOperator
src/cache/blog.ts:45:7
 
   // Idem (see Stryker Workaround 1).
   // Stryker disable next-line ConditionalExpression
-  if (BlogCache.subcategoriesCollection[language][category] === undefined) await populateSubcategoriesCollectionCache(category, language);
+  if (BlogCache.subcategoriesCollection[language][category] !== undefined) await populateSubcategoriesCollectionCache(category, language);
   return BlogCache.subcategoriesCollection[language][category];
 }
killedBy: getPostStrict (happy paths) should return a valid post
statusReason: Cannot read properties of undefined (reading 'includes')
