[Killed] StringLiteral
src/cache/generic.ts:11:42
 }
 
 export const keysFactory = {
-  discordProfilePicture: (id: string) => `discord:pp:${id}`
+  discordProfilePicture: (id: string) => ``
 };
 
killedBy: Caching test should return session as is, given unhappy path (failed to get imageURL)
statusReason: expected null to be undefined // Object.is equality

[Killed] BlockStatement
src/cache/generic.ts:14:50
   discordProfilePicture: (id: string) => `discord:pp:${id}`
 };
 
-function invalidateExpiredCacheData(key: string) {
-  if (GenericInMemoryCache.data[key] === undefined) return;
-
-  const clock = GenericInMemoryCache.data[key].clock;
-  if (!clock) return;
-
-  const { cachedAt, ttl } = clock;
-  if (Math.abs(Date.now() - cachedAt) > ttl) delete GenericInMemoryCache.data[key];
-}
+function invalidateExpiredCacheData(key: string) {}
 
 export function get(key: string) {
killedBy: get and set should set the value with a clock, then destroy the value (timed out)
statusReason: expected '__VALUE__' to be undefined // Object.is equality

[Killed] ConditionalExpression
src/cache/generic.ts:15:7
 };
 
 function invalidateExpiredCacheData(key: string) {
-  if (GenericInMemoryCache.data[key] === undefined) return;
+  if (true) return;
 
   const clock = GenericInMemoryCache.data[key].clock;
killedBy: get and set should set the value with a clock, then destroy the value (timed out)
statusReason: expected '__VALUE__' to be undefined // Object.is equality

[Killed] EqualityOperator
src/cache/generic.ts:15:7
 };
 
 function invalidateExpiredCacheData(key: string) {
-  if (GenericInMemoryCache.data[key] === undefined) return;
+  if (GenericInMemoryCache.data[key] !== undefined) return;
 
   const clock = GenericInMemoryCache.data[key].clock;
killedBy: get and set should set the value with a clock, then destroy the value (timed out)
statusReason: expected '__VALUE__' to be undefined // Object.is equality

[Killed] BooleanLiteral
src/cache/generic.ts:18:7
   if (GenericInMemoryCache.data[key] === undefined) return;
 
   const clock = GenericInMemoryCache.data[key].clock;
-  if (!clock) return;
+  if (clock) return;
 
   const { cachedAt, ttl } = clock;
killedBy: get and set should set the value with a clock, then destroy it (TTL invalidation)
statusReason: Cannot destructure property 'cachedAt' of 'clock' as it is undefined.

[Killed] ConditionalExpression
src/cache/generic.ts:18:7
   if (GenericInMemoryCache.data[key] === undefined) return;
 
   const clock = GenericInMemoryCache.data[key].clock;
-  if (!clock) return;
+  if (false) return;
 
   const { cachedAt, ttl } = clock;
killedBy: get and set should set the value with a clock, then destroy it (TTL invalidation)
statusReason: Cannot destructure property 'cachedAt' of 'clock' as it is undefined.

[Killed] ConditionalExpression
src/cache/generic.ts:21:7
   if (!clock) return;
 
   const { cachedAt, ttl } = clock;
-  if (Math.abs(Date.now() - cachedAt) > ttl) delete GenericInMemoryCache.data[key];
+  if (false) delete GenericInMemoryCache.data[key];
 }
 
killedBy: get and set should set the value with a clock, then destroy the value (timed out)
statusReason: expected '__VALUE__' to be undefined // Object.is equality

[Killed] ArithmeticOperator
src/cache/generic.ts:21:16
   if (!clock) return;
 
   const { cachedAt, ttl } = clock;
-  if (Math.abs(Date.now() - cachedAt) > ttl) delete GenericInMemoryCache.data[key];
+  if (Math.abs(Date.now() + cachedAt) > ttl) delete GenericInMemoryCache.data[key];
 }
 
killedBy: get and set should set the value with a clock, then destroy it (TTL invalidation)
statusReason: expected undefined to be '__VALUE__' // Object.is equality

[Killed] OptionalChaining
src/cache/generic.ts:26:10
 
 export function get(key: string) {
   invalidateExpiredCacheData(key);
-  return GenericInMemoryCache.data[key]?.value;
+  return GenericInMemoryCache.data[key].value;
 }
 
killedBy: get and set should set the value with a clock, then destroy the value (timed out)
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] BlockStatement
src/cache/generic.ts:29:39
   return GenericInMemoryCache.data[key]?.value;
 }
 
-export function getClock(key: string) {
-  invalidateExpiredCacheData(key);
-  return GenericInMemoryCache.data[key]?.clock;
-}
+export function getClock(key: string) {}
 
 // eslint-disable-next-line no-magic-numbers
killedBy: get and set should set the value with a clock, then destroy it (TTL invalidation)
statusReason: expected undefined to deeply equal { cachedAt: Any<Number>, ttl: 10000 }

[Survived] OptionalChaining
src/cache/generic.ts:31:10
 
 export function getClock(key: string) {
   invalidateExpiredCacheData(key);
-  return GenericInMemoryCache.data[key]?.clock;
+  return GenericInMemoryCache.data[key].clock;
 }
 

[Killed] BlockStatement
src/cache/generic.ts:35:64
 }
 
 // eslint-disable-next-line no-magic-numbers
-export function set(key: string, data: Data, ttl: MsValue = 0) {
-  function setClock(key: string, ttl: MsValue) {
-    GenericInMemoryCache.data[key].clock = {
-      cachedAt: Date.now(),
-      ttl
-    };
-  }
-
-  function disposeClock(key: string) {
-    // @ts-expect-error - IDGAF lemme manipulate the RAM
-    GenericInMemoryCache.data[key].clock = undefined;
-  }
-
-  if (!GenericInMemoryCache.data[key]) GenericInMemoryCache.data[key] = {} as DataCacheEntry;
-  GenericInMemoryCache.data[key].value = typeof data === 'object' ? structuredClone(data) : data;
-
-  // eslint-disable-next-line no-magic-numbers
-  if (ttl > 0) setClock(key, ttl);
-  // eslint-disable-next-line no-magic-numbers
-  else if (ttl < 0) disposeClock(key);
-}
+export function set(key: string, data: Data, ttl: MsValue = 0) {}
 
 // eslint-disable-next-line no-magic-numbers
killedBy: get and set should set the value with a clock, then destroy it (TTL invalidation)
statusReason: expected undefined to be '__VALUE__' // Object.is equality

[Killed] BlockStatement
src/cache/generic.ts:36:48
 
 // eslint-disable-next-line no-magic-numbers
 export function set(key: string, data: Data, ttl: MsValue = 0) {
-  function setClock(key: string, ttl: MsValue) {
-    GenericInMemoryCache.data[key].clock = {
-      cachedAt: Date.now(),
-      ttl
-    };
-  }
+  function setClock(key: string, ttl: MsValue) {}
 
   function disposeClock(key: string) {
killedBy: get and set should set the value with a clock, then destroy it (TTL invalidation)
statusReason: expected undefined to deeply equal { cachedAt: Any<Number>, ttl: 10000 }

[Killed] BlockStatement
src/cache/generic.ts:43:38
     };
   }
 
-  function disposeClock(key: string) {
-    // @ts-expect-error - IDGAF lemme manipulate the RAM
-    GenericInMemoryCache.data[key].clock = undefined;
-  }
+  function disposeClock(key: string) {}
 
   if (!GenericInMemoryCache.data[key]) GenericInMemoryCache.data[key] = {} as DataCacheEntry;
killedBy: get and set should set the value with a clock, then destroy it (TTL invalidation)
statusReason: expected { cachedAt: 1715836927570, ttl: 10000 } to be undefined // Object.is equality

[Killed] ConditionalExpression
src/cache/generic.ts:48:7
     GenericInMemoryCache.data[key].clock = undefined;
   }
 
-  if (!GenericInMemoryCache.data[key]) GenericInMemoryCache.data[key] = {} as DataCacheEntry;
+  if (false) GenericInMemoryCache.data[key] = {} as DataCacheEntry;
   GenericInMemoryCache.data[key].value = typeof data === 'object' ? structuredClone(data) : data;
 
killedBy: get and set should set the value with a clock, then destroy it (TTL invalidation)
statusReason: Cannot set properties of undefined (setting 'value')

[Killed] BooleanLiteral
src/cache/generic.ts:48:7
     GenericInMemoryCache.data[key].clock = undefined;
   }
 
-  if (!GenericInMemoryCache.data[key]) GenericInMemoryCache.data[key] = {} as DataCacheEntry;
+  if (GenericInMemoryCache.data[key]) GenericInMemoryCache.data[key] = {} as DataCacheEntry;
   GenericInMemoryCache.data[key].value = typeof data === 'object' ? structuredClone(data) : data;
 
killedBy: get and set should set the value with a clock, then destroy it (TTL invalidation)
statusReason: Cannot set properties of undefined (setting 'value')

[Survived] ConditionalExpression
src/cache/generic.ts:49:42
   }
 
   if (!GenericInMemoryCache.data[key]) GenericInMemoryCache.data[key] = {} as DataCacheEntry;
-  GenericInMemoryCache.data[key].value = typeof data === 'object' ? structuredClone(data) : data;
+  GenericInMemoryCache.data[key].value = true ? structuredClone(data) : data;
 
   // eslint-disable-next-line no-magic-numbers

[Survived] ConditionalExpression
src/cache/generic.ts:49:42
   }
 
   if (!GenericInMemoryCache.data[key]) GenericInMemoryCache.data[key] = {} as DataCacheEntry;
-  GenericInMemoryCache.data[key].value = typeof data === 'object' ? structuredClone(data) : data;
+  GenericInMemoryCache.data[key].value = false ? structuredClone(data) : data;
 
   // eslint-disable-next-line no-magic-numbers

[Killed] EqualityOperator
src/cache/generic.ts:52:7
   GenericInMemoryCache.data[key].value = typeof data === 'object' ? structuredClone(data) : data;
 
   // eslint-disable-next-line no-magic-numbers
-  if (ttl > 0) setClock(key, ttl);
+  if (ttl <= 0) setClock(key, ttl);
   // eslint-disable-next-line no-magic-numbers
   else if (ttl < 0) disposeClock(key);
killedBy: get and set should set the value with a clock, then destroy it (TTL invalidation)
statusReason: expected undefined to deeply equal { cachedAt: Any<Number>, ttl: 10000 }

[Killed] ConditionalExpression
src/cache/generic.ts:52:7
   GenericInMemoryCache.data[key].value = typeof data === 'object' ? structuredClone(data) : data;
 
   // eslint-disable-next-line no-magic-numbers
-  if (ttl > 0) setClock(key, ttl);
+  if (false) setClock(key, ttl);
   // eslint-disable-next-line no-magic-numbers
   else if (ttl < 0) disposeClock(key);
killedBy: get and set should set the value with a clock, then destroy it (TTL invalidation)
statusReason: expected undefined to deeply equal { cachedAt: Any<Number>, ttl: 10000 }

[Killed] ConditionalExpression
src/cache/generic.ts:54:12
   // eslint-disable-next-line no-magic-numbers
   if (ttl > 0) setClock(key, ttl);
   // eslint-disable-next-line no-magic-numbers
-  else if (ttl < 0) disposeClock(key);
+  else if (false) disposeClock(key);
 }
 
killedBy: get and set should set the value with a clock, then destroy it (TTL invalidation)
statusReason: expected { cachedAt: 1715836968058, ttl: 10000 } to be undefined // Object.is equality

[Killed] EqualityOperator
src/cache/generic.ts:54:12
   // eslint-disable-next-line no-magic-numbers
   if (ttl > 0) setClock(key, ttl);
   // eslint-disable-next-line no-magic-numbers
-  else if (ttl < 0) disposeClock(key);
+  else if (ttl >= 0) disposeClock(key);
 }
 
killedBy: get and set should set the value with a clock, then destroy it (TTL invalidation)
statusReason: expected { cachedAt: 1715836972456, ttl: 10000 } to be undefined // Object.is equality

[Killed] EqualityOperator
src/cache/generic.ts:60:7
 // eslint-disable-next-line no-magic-numbers
 export async function getOrSet(key: string, data: () => Promise<Data>, ttl: MsValue = 0) {
   const value: MaybeUndefined<Data> = get(key);
-  if (value !== undefined) return value;
+  if (value === undefined) return value;
 
   const mountedData = await data();
killedBy: get or set should set the value with a clock, then destroy the value (timed out)
statusReason: expected undefined to be '__VALUE__' // Object.is equality

[Killed] ConditionalExpression
src/cache/generic.ts:60:7
 // eslint-disable-next-line no-magic-numbers
 export async function getOrSet(key: string, data: () => Promise<Data>, ttl: MsValue = 0) {
   const value: MaybeUndefined<Data> = get(key);
-  if (value !== undefined) return value;
+  if (true) return value;
 
   const mountedData = await data();
killedBy: get or set should set the value with a clock, then destroy the value (timed out)
statusReason: expected undefined to be '__VALUE__' // Object.is equality

[Killed] BlockStatement
src/cache/generic.ts:67:28
   return get(key);
 }
 
-export function clearAll() {
-  for (const key of Object.keys(GenericInMemoryCache.data)) delete GenericInMemoryCache.data[key];
-}
+export function clearAll() {}
 
 type Data = boolean | string | number | object | null;
killedBy: Caching test should cache the ImageURL, given happy path
statusReason: expected 'FAKE_URL' to be 'https://cdn.discordapp.com/avatars/FA…' // Object.is equality
