[Killed] ArithmeticOperator
hooks/helpers/functions/usePagination.ts:3:83
 import type { Quantity, Limit } from '@rtm/shared-types/Numbers';
 
-export const computePagesAmount = (total: Quantity, perChunk: Limit) => Math.ceil(total / perChunk);
+export const computePagesAmount = (total: Quantity, perChunk: Limit) => Math.ceil(total * perChunk);
 
killedBy: usePagination should return 2, given a list of 10 elements and expecting 5 items per page
statusReason: expected 50 to be 2 // Object.is equality
