[NoCoverage] StringLiteral
src/components/hooks/useLockScreenScrollY.ts:4:32
 import { getBodyContainer } from '@/lib/html';
 import { useLayoutEffect } from 'react';
 
-export const EFFECT_CLASSES = ['h-100svh', 'overflow-y-hidden'];
+export const EFFECT_CLASSES = ["", 'overflow-y-hidden'];
 
 const useLockScreenScrollY = () =>

[NoCoverage] ArrowFunction
src/components/hooks/useLockScreenScrollY.ts:6:30
 
 export const EFFECT_CLASSES = ['h-100svh', 'overflow-y-hidden'];
 
-const useLockScreenScrollY = () =>
-  useLayoutEffect(() => {
-    getBodyContainer().classList.add(...EFFECT_CLASSES);
-
-    return () => getBodyContainer().classList.remove(...EFFECT_CLASSES);
-  }, []);
+const useLockScreenScrollY = () => undefined;
 
 export default useLockScreenScrollY;

[Killed] BlockStatement
src/components/hooks/useLockScreenScrollY.ts:7:25
 export const EFFECT_CLASSES = ['h-100svh', 'overflow-y-hidden'];
 
 const useLockScreenScrollY = () =>
-  useLayoutEffect(() => {
-    getBodyContainer().classList.add(...EFFECT_CLASSES);
-
-    return () => getBodyContainer().classList.remove(...EFFECT_CLASSES);
-  }, []);
+  useLayoutEffect(() => {}, []);
 
 export default useLockScreenScrollY;
killedBy: useLockScreenScrollY should add and remove classes on mount and unmount
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/components/hooks/useLockScreenScrollY.ts:10:12
   useLayoutEffect(() => {
     getBodyContainer().classList.add(...EFFECT_CLASSES);
 
-    return () => getBodyContainer().classList.remove(...EFFECT_CLASSES);
+    return () => undefined;
   }, []);
 
killedBy: useLockScreenScrollY should add and remove classes on mount and unmount
statusReason: expected true to be false // Object.is equality

[Survived] ArrayDeclaration
src/components/hooks/useLockScreenScrollY.ts:11:6
     getBodyContainer().classList.add(...EFFECT_CLASSES);
 
     return () => getBodyContainer().classList.remove(...EFFECT_CLASSES);
-  }, []);
+  }, ["Stryker was here"]);
 
 export default useLockScreenScrollY;
