[Killed] BlockStatement
src/components/hooks/usePagination.ts:10:19
 const usePagination = <T>(items: T[], itemsPerPage: Limit): Quantity => {
   const [pagesAmount, setPagesAmount] = useState<Quantity>(computePagesAmount(items.length, itemsPerPage));
 
-  useEffect(() => {
-    const freshPagesAmount = computePagesAmount(items.length, itemsPerPage);
-    setPagesAmount(freshPagesAmount);
-  }, [items, itemsPerPage]);
+  useEffect(() => {}, [items, itemsPerPage]);
 
   return pagesAmount;
killedBy: usePagination should recompute pages amount, given the items list's length changes
statusReason: expected 2 to be 3 // Object.is equality
