[Killed] BlockStatement
src/components/hooks/useResetScroll.ts:15:3
 function useResetScroll<T extends HTMLElement>(
   scrollableElementToResetRef?: RefObject<T>,
   { alsoResetWindowScroll, additionalDep }: ResetScrollOptions = {}
-) {
-  useLayoutEffect(
-    () => resetScroll(scrollableElementToResetRef, Boolean(alsoResetWindowScroll)),
-
-    [scrollableElementToResetRef, alsoResetWindowScroll, additionalDep]
-  );
-}
+) {}
 
 export default useResetScroll;
killedBy: useResetScroll should call resetScroll with disabled extra effects flags
statusReason: expected "resetScroll" to be called with arguments: [ undefined, false ]

Received: 



Number of calls: 0

[Killed] ArrowFunction
src/components/hooks/useResetScroll.ts:17:5
   { alsoResetWindowScroll, additionalDep }: ResetScrollOptions = {}
 ) {
   useLayoutEffect(
-    () => resetScroll(scrollableElementToResetRef, Boolean(alsoResetWindowScroll)),
+    () => undefined,
 
     [scrollableElementToResetRef, alsoResetWindowScroll, additionalDep]
killedBy: useResetScroll should call resetScroll with disabled extra effects flags
statusReason: expected "resetScroll" to be called with arguments: [ undefined, false ]

Received: 



Number of calls: 0

[Killed] ArrayDeclaration
src/components/hooks/useResetScroll.ts:19:5
   useLayoutEffect(
     () => resetScroll(scrollableElementToResetRef, Boolean(alsoResetWindowScroll)),
 
-    [scrollableElementToResetRef, alsoResetWindowScroll, additionalDep]
+    []
   );
 }
killedBy: useResetScroll should call resetScroll on initial render and additional dep state change
statusReason: expected "resetScroll" to be called with arguments: [ { current: <div></div> }, true ]

Received: 



Number of calls: 0
