[Survived] UnaryOperator
src/components/hooks/useScrollDirection.ts:17:30
   const [scrollDirection, setScrollDirection] = useState<ScrollDirection>('down');
 
   // eslint-disable-next-line no-magic-numbers
-  const prevScrollY = useRef(-1);
+  const prevScrollY = useRef(+1);
   const blocking = useRef(false);
 

[Killed] BooleanLiteral
src/components/hooks/useScrollDirection.ts:18:27
 
   // eslint-disable-next-line no-magic-numbers
   const prevScrollY = useRef(-1);
-  const blocking = useRef(false);
+  const blocking = useRef(true);
 
   useEffect(() => {
killedBy: useScrollDirection should update scroll direction when window scrolls
statusReason: expected 'down' to be 'up' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/components/hooks/useScrollDirection.ts:23:41
   useEffect(() => {
     prevScrollY.current = window.scrollY;
 
-    const updateScrollDirection = () => {
-      const { scrollY } = window;
-
-      if (Math.abs(scrollY - prevScrollY.current) >= THRESHOLD) {
-        const newScrollDirection = scrollY > prevScrollY.current ? 'down' : 'up';
-        setScrollDirection(newScrollDirection);
-        // eslint-disable-next-line no-magic-numbers
-        prevScrollY.current = Math.max(0, scrollY);
-      }
-      blocking.current = false;
-    };
+    const updateScrollDirection = () => {};
 
     const handleScroll = () => {
killedBy: useScrollDirection should update scroll direction when window scrolls
statusReason: expected 'down' to be 'up' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] EqualityOperator
src/components/hooks/useScrollDirection.ts:26:11
     const updateScrollDirection = () => {
       const { scrollY } = window;
 
-      if (Math.abs(scrollY - prevScrollY.current) >= THRESHOLD) {
+      if (Math.abs(scrollY - prevScrollY.current) < THRESHOLD) {
         const newScrollDirection = scrollY > prevScrollY.current ? 'down' : 'up';
         setScrollDirection(newScrollDirection);
killedBy: useScrollDirection should update scroll direction when window scrolls
statusReason: expected 'down' to be 'up' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/components/hooks/useScrollDirection.ts:26:11
     const updateScrollDirection = () => {
       const { scrollY } = window;
 
-      if (Math.abs(scrollY - prevScrollY.current) >= THRESHOLD) {
+      if (false) {
         const newScrollDirection = scrollY > prevScrollY.current ? 'down' : 'up';
         setScrollDirection(newScrollDirection);
killedBy: useScrollDirection should update scroll direction when window scrolls
statusReason: expected 'down' to be 'up' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] EqualityOperator
src/components/hooks/useScrollDirection.ts:27:36
       const { scrollY } = window;
 
       if (Math.abs(scrollY - prevScrollY.current) >= THRESHOLD) {
-        const newScrollDirection = scrollY > prevScrollY.current ? 'down' : 'up';
+        const newScrollDirection = scrollY <= prevScrollY.current ? 'down' : 'up';
         setScrollDirection(newScrollDirection);
         // eslint-disable-next-line no-magic-numbers
killedBy: useScrollDirection should update scroll direction when window scrolls
statusReason: expected 'down' to be 'up' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/components/hooks/useScrollDirection.ts:27:36
       const { scrollY } = window;
 
       if (Math.abs(scrollY - prevScrollY.current) >= THRESHOLD) {
-        const newScrollDirection = scrollY > prevScrollY.current ? 'down' : 'up';
+        const newScrollDirection = false ? 'down' : 'up';
         setScrollDirection(newScrollDirection);
         // eslint-disable-next-line no-magic-numbers
killedBy: useScrollDirection should update scroll direction when window scrolls
statusReason: expected 'up' to be 'down' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] MethodExpression
src/components/hooks/useScrollDirection.ts:30:31
         const newScrollDirection = scrollY > prevScrollY.current ? 'down' : 'up';
         setScrollDirection(newScrollDirection);
         // eslint-disable-next-line no-magic-numbers
-        prevScrollY.current = Math.max(0, scrollY);
+        prevScrollY.current = Math.min(0, scrollY);
       }
       blocking.current = false;

[Killed] BooleanLiteral
src/components/hooks/useScrollDirection.ts:32:26
         // eslint-disable-next-line no-magic-numbers
         prevScrollY.current = Math.max(0, scrollY);
       }
-      blocking.current = false;
+      blocking.current = true;
     };
 
killedBy: useScrollDirection should update scroll direction when window scrolls
statusReason: expected 'down' to be 'up' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/components/hooks/useScrollDirection.ts:35:32
       blocking.current = false;
     };
 
-    const handleScroll = () => {
-      if (blocking.current) return;
-      blocking.current = true;
-      window.requestAnimationFrame(updateScrollDirection);
-    };
+    const handleScroll = () => {};
 
     const throttledScrollHandler = throttle(handleScroll, MINIMAL_THROTTLE_TIMING_IN_MS);
killedBy: useScrollDirection should update scroll direction when window scrolls
statusReason: expected 'down' to be 'up' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/components/hooks/useScrollDirection.ts:36:11
     };
 
     const handleScroll = () => {
-      if (blocking.current) return;
+      if (true) return;
       blocking.current = true;
       window.requestAnimationFrame(updateScrollDirection);
killedBy: useScrollDirection should update scroll direction when window scrolls
statusReason: expected 'down' to be 'up' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Timeout] ConditionalExpression
src/components/hooks/useScrollDirection.ts:36:11
     };
 
     const handleScroll = () => {
-      if (blocking.current) return;
+      if (false) return;
       blocking.current = true;
       window.requestAnimationFrame(updateScrollDirection);

[Survived] BooleanLiteral
src/components/hooks/useScrollDirection.ts:37:26
 
     const handleScroll = () => {
       if (blocking.current) return;
-      blocking.current = true;
+      blocking.current = false;
       window.requestAnimationFrame(updateScrollDirection);
     };

[Survived] ArrowFunction
src/components/hooks/useScrollDirection.ts:44:12
     const throttledScrollHandler = throttle(handleScroll, MINIMAL_THROTTLE_TIMING_IN_MS);
 
     window.addEventListener('scroll', throttledScrollHandler);
-    return () => window.removeEventListener('scroll', throttledScrollHandler);
+    return () => undefined;
   }, []);
 
