[NoCoverage] ArithmeticOperator
components/layouts/dashboard/DashboardSidebar.tsx:42:24
 ): ReactElement[] {
   const keys = Object.keys(dashboardRoutesSidebarComponents);
   // eslint-disable-next-line no-magic-numbers
-  const lastKey = keys[keys.length - 1];
+  const lastKey = keys[keys.length + 1];
   const sidebarBtnsSeparator = <hr className="m-auto my-2 hidden w-5/6 lg:block" />;
 

[NoCoverage] LogicalOperator
components/layouts/dashboard/DashboardSidebar.tsx:67:10
           <span className="sr-only">{title}</span>
           {btnComponent}
         </Link>
-        {k !== lastKey && sidebarBtnsSeparator}
+        {k !== lastKey || sidebarBtnsSeparator}
       </li>
     );

[NoCoverage] ConditionalExpression
components/layouts/dashboard/DashboardSidebar.tsx:67:10
           <span className="sr-only">{title}</span>
           {btnComponent}
         </Link>
-        {k !== lastKey && sidebarBtnsSeparator}
+        {false}
       </li>
     );

[NoCoverage] BooleanLiteral
components/layouts/dashboard/DashboardSidebar.tsx:75:40
 
 // {ToDo} https://github.com/Tirraa/dashboard_rtm/issues/126
 const DashboardSidebar: FunctionComponent<DashboardSidebarProps> = ({ dashboardRoutesSidebarComponents, dashboardRoutesTitles, dashboardRoutes }) => {
-  const wasCollapsed = useRef<boolean>(false);
+  const wasCollapsed = useRef<boolean>(true);
   const [isCollapsed, setIsCollapsed] = useState<boolean>(wasCollapsed.current);
   const sidebarRef = useRef<HTMLDivElement>(null);

[NoCoverage] ConditionalExpression
components/layouts/dashboard/DashboardSidebar.tsx:84:9
 
   useEffect(() => {
     const sidebarInstance = getRefCurrentPtr(sidebarRef);
-    if (!sidebarInstance) return;
+    if (false) return;
 
     const EFFECT_CLASSES = ['transition-all', 'duration-300'];

[NoCoverage] ConditionalExpression
components/layouts/dashboard/DashboardSidebar.tsx:84:9
 
   useEffect(() => {
     const sidebarInstance = getRefCurrentPtr(sidebarRef);
-    if (!sidebarInstance) return;
+    if (true) return;
 
     const EFFECT_CLASSES = ['transition-all', 'duration-300'];

[NoCoverage] StringLiteral
components/layouts/dashboard/DashboardSidebar.tsx:86:47
     const sidebarInstance = getRefCurrentPtr(sidebarRef);
     if (!sidebarInstance) return;
 
-    const EFFECT_CLASSES = ['transition-all', 'duration-300'];
+    const EFFECT_CLASSES = ['transition-all', ""];
 
     function applyUncollapsedStyles() {

[NoCoverage] BlockStatement
components/layouts/dashboard/DashboardSidebar.tsx:88:39
 
     const EFFECT_CLASSES = ['transition-all', 'duration-300'];
 
-    function applyUncollapsedStyles() {
-      sidebarInstance.style.marginLeft = '0';
-      sidebarInstance.style.marginRight = '0';
-      sidebarInstance.style.marginTop = '0';
-      wasCollapsed.current = false;
-    }
+    function applyUncollapsedStyles() {}
 
     function applyCollapsedStyles() {

[NoCoverage] StringLiteral
components/layouts/dashboard/DashboardSidebar.tsx:91:41
     function applyUncollapsedStyles() {
       sidebarInstance.style.marginLeft = '0';
       sidebarInstance.style.marginRight = '0';
-      sidebarInstance.style.marginTop = '0';
+      sidebarInstance.style.marginTop = "";
       wasCollapsed.current = false;
     }

[NoCoverage] BooleanLiteral
components/layouts/dashboard/DashboardSidebar.tsx:92:30
       sidebarInstance.style.marginLeft = '0';
       sidebarInstance.style.marginRight = '0';
       sidebarInstance.style.marginTop = '0';
-      wasCollapsed.current = false;
+      wasCollapsed.current = true;
     }
 

[NoCoverage] BlockStatement
components/layouts/dashboard/DashboardSidebar.tsx:95:37
       wasCollapsed.current = false;
     }
 
-    function applyCollapsedStyles() {
-      const direction = getDirection();
-      if (isLargeScreen) {
-        sidebarInstance.style.marginTop = '0';
-        if (direction === 'rtl') {
-          sidebarInstance.style.marginRight = '-' + sidebarInstance.getBoundingClientRect().width + 'px';
-          sidebarInstance.style.marginLeft = '0';
-        } else {
-          sidebarInstance.style.marginLeft = '-' + sidebarInstance.getBoundingClientRect().width + 'px';
-          sidebarInstance.style.marginRight = '0';
-        }
-      } else {
-        sidebarInstance.style.marginLeft = '0';
-        sidebarInstance.style.marginTop = '-' + sidebarInstance.getBoundingClientRect().height + 'px';
-      }
-      wasCollapsed.current = true;
-    }
+    function applyCollapsedStyles() {}
 
     if (!isCollapsed) {

[NoCoverage] ConditionalExpression
components/layouts/dashboard/DashboardSidebar.tsx:97:11
 
     function applyCollapsedStyles() {
       const direction = getDirection();
-      if (isLargeScreen) {
+      if (true) {
         sidebarInstance.style.marginTop = '0';
         if (direction === 'rtl') {

[NoCoverage] ConditionalExpression
components/layouts/dashboard/DashboardSidebar.tsx:97:11
 
     function applyCollapsedStyles() {
       const direction = getDirection();
-      if (isLargeScreen) {
+      if (false) {
         sidebarInstance.style.marginTop = '0';
         if (direction === 'rtl') {

[NoCoverage] ConditionalExpression
components/layouts/dashboard/DashboardSidebar.tsx:99:13
       const direction = getDirection();
       if (isLargeScreen) {
         sidebarInstance.style.marginTop = '0';
-        if (direction === 'rtl') {
+        if (true) {
           sidebarInstance.style.marginRight = '-' + sidebarInstance.getBoundingClientRect().width + 'px';
           sidebarInstance.style.marginLeft = '0';

[NoCoverage] BlockStatement
components/layouts/dashboard/DashboardSidebar.tsx:99:34
       const direction = getDirection();
       if (isLargeScreen) {
         sidebarInstance.style.marginTop = '0';
-        if (direction === 'rtl') {
-          sidebarInstance.style.marginRight = '-' + sidebarInstance.getBoundingClientRect().width + 'px';
-          sidebarInstance.style.marginLeft = '0';
-        } else {
+        if (direction === 'rtl') {} else {
           sidebarInstance.style.marginLeft = '-' + sidebarInstance.getBoundingClientRect().width + 'px';
           sidebarInstance.style.marginRight = '0';

[NoCoverage] BlockStatement
components/layouts/dashboard/DashboardSidebar.tsx:102:16
         if (direction === 'rtl') {
           sidebarInstance.style.marginRight = '-' + sidebarInstance.getBoundingClientRect().width + 'px';
           sidebarInstance.style.marginLeft = '0';
-        } else {
-          sidebarInstance.style.marginLeft = '-' + sidebarInstance.getBoundingClientRect().width + 'px';
-          sidebarInstance.style.marginRight = '0';
-        }
+        } else {}
       } else {
         sidebarInstance.style.marginLeft = '0';

[NoCoverage] BlockStatement
components/layouts/dashboard/DashboardSidebar.tsx:106:14
           sidebarInstance.style.marginLeft = '-' + sidebarInstance.getBoundingClientRect().width + 'px';
           sidebarInstance.style.marginRight = '0';
         }
-      } else {
-        sidebarInstance.style.marginLeft = '0';
-        sidebarInstance.style.marginTop = '-' + sidebarInstance.getBoundingClientRect().height + 'px';
-      }
+      } else {}
       wasCollapsed.current = true;
     }

[NoCoverage] StringLiteral
components/layouts/dashboard/DashboardSidebar.tsx:108:43
         }
       } else {
         sidebarInstance.style.marginLeft = '0';
-        sidebarInstance.style.marginTop = '-' + sidebarInstance.getBoundingClientRect().height + 'px';
+        sidebarInstance.style.marginTop = "" + sidebarInstance.getBoundingClientRect().height + 'px';
       }
       wasCollapsed.current = true;

[NoCoverage] BooleanLiteral
components/layouts/dashboard/DashboardSidebar.tsx:110:30
         sidebarInstance.style.marginLeft = '0';
         sidebarInstance.style.marginTop = '-' + sidebarInstance.getBoundingClientRect().height + 'px';
       }
-      wasCollapsed.current = true;
+      wasCollapsed.current = false;
     }
 

[NoCoverage] ConditionalExpression
components/layouts/dashboard/DashboardSidebar.tsx:113:9
       wasCollapsed.current = true;
     }
 
-    if (!isCollapsed) {
+    if (false) {
       if (!wasCollapsed.current) sidebarInstance.classList.remove(...EFFECT_CLASSES);
       else sidebarInstance.classList.add(...EFFECT_CLASSES);

[NoCoverage] BooleanLiteral
components/layouts/dashboard/DashboardSidebar.tsx:113:9
       wasCollapsed.current = true;
     }
 
-    if (!isCollapsed) {
+    if (isCollapsed) {
       if (!wasCollapsed.current) sidebarInstance.classList.remove(...EFFECT_CLASSES);
       else sidebarInstance.classList.add(...EFFECT_CLASSES);

[NoCoverage] ConditionalExpression
components/layouts/dashboard/DashboardSidebar.tsx:114:11
     }
 
     if (!isCollapsed) {
-      if (!wasCollapsed.current) sidebarInstance.classList.remove(...EFFECT_CLASSES);
+      if (false) sidebarInstance.classList.remove(...EFFECT_CLASSES);
       else sidebarInstance.classList.add(...EFFECT_CLASSES);
 

[NoCoverage] BooleanLiteral
components/layouts/dashboard/DashboardSidebar.tsx:114:11
     }
 
     if (!isCollapsed) {
-      if (!wasCollapsed.current) sidebarInstance.classList.remove(...EFFECT_CLASSES);
+      if (wasCollapsed.current) sidebarInstance.classList.remove(...EFFECT_CLASSES);
       else sidebarInstance.classList.add(...EFFECT_CLASSES);
 

[NoCoverage] ConditionalExpression
components/layouts/dashboard/DashboardSidebar.tsx:121:9
       return;
     }
 
-    if (wasCollapsed.current) sidebarInstance.classList.remove(...EFFECT_CLASSES);
+    if (true) sidebarInstance.classList.remove(...EFFECT_CLASSES);
     else sidebarInstance.classList.add(...EFFECT_CLASSES);
     applyCollapsedStyles();

[NoCoverage] ConditionalExpression
components/layouts/dashboard/DashboardSidebar.tsx:121:9
       return;
     }
 
-    if (wasCollapsed.current) sidebarInstance.classList.remove(...EFFECT_CLASSES);
+    if (false) sidebarInstance.classList.remove(...EFFECT_CLASSES);
     else sidebarInstance.classList.add(...EFFECT_CLASSES);
     applyCollapsedStyles();

[NoCoverage] ArrayDeclaration
components/layouts/dashboard/DashboardSidebar.tsx:124:6
     if (wasCollapsed.current) sidebarInstance.classList.remove(...EFFECT_CLASSES);
     else sidebarInstance.classList.add(...EFFECT_CLASSES);
     applyCollapsedStyles();
-  }, [isCollapsed, sidebarRef, isLargeScreen, currentLocale]);
+  }, []);
 
   return (

[NoCoverage] StringLiteral
components/layouts/dashboard/DashboardSidebar.tsx:129:20
   return (
     <>
       <aside
-        className={'z-20 w-full justify-center border-t-[1px] border-muted-foreground bg-black dark:bg-card lg:w-fit lg:border-0'}
+        className={""}
         ref={sidebarRef}
       >
