[NoCoverage] BooleanLiteral
components/layouts/dashboard/DashboardSidebarCollapseButton.tsx:23:46
 
 const DashboardSidebarCollapseButton: FunctionComponent<DashboardSidebarCollapseButtonProps> = ({ setIsCollapsed, isCollapsed }) => {
   const sidebarCollapseBtnIconClassList = isCollapsed ? btnIconIsActiveClassList : btnIconIsNotActiveClassList;
-  const sidebarCollapseBtnWrapperClassList = !isCollapsed ? btnWrapperIsActiveClassList : btnWrapperIsNotActiveClassList;
+  const sidebarCollapseBtnWrapperClassList = isCollapsed ? btnWrapperIsActiveClassList : btnWrapperIsNotActiveClassList;
   const sidebarCollapseBtnClassList =

[NoCoverage] BooleanLiteral
components/layouts/dashboard/DashboardSidebarCollapseButton.tsx:33:87
   const type = 'button';
 
   return (
-    <div className={sidebarCollapseBtnWrapperClassList} onClick={() => setIsCollapsed(!isCollapsed)}>
+    <div className={sidebarCollapseBtnWrapperClassList} onClick={() => setIsCollapsed(isCollapsed)}>
       <button className={cn(sidebarCollapseBtnClassList, 'hidden lg:inline')} aria-expanded={ariaExpanded} aria-label={ariaLabel} type={type}>
         <ArrowRightIcon className={sidebarCollapseBtnIconClassList} />

[NoCoverage] ArrowFunction
components/layouts/dashboard/DashboardSidebarCollapseButton.tsx:33:66
   const type = 'button';
 
   return (
-    <div className={sidebarCollapseBtnWrapperClassList} onClick={() => setIsCollapsed(!isCollapsed)}>
+    <div className={sidebarCollapseBtnWrapperClassList} onClick={() => undefined}>
       <button className={cn(sidebarCollapseBtnClassList, 'hidden lg:inline')} aria-expanded={ariaExpanded} aria-label={ariaLabel} type={type}>
         <ArrowRightIcon className={sidebarCollapseBtnIconClassList} />

[NoCoverage] StringLiteral
components/layouts/dashboard/DashboardSidebarCollapseButton.tsx:34:58
 
   return (
     <div className={sidebarCollapseBtnWrapperClassList} onClick={() => setIsCollapsed(!isCollapsed)}>
-      <button className={cn(sidebarCollapseBtnClassList, 'hidden lg:inline')} aria-expanded={ariaExpanded} aria-label={ariaLabel} type={type}>
+      <button className={cn(sidebarCollapseBtnClassList, "")} aria-expanded={ariaExpanded} aria-label={ariaLabel} type={type}>
         <ArrowRightIcon className={sidebarCollapseBtnIconClassList} />
       </button>

[NoCoverage] StringLiteral
components/layouts/dashboard/DashboardSidebarCollapseButton.tsx:38:58
         <ArrowRightIcon className={sidebarCollapseBtnIconClassList} />
       </button>
 
-      <button className={cn(sidebarCollapseBtnClassList, 'lg:hidden')} aria-expanded={ariaExpanded} aria-label={ariaLabel} type={type}>
+      <button className={cn(sidebarCollapseBtnClassList, "")} aria-expanded={ariaExpanded} aria-label={ariaLabel} type={type}>
         <ArrowDownIcon className={sidebarCollapseBtnIconClassList} />
       </button>
