[NoCoverage] BlockStatement
components/layouts/navbar/NavbarButton.tsx:31:19
 const ButtonAsIs: FunctionComponent<Pick<NavbarButtonProps, 'i18nTitle' | 'onClick'> & OptionalIcon> = ({ onClick: onClickFun, i18nTitle, icon }) => {
   const globalT = getClientSideI18n();
 
-  if (onClickFun) {
-    return icon ? (
-      <Button className={cn(isNotActiveClassList, 'items-center gap-2 bg-transparent')} onClick={(event) => onClickFun(event)}>
-        {icon}
-        {globalT(i18nTitle)}
-      </Button>
-    ) : (
-      <Button className={cn(isNotActiveClassList, 'bg-transparent')} onClick={(event) => onClickFun(event)}>
-        {globalT(i18nTitle)}
-      </Button>
-    );
-  }
+  if (onClickFun) {}
 
   return icon ? (

[NoCoverage] ArrowFunction
components/layouts/navbar/NavbarButton.tsx:33:98
 
   if (onClickFun) {
     return icon ? (
-      <Button className={cn(isNotActiveClassList, 'items-center gap-2 bg-transparent')} onClick={(event) => onClickFun(event)}>
+      <Button className={cn(isNotActiveClassList, 'items-center gap-2 bg-transparent')} onClick={() => undefined}>
         {icon}
         {globalT(i18nTitle)}

[NoCoverage] ArrowFunction
components/layouts/navbar/NavbarButton.tsx:38:79
         {globalT(i18nTitle)}
       </Button>
     ) : (
-      <Button className={cn(isNotActiveClassList, 'bg-transparent')} onClick={(event) => onClickFun(event)}>
+      <Button className={cn(isNotActiveClassList, 'bg-transparent')} onClick={() => undefined}>
         {globalT(i18nTitle)}
       </Button>

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarButton.tsx:62:7
   const target = getLinkTarget(href);
   const exactMatch = hrefAndPathnameExactMatch(href, currentPathname);
 
-  if (icon) {
+  if (true) {
     return (
       <Link className={cn(className, 'flex items-center')} aria-current={exactMatch ? 'page' : undefined} target={target} href={href}>

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarButton.tsx:62:7
   const target = getLinkTarget(href);
   const exactMatch = hrefAndPathnameExactMatch(href, currentPathname);
 
-  if (icon) {
+  if (false) {
     return (
       <Link className={cn(className, 'flex items-center')} aria-current={exactMatch ? 'page' : undefined} target={target} href={href}>

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarButton.tsx:80:9
 
 const NavbarButton: FunctionComponent<NavbarButtonProps> = ({ i18nTitle, onClick, path, icon }) => {
   const generateNavbarButtonWithoutIcon: () => ReactNode = () => {
-    if (onClick) return <ButtonAsIs i18nTitle={i18nTitle} onClick={onClick} />;
+    if (false) return <ButtonAsIs i18nTitle={i18nTitle} onClick={onClick} />;
     else if (path) return <ButtonAsLink i18nTitle={i18nTitle} path={path} />;
     return null;

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarButton.tsx:86:9
   };
 
   const generateNavbarButtonWithIcon: () => ReactNode = () => {
-    if (onClick) return <ButtonAsIs i18nTitle={i18nTitle} onClick={onClick} icon={icon} />;
+    if (false) return <ButtonAsIs i18nTitle={i18nTitle} onClick={onClick} icon={icon} />;
     else if (path) return <ButtonAsLink i18nTitle={i18nTitle} icon={icon} path={path} />;
     return null;
