[NoCoverage] ObjectLiteral
components/layouts/navbar/NavbarDropdown.tsx:43:111
 
     return (
       <DropdownMenuItem
-        className={cn('p-0 dark:bg-opacity-20 dark:text-muted-foreground dark:hover:text-primary-foreground', {
-          'bg-primary focus:bg-primary focus:text-white': isActive
-        })}
+        className={cn('p-0 dark:bg-opacity-20 dark:text-muted-foreground dark:hover:text-primary-foreground', {})}
         key={`${href}-${title}-navbar-menu-item`}
         style={{ minWidth }}

[NoCoverage] BooleanLiteral
components/layouts/navbar/NavbarDropdown.tsx:76:53
 
   const title = globalT(i18nTitle);
 
-  const [isOpened, setIsOpened] = useState<boolean>(false);
+  const [isOpened, setIsOpened] = useState<boolean>(true);
   useEffect(() => {
     if (!isLargeScreen) setIsOpened(false);

[NoCoverage] BlockStatement
components/layouts/navbar/NavbarDropdown.tsx:77:19
   const title = globalT(i18nTitle);
 
   const [isOpened, setIsOpened] = useState<boolean>(false);
-  useEffect(() => {
-    if (!isLargeScreen) setIsOpened(false);
-  }, [isLargeScreen]);
+  useEffect(() => {}, [isLargeScreen]);
 
   const navbarDropdownClassName =

[NoCoverage] BooleanLiteral
components/layouts/navbar/NavbarDropdown.tsx:78:37
 
   const [isOpened, setIsOpened] = useState<boolean>(false);
   useEffect(() => {
-    if (!isLargeScreen) setIsOpened(false);
+    if (!isLargeScreen) setIsOpened(true);
   }, [isLargeScreen]);
 

[NoCoverage] BooleanLiteral
components/layouts/navbar/NavbarDropdown.tsx:78:9
 
   const [isOpened, setIsOpened] = useState<boolean>(false);
   useEffect(() => {
-    if (!isLargeScreen) setIsOpened(false);
+    if (isLargeScreen) setIsOpened(false);
   }, [isLargeScreen]);
 

[NoCoverage] LogicalOperator
components/layouts/navbar/NavbarDropdown.tsx:82:5
   }, [isLargeScreen]);
 
   const navbarDropdownClassName =
-    hrefMatchesPathname(href, currentPathname) || isOpened ? navbarDropdownIsActiveClassList : navbarDropdownIsNotActiveClassList;
+    hrefMatchesPathname(href, currentPathname) && isOpened ? navbarDropdownIsActiveClassList : navbarDropdownIsNotActiveClassList;
   const navbarDropdownBtnClassName = isOpened ? navbarDropdownBtnIconIsActiveClassList : navbarDropdownBtnIconIsNotActiveClassList;
 

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarDropdown.tsx:82:5
   }, [isLargeScreen]);
 
   const navbarDropdownClassName =
-    hrefMatchesPathname(href, currentPathname) || isOpened ? navbarDropdownIsActiveClassList : navbarDropdownIsNotActiveClassList;
+    true ? navbarDropdownIsActiveClassList : navbarDropdownIsNotActiveClassList;
   const navbarDropdownBtnClassName = isOpened ? navbarDropdownBtnIconIsActiveClassList : navbarDropdownBtnIconIsNotActiveClassList;
 

[NoCoverage] ArrowFunction
components/layouts/navbar/NavbarDropdown.tsx:85:24
     hrefMatchesPathname(href, currentPathname) || isOpened ? navbarDropdownIsActiveClassList : navbarDropdownIsNotActiveClassList;
   const navbarDropdownBtnClassName = isOpened ? navbarDropdownBtnIconIsActiveClassList : navbarDropdownBtnIconIsNotActiveClassList;
 
-  const onOpenChange = (opened: boolean) => setIsOpened(opened);
+  const onOpenChange = () => undefined;
 
   return (
