[NoCoverage] ArrowFunction
components/layouts/navbar/NavbarLanguageMenu.tsx:18:17
 interface NavbarLanguageMenuProps extends WithIsMobile {}
 
 const dropdownItemsGenerator = (changeLocale: ChangeLocaleFun, currentLocale: LanguageFlag) =>
-  LANGUAGES.map((language) => (
-    <DropdownMenuItem className="relative my-1 px-3 py-2" textValue={localesLabels[language]} key={language} asChild>
-      <button
-        className={cn(
-          BUTTON_CONFIG.CLASSNAME,
-          'w-full',
-          currentLocale === language
-            ? cn(BUTTON_CONFIG.ACTIVE_CLASSNAME, 'hover:bg-primary hover:text-white focus:bg-primary focus:text-white')
-            : cn(BUTTON_CONFIG.NOT_ACTIVE_CLASSNAME, 'text-black')
-        )}
-        onClick={language !== currentLocale ? () => changeLocale(language) : undefined}
-      >
-        <span className="absolute ltr:right-2 rtl:left-2">{localesEmojis[language]}</span>
-        <span>{localesLabels[language]}</span>
-      </button>
-    </DropdownMenuItem>
-  ));
+  LANGUAGES.map(() => undefined);
 
 const NavbarLanguageMenu: FunctionComponent<NavbarLanguageMenuProps> = ({ isMobile }) => {

[NoCoverage] EqualityOperator
components/layouts/navbar/NavbarLanguageMenu.tsx:24:11
         className={cn(
           BUTTON_CONFIG.CLASSNAME,
           'w-full',
-          currentLocale === language
+          currentLocale !== language
             ? cn(BUTTON_CONFIG.ACTIVE_CLASSNAME, 'hover:bg-primary hover:text-white focus:bg-primary focus:text-white')
             : cn(BUTTON_CONFIG.NOT_ACTIVE_CLASSNAME, 'text-black')

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarLanguageMenu.tsx:24:11
         className={cn(
           BUTTON_CONFIG.CLASSNAME,
           'w-full',
-          currentLocale === language
+          true
             ? cn(BUTTON_CONFIG.ACTIVE_CLASSNAME, 'hover:bg-primary hover:text-white focus:bg-primary focus:text-white')
             : cn(BUTTON_CONFIG.NOT_ACTIVE_CLASSNAME, 'text-black')

[NoCoverage] StringLiteral
components/layouts/navbar/NavbarLanguageMenu.tsx:25:50
           BUTTON_CONFIG.CLASSNAME,
           'w-full',
           currentLocale === language
-            ? cn(BUTTON_CONFIG.ACTIVE_CLASSNAME, 'hover:bg-primary hover:text-white focus:bg-primary focus:text-white')
+            ? cn(BUTTON_CONFIG.ACTIVE_CLASSNAME, "")
             : cn(BUTTON_CONFIG.NOT_ACTIVE_CLASSNAME, 'text-black')
         )}

[NoCoverage] ArrowFunction
components/layouts/navbar/NavbarLanguageMenu.tsx:28:47
             ? cn(BUTTON_CONFIG.ACTIVE_CLASSNAME, 'hover:bg-primary hover:text-white focus:bg-primary focus:text-white')
             : cn(BUTTON_CONFIG.NOT_ACTIVE_CLASSNAME, 'text-black')
         )}
-        onClick={language !== currentLocale ? () => changeLocale(language) : undefined}
+        onClick={language !== currentLocale ? () => undefined : undefined}
       >
         <span className="absolute ltr:right-2 rtl:left-2">{localesEmojis[language]}</span>

[NoCoverage] EqualityOperator
components/layouts/navbar/NavbarLanguageMenu.tsx:28:18
             ? cn(BUTTON_CONFIG.ACTIVE_CLASSNAME, 'hover:bg-primary hover:text-white focus:bg-primary focus:text-white')
             : cn(BUTTON_CONFIG.NOT_ACTIVE_CLASSNAME, 'text-black')
         )}
-        onClick={language !== currentLocale ? () => changeLocale(language) : undefined}
+        onClick={language === currentLocale ? () => changeLocale(language) : undefined}
       >
         <span className="absolute ltr:right-2 rtl:left-2">{localesEmojis[language]}</span>

[NoCoverage] BooleanLiteral
components/layouts/navbar/NavbarLanguageMenu.tsx:40:45
   const changeLocale = useChangeLocale();
   const currentLocale = useCurrentLocale();
   const scopedT = useScopedI18n(`${i18ns.navbar}.sr-only`);
-  const [open, setOpen] = useState<boolean>(false);
+  const [open, setOpen] = useState<boolean>(true);
   const onOpenChange = (opened: boolean) => setOpen(opened);
 

[NoCoverage] ArrowFunction
components/layouts/navbar/NavbarLanguageMenu.tsx:41:24
   const currentLocale = useCurrentLocale();
   const scopedT = useScopedI18n(`${i18ns.navbar}.sr-only`);
   const [open, setOpen] = useState<boolean>(false);
-  const onOpenChange = (opened: boolean) => setOpen(opened);
+  const onOpenChange = () => undefined;
 
   return (

[NoCoverage] BooleanLiteral
components/layouts/navbar/NavbarLanguageMenu.tsx:45:40
 
   return (
     <DropdownMenu withDeepResetOnLgBreakpointEvents onOpenChange={onOpenChange} open={open}>
-      <DropdownMenuTrigger aria-label={!open ? scopedT('open-language-switcher-menu') : scopedT('close-language-switcher-menu')} asChild>
+      <DropdownMenuTrigger aria-label={open ? scopedT('open-language-switcher-menu') : scopedT('close-language-switcher-menu')} asChild>
         <button className="h-full bg-transparent text-primary-foreground">{localesEmojis[currentLocale]}</button>
       </DropdownMenuTrigger>

[NoCoverage] StringLiteral
components/layouts/navbar/NavbarLanguageMenu.tsx:49:23
         <button className="h-full bg-transparent text-primary-foreground">{localesEmojis[currentLocale]}</button>
       </DropdownMenuTrigger>
       <DropdownMenuContent
-        className={cn('min-w-[125px] dark:border-card lg:relative lg:dark:border-inherit ltr:lg:right-10 rtl:lg:left-10', {
+        className={cn("", {
           'dark:bg-card [&>button]:h-12': isMobile,
           'relative top-1': !isMobile

[NoCoverage] BooleanLiteral
components/layouts/navbar/NavbarLanguageMenu.tsx:51:29
       <DropdownMenuContent
         className={cn('min-w-[125px] dark:border-card lg:relative lg:dark:border-inherit ltr:lg:right-10 rtl:lg:left-10', {
           'dark:bg-card [&>button]:h-12': isMobile,
-          'relative top-1': !isMobile
+          'relative top-1': isMobile
         })}
         aria-label={scopedT('language-switcher-menu')}
