[NoCoverage] BooleanLiteral
components/layouts/navbar/NavbarThemeButton.tsx:22:55
 
 const NavbarThemeButton: FunctionComponent<NavbarLoginButtonProps> = () => {
   const { setTheme, theme } = useTheme();
-  const [isMounted, setIsMounted] = useState<boolean>(false);
+  const [isMounted, setIsMounted] = useState<boolean>(true);
   const [changeThemeValue, setChangeThemeValue] = useState<string>('');
 

[NoCoverage] BooleanLiteral
components/layouts/navbar/NavbarThemeButton.tsx:27:32
 
   const scopedT = useScopedI18n(`${i18ns.navbar}.sr-only`);
 
-  useEffect(() => setIsMounted(true), []);
+  useEffect(() => setIsMounted(false), []);
 
   useEffect(() => {

[NoCoverage] ArrowFunction
components/layouts/navbar/NavbarThemeButton.tsx:27:13
 
   const scopedT = useScopedI18n(`${i18ns.navbar}.sr-only`);
 
-  useEffect(() => setIsMounted(true), []);
+  useEffect(() => undefined, []);
 
   useEffect(() => {

[NoCoverage] BlockStatement
components/layouts/navbar/NavbarThemeButton.tsx:29:19
 
   useEffect(() => setIsMounted(true), []);
 
-  useEffect(() => {
-    setChangeThemeValue(theme !== DEFAULT_VARIANT ? DEFAULT_VARIANT : DEFAULT_DARK_VARIANT);
-  }, [theme]);
+  useEffect(() => {}, [theme]);
 
   useEffect(

[NoCoverage] EqualityOperator
components/layouts/navbar/NavbarThemeButton.tsx:30:25
   useEffect(() => setIsMounted(true), []);
 
   useEffect(() => {
-    setChangeThemeValue(theme !== DEFAULT_VARIANT ? DEFAULT_VARIANT : DEFAULT_DARK_VARIANT);
+    setChangeThemeValue(theme === DEFAULT_VARIANT ? DEFAULT_VARIANT : DEFAULT_DARK_VARIANT);
   }, [theme]);
 

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarThemeButton.tsx:30:25
   useEffect(() => setIsMounted(true), []);
 
   useEffect(() => {
-    setChangeThemeValue(theme !== DEFAULT_VARIANT ? DEFAULT_VARIANT : DEFAULT_DARK_VARIANT);
+    setChangeThemeValue(false ? DEFAULT_VARIANT : DEFAULT_DARK_VARIANT);
   }, [theme]);
 

[NoCoverage] BlockStatement
components/layouts/navbar/NavbarThemeButton.tsx:34:11
   }, [theme]);
 
   useEffect(
-    () => {
-      const checkDarkTheme = window.matchMedia('(prefers-color-scheme: dark)').matches;
-      const newValue =
-        theme === DEFAULT_DARK_VARIANT
-          ? DEFAULT_VARIANT
-          : theme === DEFAULT_VARIANT
-            ? DEFAULT_DARK_VARIANT
-            : checkDarkTheme
-              ? DEFAULT_VARIANT
-              : DEFAULT_DARK_VARIANT;
-      setChangeThemeValue(newValue);
-    },
+    () => {},
     // eslint-disable-next-line react-hooks/exhaustive-deps
     []

[NoCoverage] EqualityOperator
components/layouts/navbar/NavbarThemeButton.tsx:37:9
     () => {
       const checkDarkTheme = window.matchMedia('(prefers-color-scheme: dark)').matches;
       const newValue =
-        theme === DEFAULT_DARK_VARIANT
+        theme !== DEFAULT_DARK_VARIANT
           ? DEFAULT_VARIANT
           : theme === DEFAULT_VARIANT

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarThemeButton.tsx:37:9
     () => {
       const checkDarkTheme = window.matchMedia('(prefers-color-scheme: dark)').matches;
       const newValue =
-        theme === DEFAULT_DARK_VARIANT
+        true
           ? DEFAULT_VARIANT
           : theme === DEFAULT_VARIANT

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarThemeButton.tsx:39:13
       const newValue =
         theme === DEFAULT_DARK_VARIANT
           ? DEFAULT_VARIANT
-          : theme === DEFAULT_VARIANT
+          : false
             ? DEFAULT_DARK_VARIANT
             : checkDarkTheme

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarThemeButton.tsx:39:13
       const newValue =
         theme === DEFAULT_DARK_VARIANT
           ? DEFAULT_VARIANT
-          : theme === DEFAULT_VARIANT
+          : true
             ? DEFAULT_DARK_VARIANT
             : checkDarkTheme

[NoCoverage] StringLiteral
components/layouts/navbar/NavbarThemeButton.tsx:50:21
     []
   );
 
-  const className = 'h-full w-fit text-primary-foreground';
+  const className = "";
 
   const placeholder = (

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarThemeButton.tsx:57:7
       <svg height={SIZE} width={SIZE} />
     </Button>
   );
-  if (!isMounted) return placeholder;
+  if (true) return placeholder;
 
   if (changeThemeValue === DEFAULT_VARIANT || theme === DEFAULT_DARK_VARIANT) {

[NoCoverage] BooleanLiteral
components/layouts/navbar/NavbarThemeButton.tsx:57:7
       <svg height={SIZE} width={SIZE} />
     </Button>
   );
-  if (!isMounted) return placeholder;
+  if (isMounted) return placeholder;
 
   if (changeThemeValue === DEFAULT_VARIANT || theme === DEFAULT_DARK_VARIANT) {

[NoCoverage] LogicalOperator
components/layouts/navbar/NavbarThemeButton.tsx:59:7
   );
   if (!isMounted) return placeholder;
 
-  if (changeThemeValue === DEFAULT_VARIANT || theme === DEFAULT_DARK_VARIANT) {
+  if (changeThemeValue === DEFAULT_VARIANT && theme === DEFAULT_DARK_VARIANT) {
     return (
       <Button onClick={() => setTheme(DEFAULT_VARIANT)} withTransparentBackground className={className} size="icon">

[NoCoverage] EqualityOperator
components/layouts/navbar/NavbarThemeButton.tsx:59:7
   );
   if (!isMounted) return placeholder;
 
-  if (changeThemeValue === DEFAULT_VARIANT || theme === DEFAULT_DARK_VARIANT) {
+  if (changeThemeValue !== DEFAULT_VARIANT || theme === DEFAULT_DARK_VARIANT) {
     return (
       <Button onClick={() => setTheme(DEFAULT_VARIANT)} withTransparentBackground className={className} size="icon">

[NoCoverage] ArrowFunction
components/layouts/navbar/NavbarThemeButton.tsx:61:24
 
   if (changeThemeValue === DEFAULT_VARIANT || theme === DEFAULT_DARK_VARIANT) {
     return (
-      <Button onClick={() => setTheme(DEFAULT_VARIANT)} withTransparentBackground className={className} size="icon">
+      <Button onClick={() => undefined} withTransparentBackground className={className} size="icon">
         <SunIcon height={SIZE} width={SIZE} />
         <span className="sr-only">{scopedT('switch-to-light-mode')}</span>

[NoCoverage] ArrowFunction
components/layouts/navbar/NavbarThemeButton.tsx:69:22
   }
 
   return (
-    <Button onClick={() => setTheme(DEFAULT_DARK_VARIANT)} withTransparentBackground className={className} size="icon">
+    <Button onClick={() => undefined} withTransparentBackground className={className} size="icon">
       <MoonIcon height={SIZE} width={SIZE} />
       <span className="sr-only">{scopedT('switch-to-dark-mode')}</span>
