[NoCoverage] ArrowFunction
components/layouts/navbar/NavbarToggle.tsx:24:18
   return items.map((item, index) => {
     return (
       <DropdownMenuItem
-        onClick={(event) => dispatchClickOnLinkOrButtonFirstChild(event.target)}
+        onClick={() => undefined}
         key={`navbar-hamburger-menu-item-${index}`}
         textValue={globalT(item.i18nTitle)}

[NoCoverage] BooleanLiteral
components/layouts/navbar/NavbarToggle.tsx:36:53
 };
 
 const NavbarToggle: FunctionComponent<NavbarToggleProps> = ({ items }) => {
-  const [isOpened, setIsOpened] = useState<boolean>(false);
+  const [isOpened, setIsOpened] = useState<boolean>(true);
   const onOpenChange = (opened: boolean) => setIsOpened(opened);
 

[NoCoverage] ArrowFunction
components/layouts/navbar/NavbarToggle.tsx:37:24
 
 const NavbarToggle: FunctionComponent<NavbarToggleProps> = ({ items }) => {
   const [isOpened, setIsOpened] = useState<boolean>(false);
-  const onOpenChange = (opened: boolean) => setIsOpened(opened);
+  const onOpenChange = () => undefined;
 
   const isLargeScreen = useIsLargeScreen();

[NoCoverage] BlockStatement
components/layouts/navbar/NavbarToggle.tsx:44:19
 
   const togglerRef = useRef<HTMLButtonElement>(null);
 
-  useEffect(() => {
-    const togglerInstance = getRefCurrentPtr(togglerRef);
-    if (!togglerInstance) return;
-    togglerInstance.dataset.open = isOpened ? 'true' : 'false';
-  }, [togglerRef, isOpened]);
+  useEffect(() => {}, [togglerRef, isOpened]);
 
   useEffect(() => {

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarToggle.tsx:46:9
 
   useEffect(() => {
     const togglerInstance = getRefCurrentPtr(togglerRef);
-    if (!togglerInstance) return;
+    if (false) return;
     togglerInstance.dataset.open = isOpened ? 'true' : 'false';
   }, [togglerRef, isOpened]);

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarToggle.tsx:46:9
 
   useEffect(() => {
     const togglerInstance = getRefCurrentPtr(togglerRef);
-    if (!togglerInstance) return;
+    if (true) return;
     togglerInstance.dataset.open = isOpened ? 'true' : 'false';
   }, [togglerRef, isOpened]);

[NoCoverage] StringLiteral
components/layouts/navbar/NavbarToggle.tsx:47:47
   useEffect(() => {
     const togglerInstance = getRefCurrentPtr(togglerRef);
     if (!togglerInstance) return;
-    togglerInstance.dataset.open = isOpened ? 'true' : 'false';
+    togglerInstance.dataset.open = isOpened ? "" : 'false';
   }, [togglerRef, isOpened]);
 

[NoCoverage] BlockStatement
components/layouts/navbar/NavbarToggle.tsx:50:19
     togglerInstance.dataset.open = isOpened ? 'true' : 'false';
   }, [togglerRef, isOpened]);
 
-  useEffect(() => {
-    if (isLargeScreen) setIsOpened(false);
-  }, [isLargeScreen]);
+  useEffect(() => {}, [isLargeScreen]);
 
   const className =

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarToggle.tsx:51:9
   }, [togglerRef, isOpened]);
 
   useEffect(() => {
-    if (isLargeScreen) setIsOpened(false);
+    if (true) setIsOpened(false);
   }, [isLargeScreen]);
 

[NoCoverage] ConditionalExpression
components/layouts/navbar/NavbarToggle.tsx:51:9
   }, [togglerRef, isOpened]);
 
   useEffect(() => {
-    if (isLargeScreen) setIsOpened(false);
+    if (false) setIsOpened(false);
   }, [isLargeScreen]);
 

[NoCoverage] ArrayDeclaration
components/layouts/navbar/NavbarToggle.tsx:52:6
 
   useEffect(() => {
     if (isLargeScreen) setIsOpened(false);
-  }, [isLargeScreen]);
+  }, []);
 
   const className =

[NoCoverage] BooleanLiteral
components/layouts/navbar/NavbarToggle.tsx:59:40
 
   return (
     <DropdownMenu withDeepResetOnLgBreakpointEvents onOpenChange={onOpenChange} open={isOpened}>
-      <DropdownMenuTrigger aria-label={!isOpened ? scopedT('open-hamburger-menu') : scopedT('close-hamburger-menu')} asChild>
+      <DropdownMenuTrigger aria-label={isOpened ? scopedT('open-hamburger-menu') : scopedT('close-hamburger-menu')} asChild>
         <button className={className} ref={togglerRef} />
       </DropdownMenuTrigger>
