[NoCoverage] ArrowFunction
layouts/navbar/search/NavbarSearchButton.tsx:9:51
 
 import NavbarSearchButtonInner from './NavbarSearchButtonInner';
 
-const NavbarSearchButton: FunctionComponent<{}> = () => (
-  <NavbarSearchButtonInner
-    tabValueInitialState={navbarSearchBtnProps.tabValueInitialState}
-    quickAccessBtns={navbarSearchBtnProps.quickAccessBtns}
-    tabInputLabels={navbarSearchBtnProps.tabInputLabels}
-    allTabValues={navbarSearchBtnProps.allTabValues}
-    tabTriggers={navbarSearchBtnProps.tabTriggers}
-    banners={navbarSearchBtnProps.banners}
-  />
-);
+const NavbarSearchButton: FunctionComponent<{}> = () => undefined;
 
 export default NavbarSearchButton;
