[NoCoverage] ArithmeticOperator
layouts/navbar/search/NavbarSearchButtonDialogSearchBoxDefaultView.tsx:42:28
         {banners.map(([category, { icon: __Icon, i18nTitle }], index) => {
           const title = globalT(i18nTitle);
           // eslint-disable-next-line no-magic-numbers
-          const maxIndex = banners.length - 1;
+          const maxIndex = banners.length + 1;
 
           // eslint-disable-next-line no-magic-numbers

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonDialogSearchBoxDefaultView.tsx:45:61
           const maxIndex = banners.length - 1;
 
           // eslint-disable-next-line no-magic-numbers
-          const pos = index === 0 ? EBannerPosition.FIRST : index === maxIndex ? EBannerPosition.LAST : EBannerPosition.MIDDLE;
+          const pos = index === 0 ? EBannerPosition.FIRST : false ? EBannerPosition.LAST : EBannerPosition.MIDDLE;
 
           return (

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonDialogSearchBoxDefaultView.tsx:45:23
           const maxIndex = banners.length - 1;
 
           // eslint-disable-next-line no-magic-numbers
-          const pos = index === 0 ? EBannerPosition.FIRST : index === maxIndex ? EBannerPosition.LAST : EBannerPosition.MIDDLE;
+          const pos = false ? EBannerPosition.FIRST : index === maxIndex ? EBannerPosition.LAST : EBannerPosition.MIDDLE;
 
           return (

[NoCoverage] ArrowFunction
layouts/navbar/search/NavbarSearchButtonDialogSearchBoxDefaultView.tsx:49:47
 
           return (
             <NavigationMenu.Item className="contents" key={category}>
-              <NavigationMenu.Link onKeyDown={(e) => quickMenuLeftRightCustomHandler(e)} asChild>
+              <NavigationMenu.Link onKeyDown={() => undefined} asChild>
                 <button
                   className={cn(

[NoCoverage] EqualityOperator
layouts/navbar/search/NavbarSearchButtonDialogSearchBoxDefaultView.tsx:53:39
                 <button
                   className={cn(
-                    { 'rounded-t-md': pos === EBannerPosition.FIRST },
+                    { 'rounded-t-md': pos !== EBannerPosition.FIRST },
                     { 'rounded-b-md': pos === EBannerPosition.LAST },
                     {

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonDialogSearchBoxDefaultView.tsx:53:39
                 <button
                   className={cn(
-                    { 'rounded-t-md': pos === EBannerPosition.FIRST },
+                    { 'rounded-t-md': true },
                     { 'rounded-b-md': pos === EBannerPosition.LAST },
                     {

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonDialogSearchBoxDefaultView.tsx:54:39
                   className={cn(
                     { 'rounded-t-md': pos === EBannerPosition.FIRST },
-                    { 'rounded-b-md': pos === EBannerPosition.LAST },
+                    { 'rounded-b-md': true },
                     {
                       'pointer-events-none opacity-50 hover:cursor-default dark:opacity-75 [&>svg]:border-transparent [&>svg]:dark:border-transparent':

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonDialogSearchBoxDefaultView.tsx:54:39
                   className={cn(
                     { 'rounded-t-md': pos === EBannerPosition.FIRST },
-                    { 'rounded-b-md': pos === EBannerPosition.LAST },
+                    { 'rounded-b-md': false },
                     {
                       'pointer-events-none opacity-50 hover:cursor-default dark:opacity-75 [&>svg]:border-transparent [&>svg]:dark:border-transparent':

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonDialogSearchBoxDefaultView.tsx:57:25
                     { 'rounded-b-md': pos === EBannerPosition.LAST },
                     {
                       'pointer-events-none opacity-50 hover:cursor-default dark:opacity-75 [&>svg]:border-transparent [&>svg]:dark:border-transparent':
-                        tabValue === category
+                        true
                     }
                   )}

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonDialogSearchBoxDefaultView.tsx:57:25
                     { 'rounded-b-md': pos === EBannerPosition.LAST },
                     {
                       'pointer-events-none opacity-50 hover:cursor-default dark:opacity-75 [&>svg]:border-transparent [&>svg]:dark:border-transparent':
-                        tabValue === category
+                        false
                     }
                   )}

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonDialogSearchBoxDefaultView.tsx:60:34
                         tabValue === category
                     }
                   )}
-                  onClick={() => {
-                    updateMemorizedTabValueAndSetTabValue(category as WeakTabValue);
-                    focusInputField();
-                  }}
+                  onClick={() => {}}
                   aria-label={title}
                 >
