[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:56:96
   const prevScreenBtnRef = useRef<HTMLButtonElement>(null);
   const nextScreenBtnRef = useRef<HTMLButtonElement>(null);
 
-  const quickMenuLeftCustomHandler = useCallback((e: ReactKeyboardEvent<HTMLAnchorElement>) => {
-    if (e.key !== 'ArrowLeft') return;
-
-    const prevScreenBtnInstance = getRefCurrentPtr(prevScreenBtnRef);
-    if (!prevScreenBtnInstance) return;
-    e.preventDefault();
-    prevScreenBtnInstance.focus();
-  }, []);
+  const quickMenuLeftCustomHandler = useCallback((e: ReactKeyboardEvent<HTMLAnchorElement>) => {}, []);
 
   const quickMenuRightCustomHandler = useCallback((e: ReactKeyboardEvent<HTMLAnchorElement>) => {

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:57:9
   const nextScreenBtnRef = useRef<HTMLButtonElement>(null);
 
   const quickMenuLeftCustomHandler = useCallback((e: ReactKeyboardEvent<HTMLAnchorElement>) => {
-    if (e.key !== 'ArrowLeft') return;
+    if (false) return;
 
     const prevScreenBtnInstance = getRefCurrentPtr(prevScreenBtnRef);

[NoCoverage] EqualityOperator
layouts/navbar/search/NavbarSearchButtonInner.tsx:57:9
   const nextScreenBtnRef = useRef<HTMLButtonElement>(null);
 
   const quickMenuLeftCustomHandler = useCallback((e: ReactKeyboardEvent<HTMLAnchorElement>) => {
-    if (e.key !== 'ArrowLeft') return;
+    if (e.key === 'ArrowLeft') return;
 
     const prevScreenBtnInstance = getRefCurrentPtr(prevScreenBtnRef);

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:60:9
     if (e.key !== 'ArrowLeft') return;
 
     const prevScreenBtnInstance = getRefCurrentPtr(prevScreenBtnRef);
-    if (!prevScreenBtnInstance) return;
+    if (true) return;
     e.preventDefault();
     prevScreenBtnInstance.focus();

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:60:9
     if (e.key !== 'ArrowLeft') return;
 
     const prevScreenBtnInstance = getRefCurrentPtr(prevScreenBtnRef);
-    if (!prevScreenBtnInstance) return;
+    if (false) return;
     e.preventDefault();
     prevScreenBtnInstance.focus();

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:65:97
     prevScreenBtnInstance.focus();
   }, []);
 
-  const quickMenuRightCustomHandler = useCallback((e: ReactKeyboardEvent<HTMLAnchorElement>) => {
-    if (e.key !== 'ArrowRight') return;
-
-    const nextScreenBtnInstance = getRefCurrentPtr(nextScreenBtnRef);
-    if (!nextScreenBtnInstance) return;
-    e.preventDefault();
-    nextScreenBtnInstance.focus();
-  }, []);
+  const quickMenuRightCustomHandler = useCallback((e: ReactKeyboardEvent<HTMLAnchorElement>) => {}, []);
 
   const quickMenuLeftRightCustomHandler = useCallback(

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:66:9
   }, []);
 
   const quickMenuRightCustomHandler = useCallback((e: ReactKeyboardEvent<HTMLAnchorElement>) => {
-    if (e.key !== 'ArrowRight') return;
+    if (false) return;
 
     const nextScreenBtnInstance = getRefCurrentPtr(nextScreenBtnRef);

[NoCoverage] EqualityOperator
layouts/navbar/search/NavbarSearchButtonInner.tsx:66:9
   }, []);
 
   const quickMenuRightCustomHandler = useCallback((e: ReactKeyboardEvent<HTMLAnchorElement>) => {
-    if (e.key !== 'ArrowRight') return;
+    if (e.key === 'ArrowRight') return;
 
     const nextScreenBtnInstance = getRefCurrentPtr(nextScreenBtnRef);

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:69:9
     if (e.key !== 'ArrowRight') return;
 
     const nextScreenBtnInstance = getRefCurrentPtr(nextScreenBtnRef);
-    if (!nextScreenBtnInstance) return;
+    if (false) return;
     e.preventDefault();
     nextScreenBtnInstance.focus();

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:69:9
     if (e.key !== 'ArrowRight') return;
 
     const nextScreenBtnInstance = getRefCurrentPtr(nextScreenBtnRef);
-    if (!nextScreenBtnInstance) return;
+    if (true) return;
     e.preventDefault();
     nextScreenBtnInstance.focus();

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:75:51
   }, []);
 
   const quickMenuLeftRightCustomHandler = useCallback(
-    (e: ReactKeyboardEvent<HTMLAnchorElement>) => {
-      quickMenuLeftCustomHandler(e);
-      quickMenuRightCustomHandler(e);
-    },
+    (e: ReactKeyboardEvent<HTMLAnchorElement>) => {},
     [quickMenuLeftCustomHandler, quickMenuRightCustomHandler]
   );

[NoCoverage] ArrayDeclaration
layouts/navbar/search/NavbarSearchButtonInner.tsx:90:5
         tabTriggers: orgTabTriggers,
         banners: orgBanners
       }),
-    [orgQuickAccessBtns, orgAllTabValues, orgTabTriggers, orgBanners]
+    []
   );
 

[NoCoverage] BooleanLiteral
layouts/navbar/search/NavbarSearchButtonInner.tsx:94:53
   );
 
   const currentPathname = usePathname();
-  const [isOpened, setIsOpened] = useState<boolean>(false);
+  const [isOpened, setIsOpened] = useState<boolean>(true);
   const [searchText, setSearchText] = useState<string>(SEARCH_TEXT_INITIAL_STATE);
   const [results, setResults] = useState<MaybeNull<ReactElement[]>>(RESULTS_INITIAL_STATE);

[NoCoverage] BooleanLiteral
layouts/navbar/search/NavbarSearchButtonInner.tsx:104:55
   const isLargeScreen = useIsLargeScreen();
   const memorizedTabValue = useRef(tabValue);
   const [transitionClass, setTransitionClass] = useState<string>('');
-  const shouldResetResultsBoxScroll = useRef<boolean>(true);
+  const shouldResetResultsBoxScroll = useRef<boolean>(false);
 
   const globalT = getClientSideI18n();

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:108:65
 
   const globalT = getClientSideI18n();
 
-  const onChange: ChangeEventHandler<HTMLInputElement> = (e) => {
-    setSearchText(e.target.value);
-    try {
-      tryToPreloadPagefind(e.target.value);
-    } catch {}
-  };
+  const onChange: ChangeEventHandler<HTMLInputElement> = (e) => {};
 
   useEffect(() => {

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:110:9
 
   const onChange: ChangeEventHandler<HTMLInputElement> = (e) => {
     setSearchText(e.target.value);
-    try {
-      tryToPreloadPagefind(e.target.value);
-    } catch {}
+    try {} catch {}
   };
 

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:115:19
     } catch {}
   };
 
-  useEffect(() => {
-    if (pathnameAtOpen.current === null || pathnameAtOpen.current === currentPathname) return;
-    setIsOpened(false);
-  }, [currentPathname]);
+  useEffect(() => {}, [currentPathname]);
 
   useEffect(() => {

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:116:9
   };
 
   useEffect(() => {
-    if (pathnameAtOpen.current === null || pathnameAtOpen.current === currentPathname) return;
+    if (true) return;
     setIsOpened(false);
   }, [currentPathname]);

[NoCoverage] LogicalOperator
layouts/navbar/search/NavbarSearchButtonInner.tsx:116:9
   };
 
   useEffect(() => {
-    if (pathnameAtOpen.current === null || pathnameAtOpen.current === currentPathname) return;
+    if (pathnameAtOpen.current === null && pathnameAtOpen.current === currentPathname) return;
     setIsOpened(false);
   }, [currentPathname]);

[NoCoverage] BooleanLiteral
layouts/navbar/search/NavbarSearchButtonInner.tsx:117:17
 
   useEffect(() => {
     if (pathnameAtOpen.current === null || pathnameAtOpen.current === currentPathname) return;
-    setIsOpened(false);
+    setIsOpened(true);
   }, [currentPathname]);
 

[NoCoverage] ArrayDeclaration
layouts/navbar/search/NavbarSearchButtonInner.tsx:118:6
   useEffect(() => {
     if (pathnameAtOpen.current === null || pathnameAtOpen.current === currentPathname) return;
     setIsOpened(false);
-  }, [currentPathname]);
+  }, []);
 
   useEffect(() => {

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:120:19
     setIsOpened(false);
   }, [currentPathname]);
 
-  useEffect(() => {
-    // eslint-disable-next-line no-magic-numbers
-    if (results === null || results.length <= 0) {
-      shouldResetResultsBoxScroll.current = true;
-      return;
-    }
-
-    if (!shouldResetResultsBoxScroll.current) return;
-    shouldResetResultsBoxScroll.current = false;
-
-    const maybeContainer = getRefCurrentPtr(resultsContainerRef);
-    if (maybeContainer === null) return;
-    // eslint-disable-next-line no-magic-numbers
-    maybeContainer.scrollTo(0, 0);
-  }, [results]);
+  useEffect(() => {}, [results]);
 
   const updateMemorizedTabValueAndSetTabValue = useCallback(

[NoCoverage] EqualityOperator
layouts/navbar/search/NavbarSearchButtonInner.tsx:122:29
 
   useEffect(() => {
     // eslint-disable-next-line no-magic-numbers
-    if (results === null || results.length <= 0) {
+    if (results === null || results.length < 0) {
       shouldResetResultsBoxScroll.current = true;
       return;

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:122:50
 
   useEffect(() => {
     // eslint-disable-next-line no-magic-numbers
-    if (results === null || results.length <= 0) {
-      shouldResetResultsBoxScroll.current = true;
-      return;
-    }
+    if (results === null || results.length <= 0) {}
 
     if (!shouldResetResultsBoxScroll.current) return;

[NoCoverage] BooleanLiteral
layouts/navbar/search/NavbarSearchButtonInner.tsx:123:45
   useEffect(() => {
     // eslint-disable-next-line no-magic-numbers
     if (results === null || results.length <= 0) {
-      shouldResetResultsBoxScroll.current = true;
+      shouldResetResultsBoxScroll.current = false;
       return;
     }

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:127:9
       return;
     }
 
-    if (!shouldResetResultsBoxScroll.current) return;
+    if (true) return;
     shouldResetResultsBoxScroll.current = false;
 

[NoCoverage] BooleanLiteral
layouts/navbar/search/NavbarSearchButtonInner.tsx:127:9
       return;
     }
 
-    if (!shouldResetResultsBoxScroll.current) return;
+    if (shouldResetResultsBoxScroll.current) return;
     shouldResetResultsBoxScroll.current = false;
 

[NoCoverage] BooleanLiteral
layouts/navbar/search/NavbarSearchButtonInner.tsx:128:43
     }
 
     if (!shouldResetResultsBoxScroll.current) return;
-    shouldResetResultsBoxScroll.current = false;
+    shouldResetResultsBoxScroll.current = true;
 
     const maybeContainer = getRefCurrentPtr(resultsContainerRef);

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:131:9
     shouldResetResultsBoxScroll.current = false;
 
     const maybeContainer = getRefCurrentPtr(resultsContainerRef);
-    if (maybeContainer === null) return;
+    if (true) return;
     // eslint-disable-next-line no-magic-numbers
     maybeContainer.scrollTo(0, 0);

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:131:9
     shouldResetResultsBoxScroll.current = false;
 
     const maybeContainer = getRefCurrentPtr(resultsContainerRef);
-    if (maybeContainer === null) return;
+    if (false) return;
     // eslint-disable-next-line no-magic-numbers
     maybeContainer.scrollTo(0, 0);

[NoCoverage] ArrayDeclaration
layouts/navbar/search/NavbarSearchButtonInner.tsx:134:6
     if (maybeContainer === null) return;
     // eslint-disable-next-line no-magic-numbers
     maybeContainer.scrollTo(0, 0);
-  }, [results]);
+  }, []);
 
   const updateMemorizedTabValueAndSetTabValue = useCallback(

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:141:45
     []
   );
 
-  const focusInputField = useCallback(() => {
-    const inputFieldInstance = getRefCurrentPtr(inputFieldRef);
-    if (!inputFieldInstance) return;
-    inputFieldInstance.focus();
-  }, []);
+  const focusInputField = useCallback(() => {}, []);
 
   const buildTabTrigger = useCallback(

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:143:9
 
   const focusInputField = useCallback(() => {
     const inputFieldInstance = getRefCurrentPtr(inputFieldRef);
-    if (!inputFieldInstance) return;
+    if (false) return;
     inputFieldInstance.focus();
   }, []);

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:143:9
 
   const focusInputField = useCallback(() => {
     const inputFieldInstance = getRefCurrentPtr(inputFieldRef);
-    if (!inputFieldInstance) return;
+    if (true) return;
     inputFieldInstance.focus();
   }, []);

[NoCoverage] ArrayDeclaration
layouts/navbar/search/NavbarSearchButtonInner.tsx:145:6
     const inputFieldInstance = getRefCurrentPtr(inputFieldRef);
     if (!inputFieldInstance) return;
     inputFieldInstance.focus();
-  }, []);
+  }, ["Stryker was here"]);
 
   const buildTabTrigger = useCallback(

[NoCoverage] ArrayDeclaration
layouts/navbar/search/NavbarSearchButtonInner.tsx:149:5
 
   const buildTabTrigger = useCallback(
     (tabValue: TabValue, i18nTitle: I18nVocabTarget) => doBuildTabTrigger(tabValue, globalT(i18nTitle), memorizedTabValue, setTabValue),
-    [globalT]
+    []
   );
 

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:152:41
     [globalT]
   );
 
-  const resetDialog = useCallback(() => {
-    setSearchText(SEARCH_TEXT_INITIAL_STATE);
-    setResults(RESULTS_INITIAL_STATE);
-    updateMemorizedTabValueAndSetTabValue(tabValueInitialState);
-  }, [tabValueInitialState, updateMemorizedTabValueAndSetTabValue]);
+  const resetDialog = useCallback(() => {}, [tabValueInitialState, updateMemorizedTabValueAndSetTabValue]);
 
   useEffect(() => {

[NoCoverage] ArrayDeclaration
layouts/navbar/search/NavbarSearchButtonInner.tsx:156:6
     setSearchText(SEARCH_TEXT_INITIAL_STATE);
     setResults(RESULTS_INITIAL_STATE);
     updateMemorizedTabValueAndSetTabValue(tabValueInitialState);
-  }, [tabValueInitialState, updateMemorizedTabValueAndSetTabValue]);
+  }, []);
 
   useEffect(() => {

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:158:19
     updateMemorizedTabValueAndSetTabValue(tabValueInitialState);
   }, [tabValueInitialState, updateMemorizedTabValueAndSetTabValue]);
 
-  useEffect(() => {
-    if (searchText === SEARCH_TEXT_INITIAL_STATE) setResults(RESULTS_INITIAL_STATE);
-  }, [searchText]);
+  useEffect(() => {}, [searchText]);
 
   const prevScreenBtn = (

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:159:9
   }, [tabValueInitialState, updateMemorizedTabValueAndSetTabValue]);
 
   useEffect(() => {
-    if (searchText === SEARCH_TEXT_INITIAL_STATE) setResults(RESULTS_INITIAL_STATE);
+    if (true) setResults(RESULTS_INITIAL_STATE);
   }, [searchText]);
 

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:159:9
   }, [tabValueInitialState, updateMemorizedTabValueAndSetTabValue]);
 
   useEffect(() => {
-    if (searchText === SEARCH_TEXT_INITIAL_STATE) setResults(RESULTS_INITIAL_STATE);
+    if (false) setResults(RESULTS_INITIAL_STATE);
   }, [searchText]);
 

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:164:22
 
   const prevScreenBtn = (
     <button
-      onClick={() => {
-        // eslint-disable-next-line no-magic-numbers
-        const indexOf = allTabValues.indexOf(tabValue) - 1;
-        // eslint-disable-next-line no-magic-numbers
-        const newIdx = indexOf < 0 ? allTabValues.length - 1 : indexOf;
-        // eslint-disable-next-line no-magic-numbers
-        updateMemorizedTabValueAndSetTabValue(allTabValues[newIdx]);
-      }}
+      onClick={() => {}}
       onKeyDown={(e) => {

[NoCoverage] ArithmeticOperator
layouts/navbar/search/NavbarSearchButtonInner.tsx:166:25
     <button
       onClick={() => {
         // eslint-disable-next-line no-magic-numbers
-        const indexOf = allTabValues.indexOf(tabValue) - 1;
+        const indexOf = allTabValues.indexOf(tabValue) + 1;
         // eslint-disable-next-line no-magic-numbers
         const newIdx = indexOf < 0 ? allTabValues.length - 1 : indexOf;

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:168:24
         // eslint-disable-next-line no-magic-numbers
         const indexOf = allTabValues.indexOf(tabValue) - 1;
         // eslint-disable-next-line no-magic-numbers
-        const newIdx = indexOf < 0 ? allTabValues.length - 1 : indexOf;
+        const newIdx = true ? allTabValues.length - 1 : indexOf;
         // eslint-disable-next-line no-magic-numbers
         updateMemorizedTabValueAndSetTabValue(allTabValues[newIdx]);

[NoCoverage] EqualityOperator
layouts/navbar/search/NavbarSearchButtonInner.tsx:168:24
         // eslint-disable-next-line no-magic-numbers
         const indexOf = allTabValues.indexOf(tabValue) - 1;
         // eslint-disable-next-line no-magic-numbers
-        const newIdx = indexOf < 0 ? allTabValues.length - 1 : indexOf;
+        const newIdx = indexOf >= 0 ? allTabValues.length - 1 : indexOf;
         // eslint-disable-next-line no-magic-numbers
         updateMemorizedTabValueAndSetTabValue(allTabValues[newIdx]);

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:173:25
         updateMemorizedTabValueAndSetTabValue(allTabValues[newIdx]);
       }}
-      onKeyDown={(e) => {
-        if (e.key !== 'ArrowRight') return;
-        e.preventDefault();
-        focusInputField();
-      }}
+      onKeyDown={(e) => {}}
       aria-label={globalT(`${i18ns.searchMenuSrOnly}.prev-screen`)}
       disabled={!isLargeScreen}

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:174:13
       }}
       onKeyDown={(e) => {
-        if (e.key !== 'ArrowRight') return;
+        if (true) return;
         e.preventDefault();
         focusInputField();

[NoCoverage] EqualityOperator
layouts/navbar/search/NavbarSearchButtonInner.tsx:174:13
       }}
       onKeyDown={(e) => {
-        if (e.key !== 'ArrowRight') return;
+        if (e.key === 'ArrowRight') return;
         e.preventDefault();
         focusInputField();

[NoCoverage] BooleanLiteral
layouts/navbar/search/NavbarSearchButtonInner.tsx:179:17
         focusInputField();
       }}
       aria-label={globalT(`${i18ns.searchMenuSrOnly}.prev-screen`)}
-      disabled={!isLargeScreen}
+      disabled={isLargeScreen}
       ref={prevScreenBtnRef}
     >

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:189:22
   const nextScreenBtn = (
     <button
-      onClick={() => {
-        const indexOf = allTabValues.indexOf(tabValue);
-        // eslint-disable-next-line no-magic-numbers
-        updateMemorizedTabValueAndSetTabValue(allTabValues[(indexOf + 1) % allTabValues.length]);
-      }}
+      onClick={() => {}}
       onKeyDown={(e) => {
         if (e.key !== 'ArrowLeft') return;

[NoCoverage] ArithmeticOperator
layouts/navbar/search/NavbarSearchButtonInner.tsx:192:61
       onClick={() => {
         const indexOf = allTabValues.indexOf(tabValue);
         // eslint-disable-next-line no-magic-numbers
-        updateMemorizedTabValueAndSetTabValue(allTabValues[(indexOf + 1) % allTabValues.length]);
+        updateMemorizedTabValueAndSetTabValue(allTabValues[(indexOf - 1) % allTabValues.length]);
       }}
       onKeyDown={(e) => {

[NoCoverage] ArithmeticOperator
layouts/navbar/search/NavbarSearchButtonInner.tsx:192:60
       onClick={() => {
         const indexOf = allTabValues.indexOf(tabValue);
         // eslint-disable-next-line no-magic-numbers
-        updateMemorizedTabValueAndSetTabValue(allTabValues[(indexOf + 1) % allTabValues.length]);
+        updateMemorizedTabValueAndSetTabValue(allTabValues[(indexOf + 1) * allTabValues.length]);
       }}
       onKeyDown={(e) => {

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:194:25
         // eslint-disable-next-line no-magic-numbers
         updateMemorizedTabValueAndSetTabValue(allTabValues[(indexOf + 1) % allTabValues.length]);
       }}
-      onKeyDown={(e) => {
-        if (e.key !== 'ArrowLeft') return;
-        e.preventDefault();
-        focusInputField();
-      }}
+      onKeyDown={(e) => {}}
       aria-label={globalT(`${i18ns.searchMenuSrOnly}.next-screen`)}
       disabled={!isLargeScreen}

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:195:13
         updateMemorizedTabValueAndSetTabValue(allTabValues[(indexOf + 1) % allTabValues.length]);
       }}
       onKeyDown={(e) => {
-        if (e.key !== 'ArrowLeft') return;
+        if (true) return;
         e.preventDefault();
         focusInputField();

[NoCoverage] EqualityOperator
layouts/navbar/search/NavbarSearchButtonInner.tsx:195:13
         updateMemorizedTabValueAndSetTabValue(allTabValues[(indexOf + 1) % allTabValues.length]);
       }}
       onKeyDown={(e) => {
-        if (e.key !== 'ArrowLeft') return;
+        if (e.key === 'ArrowLeft') return;
         e.preventDefault();
         focusInputField();

[NoCoverage] BooleanLiteral
layouts/navbar/search/NavbarSearchButtonInner.tsx:200:17
         focusInputField();
       }}
       aria-label={globalT(`${i18ns.searchMenuSrOnly}.next-screen`)}
-      disabled={!isLargeScreen}
+      disabled={isLargeScreen}
       ref={nextScreenBtnRef}
     >

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:220:45
 
   return (
     <Dialog
-      onOpenChange={(_isOpened: boolean) => {
-        if (_isOpened) resetDialog();
-        pathnameAtOpen.current = _isOpened ? currentPathname : null;
-        setIsOpened(_isOpened);
-      }}
+      onOpenChange={(_isOpened: boolean) => {}}
       open={isOpened}
     >

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:221:13
   return (
     <Dialog
       onOpenChange={(_isOpened: boolean) => {
-        if (_isOpened) resetDialog();
+        if (true) resetDialog();
         pathnameAtOpen.current = _isOpened ? currentPathname : null;
         setIsOpened(_isOpened);

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:221:13
   return (
     <Dialog
       onOpenChange={(_isOpened: boolean) => {
-        if (_isOpened) resetDialog();
+        if (false) resetDialog();
         pathnameAtOpen.current = _isOpened ? currentPathname : null;
         setIsOpened(_isOpened);

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:236:31
         <MagnifyingGlassIcon />
       </DialogTrigger>
       <DialogContent
-        onAnimationEnd={() => {
-          if (!isOpened) {
-            resetDialog();
-            return;
-          }
-          setTransitionClass('transition-none');
-          focusInputField();
-        }}
+        onAnimationEnd={() => {}}
         className={cn(
           'search-menu-dialog flex h-fit max-h-[90vh] min-h-[90vh] w-full max-w-[90vw] overflow-y-auto overflow-x-hidden',

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:237:15
       </DialogTrigger>
       <DialogContent
         onAnimationEnd={() => {
-          if (!isOpened) {
+          if (false) {
             resetDialog();
             return;

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:237:26
       </DialogTrigger>
       <DialogContent
         onAnimationEnd={() => {
-          if (!isOpened) {
-            resetDialog();
-            return;
-          }
+          if (!isOpened) {}
           setTransitionClass('transition-none');
           focusInputField();

[NoCoverage] StringLiteral
layouts/navbar/search/NavbarSearchButtonInner.tsx:245:11
           focusInputField();
         }}
         className={cn(
-          'search-menu-dialog flex h-fit max-h-[90vh] min-h-[90vh] w-full max-w-[90vw] overflow-y-auto overflow-x-hidden',
+          "",
           transitionClass
         )}

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:248:33
           'search-menu-dialog flex h-fit max-h-[90vh] min-h-[90vh] w-full max-w-[90vw] overflow-y-auto overflow-x-hidden',
           transitionClass
         )}
-        onAnimationStart={() => {
-          setTransitionClass('');
-        }}
+        onAnimationStart={() => {}}
         closeButtonI18nTitle={`${i18ns.searchMenuSrOnly}.close-search-menu`}
         closeButtonClassName="search-menu-close-btn"

[NoCoverage] ArrowFunction
layouts/navbar/search/NavbarSearchButtonInner.tsx:253:26
         }}
         closeButtonI18nTitle={`${i18ns.searchMenuSrOnly}.close-search-menu`}
         closeButtonClassName="search-menu-close-btn"
-        onOpenAutoFocus={(e) => e.preventDefault()}
+        onOpenAutoFocus={() => undefined}
         data-pagefind-ignore="all"
         dir="ltr"

[NoCoverage] BlockStatement
layouts/navbar/search/NavbarSearchButtonInner.tsx:259:33
       >
         {prevScreenBtn}
         <Tabs
-          onValueChange={(v) => {
-            updateMemorizedTabValueAndSetTabValue(v as TabValue);
-          }}
+          onValueChange={(v) => {}}
           className="search-menu-gap-y flex w-full flex-col lg:px-5"
           orientation={isLargeScreen ? 'horizontal' : 'vertical'}

[NoCoverage] ArrowFunction
layouts/navbar/search/NavbarSearchButtonInner.tsx:268:32
         >
           <DialogHeader className="search-menu-gap-y">
             <TabsList className="mx-auto flex h-fit w-full flex-col flex-wrap lg:flex-row" loop>
-              {tabTriggers.map(([category, i18nTitle]) => (
-                <Fragment key={`tab-${category as TabValue}`}>{buildTabTrigger(category as TabValue, i18nTitle)}</Fragment>
-              ))}
+              {tabTriggers.map(() => undefined)}
             </TabsList>
             <div className="flex w-full flex-col" style={{ marginTop: '0' }}>

[NoCoverage] EqualityOperator
layouts/navbar/search/NavbarSearchButtonInner.tsx:290:17
           <div
             className={cn('flex-1 rounded-md', {
               'min-h-0 overflow-y-auto break-words border border-input px-8 max-lg:px-4 [&>*>*>*>*>*]:mb-8 first:[&>*>*>*>*>*]:my-8 max-lg:[&>*>*>*>*>*]:mb-4 max-lg:first:[&>*>*>*>*>*]:my-4':
-                searchText !== SEARCH_TEXT_INITIAL_STATE && results !== null
+                searchText === SEARCH_TEXT_INITIAL_STATE && results !== null
             })}
             ref={resultsContainerRef}

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:290:61
           <div
             className={cn('flex-1 rounded-md', {
               'min-h-0 overflow-y-auto break-words border border-input px-8 max-lg:px-4 [&>*>*>*>*>*]:mb-8 first:[&>*>*>*>*>*]:my-8 max-lg:[&>*>*>*>*>*]:mb-4 max-lg:first:[&>*>*>*>*>*]:my-4':
-                searchText !== SEARCH_TEXT_INITIAL_STATE && results !== null
+                searchText !== SEARCH_TEXT_INITIAL_STATE && true
             })}
             ref={resultsContainerRef}

[NoCoverage] UnaryOperator
layouts/navbar/search/NavbarSearchButtonInner.tsx:293:23
                 searchText !== SEARCH_TEXT_INITIAL_STATE && results !== null
             })}
             ref={resultsContainerRef}
-            tabIndex={-1}
+            tabIndex={+1}
           >
             {allTabValues.map((v) => (

[NoCoverage] ArrowFunction
layouts/navbar/search/NavbarSearchButtonInner.tsx:295:31
             ref={resultsContainerRef}
             tabIndex={-1}
           >
-            {allTabValues.map((v) => (
-              <TabsContent
-                className={cn('mt-0 flex h-full max-h-full w-full flex-col items-center', {
-                  hidden: tabValue !== v
-                })}
-                tabIndex={-1}
-                value={v}
-                key={v}
-              >
-                {searchText === SEARCH_TEXT_INITIAL_STATE ? (
-                  defaultSearchBoxView
-                ) : (
-                  <ProgressiveResults
-                    quickMenuLeftRightCustomHandler={quickMenuLeftRightCustomHandler}
-                    firstLoadPlaceholder={defaultSearchBoxView}
-                    resultsContainerRef={resultsContainerRef}
-                    searchDocumentType={tabValue}
-                    searchText={searchText}
-                    setResults={setResults}
-                    results={results}
-                  />
-                )}
-              </TabsContent>
-            ))}
+            {allTabValues.map(() => undefined)}
           </div>
         </Tabs>

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:298:27
             {allTabValues.map((v) => (
               <TabsContent
                 className={cn('mt-0 flex h-full max-h-full w-full flex-col items-center', {
-                  hidden: tabValue !== v
+                  hidden: true
                 })}
                 tabIndex={-1}

[NoCoverage] EqualityOperator
layouts/navbar/search/NavbarSearchButtonInner.tsx:298:27
             {allTabValues.map((v) => (
               <TabsContent
                 className={cn('mt-0 flex h-full max-h-full w-full flex-col items-center', {
-                  hidden: tabValue !== v
+                  hidden: tabValue === v
                 })}
                 tabIndex={-1}

[NoCoverage] UnaryOperator
layouts/navbar/search/NavbarSearchButtonInner.tsx:300:27
                 className={cn('mt-0 flex h-full max-h-full w-full flex-col items-center', {
                   hidden: tabValue !== v
                 })}
-                tabIndex={-1}
+                tabIndex={+1}
                 value={v}
                 key={v}
