[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:304:18
                 value={v}
                 key={v}
               >
-                {searchText === SEARCH_TEXT_INITIAL_STATE ? (
+                {false ? (
                   defaultSearchBoxView
                 ) : (

[NoCoverage] ConditionalExpression
layouts/navbar/search/NavbarSearchButtonInner.tsx:304:18
                 value={v}
                 key={v}
               >
-                {searchText === SEARCH_TEXT_INITIAL_STATE ? (
+                {true ? (
                   defaultSearchBoxView
                 ) : (
