[NoCoverage] BooleanLiteral
layouts/navbar/search/ProgressiveResults.tsx:48:73
   // eslint-disable-next-line no-magic-numbers
   const [currentSearchResultsSliceStartIndex, setCurrentSearchResultsSliceStartIndex] = useState<number>(0);
   const [currentSearchResults, setCurrentSearchResults] = useState<ReactElement[]>([]);
-  const [displayShowMoreBtn, setDisplayShowMoreBtn] = useState<boolean>(false);
+  const [displayShowMoreBtn, setDisplayShowMoreBtn] = useState<boolean>(true);
 
   const currentSearchResultsRef = useRef<ReactElement[]>(currentSearchResults);

[NoCoverage] BlockStatement
layouts/navbar/search/ProgressiveResults.tsx:55:51
   const resultsRef = useRef<MaybeNull<ReactElement[]>>(results);
   const lastResultRef = useRef<HTMLAnchorElement>(null);
 
-  const resetResultsBoxScroll = useCallback(() => {
-    const maybeContainer = getRefCurrentPtr(resultsContainerRef);
-    if (maybeContainer === null) return;
-    // eslint-disable-next-line no-magic-numbers
-    maybeContainer.scrollTo(0, 0);
-  }, [resultsContainerRef]);
+  const resetResultsBoxScroll = useCallback(() => {}, [resultsContainerRef]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
layouts/navbar/search/ProgressiveResults.tsx:62:19
     maybeContainer.scrollTo(0, 0);
   }, [resultsContainerRef]);
 
-  useEffect(() => {
-    // eslint-disable-next-line no-magic-numbers
-    setCurrentSearchResultsSliceStartIndex(0);
-    setCurrentSearchResults([]);
-    resetResultsBoxScroll();
-  }, [searchText, resetResultsBoxScroll]);
+  useEffect(() => {}, [searchText, resetResultsBoxScroll]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
layouts/navbar/search/ProgressiveResults.tsx:69:19
     resetResultsBoxScroll();
   }, [searchText, resetResultsBoxScroll]);
 
-  useEffect(() => {
-    currentSearchResultsRef.current = currentSearchResults;
-  }, [currentSearchResults]);
+  useEffect(() => {}, [currentSearchResults]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
layouts/navbar/search/ProgressiveResults.tsx:73:19
     currentSearchResultsRef.current = currentSearchResults;
   }, [currentSearchResults]);
 
-  useEffect(() => {
-    resultsRef.current = results;
-  }, [results]);
+  useEffect(() => {}, [results]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
layouts/navbar/search/ProgressiveResults.tsx:77:19
     resultsRef.current = results;
   }, [results]);
 
-  useEffect(() => {
-    currentSearchResultsSliceStartIndexRef.current = currentSearchResultsSliceStartIndex;
-  }, [currentSearchResultsSliceStartIndex]);
+  useEffect(() => {}, [currentSearchResultsSliceStartIndex]);
 
   const computeAndSetResults = useCallback(async () => {

[NoCoverage] MethodExpression
layouts/navbar/search/ProgressiveResults.tsx:83:32
 
   const computeAndSetResults = useCallback(async () => {
     const search = await searchDocument(searchText, searchDocumentType);
-    const searchResultsSlice = search.results.slice(
-      currentSearchResultsSliceStartIndexRef.current,
-      currentSearchResultsSliceStartIndexRef.current + RESULTS_SLICE_LEN
-    );
+    const searchResultsSlice = search.results;
     const freshResults: ReactElement[] = [];
 

[NoCoverage] ArithmeticOperator
layouts/navbar/search/ProgressiveResults.tsx:85:7
     const search = await searchDocument(searchText, searchDocumentType);
     const searchResultsSlice = search.results.slice(
       currentSearchResultsSliceStartIndexRef.current,
-      currentSearchResultsSliceStartIndexRef.current + RESULTS_SLICE_LEN
+      currentSearchResultsSliceStartIndexRef.current - RESULTS_SLICE_LEN
     );
     const freshResults: ReactElement[] = [];

[NoCoverage] UpdateOperator
layouts/navbar/search/ProgressiveResults.tsx:92:52
     // eslint-disable-next-line promise/catch-or-return
     const mountedData = await Promise.all(searchResultsSlice.map((r) => r.data()));
 
-    for (let i = 0; i < searchResultsSlice.length; i++) {
+    for (let i = 0; i < searchResultsSlice.length; i--) {
       const data = mountedData[i];
       if (!data) continue;

[NoCoverage] EqualityOperator
layouts/navbar/search/ProgressiveResults.tsx:92:21
     // eslint-disable-next-line promise/catch-or-return
     const mountedData = await Promise.all(searchResultsSlice.map((r) => r.data()));
 
-    for (let i = 0; i < searchResultsSlice.length; i++) {
+    for (let i = 0; i >= searchResultsSlice.length; i++) {
       const data = mountedData[i];
       if (!data) continue;

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:94:11
 
     for (let i = 0; i < searchResultsSlice.length; i++) {
       const data = mountedData[i];
-      if (!data) continue;
+      if (true) continue;
 
       const { url } = data;

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:94:11
 
     for (let i = 0; i < searchResultsSlice.length; i++) {
       const data = mountedData[i];
-      if (!data) continue;
+      if (false) continue;
 
       const { url } = data;

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:97:11
       if (!data) continue;
 
       const { url } = data;
-      if (!url) continue;
+      if (false) continue;
 
       const cleanedUrl = getCleanedURL(url);

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:97:11
       if (!data) continue;
 
       const { url } = data;
-      if (!url) continue;
+      if (true) continue;
 
       const cleanedUrl = getCleanedURL(url);

[NoCoverage] ArithmeticOperator
layouts/navbar/search/ProgressiveResults.tsx:104:94
       const excerpt = data.excerpt;
 
       // eslint-disable-next-line no-magic-numbers
-      const onFocus = buildResultOnFocus(currentSearchResultsSliceStartIndexRef.current + i, search.results.length - 1, resultsContainerRef);
+      const onFocus = buildResultOnFocus(currentSearchResultsSliceStartIndexRef.current + i, search.results.length + 1, resultsContainerRef);
 
       freshResults.push(

[NoCoverage] ArithmeticOperator
layouts/navbar/search/ProgressiveResults.tsx:104:42
       const excerpt = data.excerpt;
 
       // eslint-disable-next-line no-magic-numbers
-      const onFocus = buildResultOnFocus(currentSearchResultsSliceStartIndexRef.current + i, search.results.length - 1, resultsContainerRef);
+      const onFocus = buildResultOnFocus(currentSearchResultsSliceStartIndexRef.current - i, search.results.length - 1, resultsContainerRef);
 
       freshResults.push(

[NoCoverage] StringLiteral
layouts/navbar/search/ProgressiveResults.tsx:108:93
 
       freshResults.push(
         <Result
-          navigationMenuItemProps={{ onKeyDown: quickMenuLeftRightCustomHandler, className: 'w-full', key: String(i) }}
+          navigationMenuItemProps={{ onKeyDown: quickMenuLeftRightCustomHandler, className: "", key: String(i) }}
           // eslint-disable-next-line no-magic-numbers
           ref={searchResultsSlice.length <= i + 1 ? lastResultRef : undefined}

[NoCoverage] EqualityOperator
layouts/navbar/search/ProgressiveResults.tsx:110:16
         <Result
           navigationMenuItemProps={{ onKeyDown: quickMenuLeftRightCustomHandler, className: 'w-full', key: String(i) }}
           // eslint-disable-next-line no-magic-numbers
-          ref={searchResultsSlice.length <= i + 1 ? lastResultRef : undefined}
+          ref={searchResultsSlice.length < i + 1 ? lastResultRef : undefined}
           key={searchResultsSlice[i].id}
           metaTitle={metaTitle}

[NoCoverage] ArithmeticOperator
layouts/navbar/search/ProgressiveResults.tsx:110:45
         <Result
           navigationMenuItemProps={{ onKeyDown: quickMenuLeftRightCustomHandler, className: 'w-full', key: String(i) }}
           // eslint-disable-next-line no-magic-numbers
-          ref={searchResultsSlice.length <= i + 1 ? lastResultRef : undefined}
+          ref={searchResultsSlice.length <= i - 1 ? lastResultRef : undefined}
           key={searchResultsSlice[i].id}
           metaTitle={metaTitle}

[NoCoverage] ArithmeticOperator
layouts/navbar/search/ProgressiveResults.tsx:121:52
     }
 
     const newResults = [...currentSearchResultsRef.current, ...freshResults];
-    const newCurrentSearchResultsSliceStartIndex = currentSearchResultsSliceStartIndexRef.current + RESULTS_SLICE_LEN;
+    const newCurrentSearchResultsSliceStartIndex = currentSearchResultsSliceStartIndexRef.current - RESULTS_SLICE_LEN;
     setCurrentSearchResults(newResults);
     setResults(newResults);

[NoCoverage] EqualityOperator
layouts/navbar/search/ProgressiveResults.tsx:126:27
     setResults(newResults);
     setCurrentSearchResultsSliceStartIndex(newCurrentSearchResultsSliceStartIndex);
     // eslint-disable-next-line no-magic-numbers
-    setDisplayShowMoreBtn(newCurrentSearchResultsSliceStartIndex < search.results.length - 1);
+    setDisplayShowMoreBtn(newCurrentSearchResultsSliceStartIndex >= search.results.length - 1);
   }, [setResults, searchText, searchDocumentType, resultsContainerRef, quickMenuLeftRightCustomHandler]);
 

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:126:27
     setResults(newResults);
     setCurrentSearchResultsSliceStartIndex(newCurrentSearchResultsSliceStartIndex);
     // eslint-disable-next-line no-magic-numbers
-    setDisplayShowMoreBtn(newCurrentSearchResultsSliceStartIndex < search.results.length - 1);
+    setDisplayShowMoreBtn(false);
   }, [setResults, searchText, searchDocumentType, resultsContainerRef, quickMenuLeftRightCustomHandler]);
 

[NoCoverage] ArrayDeclaration
layouts/navbar/search/ProgressiveResults.tsx:127:6
     setCurrentSearchResultsSliceStartIndex(newCurrentSearchResultsSliceStartIndex);
     // eslint-disable-next-line no-magic-numbers
     setDisplayShowMoreBtn(newCurrentSearchResultsSliceStartIndex < search.results.length - 1);
-  }, [setResults, searchText, searchDocumentType, resultsContainerRef, quickMenuLeftRightCustomHandler]);
+  }, []);
 
   const throttledComputeAndSetResults = useMemo(() => throttle(computeAndSetResults, THROTTLE_DELAY), [computeAndSetResults]);

[NoCoverage] EqualityOperator
layouts/navbar/search/ProgressiveResults.tsx:132:9
   const throttledComputeAndSetResults = useMemo(() => throttle(computeAndSetResults, THROTTLE_DELAY), [computeAndSetResults]);
 
   useEffect(() => {
-    if (searchText === SEARCH_TEXT_INITIAL_STATE) return;
+    if (searchText !== SEARCH_TEXT_INITIAL_STATE) return;
 
     let retries: Count = 0;

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:132:9
   const throttledComputeAndSetResults = useMemo(() => throttle(computeAndSetResults, THROTTLE_DELAY), [computeAndSetResults]);
 
   useEffect(() => {
-    if (searchText === SEARCH_TEXT_INITIAL_STATE) return;
+    if (false) return;
 
     let retries: Count = 0;

[NoCoverage] BooleanLiteral
layouts/navbar/search/ProgressiveResults.tsx:137:23
     let retries: Count = 0;
     const maxRetries: Limit = 4;
     const intervalMs: MsValue = 250;
-    let isComputing = false;
+    let isComputing = true;
 
     let retryInterval: MaybeNull<NodeJS.Timeout> = setInterval(async () => {

[NoCoverage] BlockStatement
layouts/navbar/search/ProgressiveResults.tsx:140:39
     let isComputing = false;
 
     let retryInterval: MaybeNull<NodeJS.Timeout> = setInterval(async () => {
-      function disposeRetryInterval() {
-        // eslint-disable-next-line no-magic-numbers
-        retries = 0;
-        isComputing = false;
-        if (retryInterval) {
-          clearInterval(retryInterval);
-          retryInterval = null;
-        }
-      }
+      function disposeRetryInterval() {}
 
       try {

[NoCoverage] BooleanLiteral
layouts/navbar/search/ProgressiveResults.tsx:143:23
       function disposeRetryInterval() {
         // eslint-disable-next-line no-magic-numbers
         retries = 0;
-        isComputing = false;
+        isComputing = true;
         if (retryInterval) {
           clearInterval(retryInterval);

[NoCoverage] BlockStatement
layouts/navbar/search/ProgressiveResults.tsx:144:28
         // eslint-disable-next-line no-magic-numbers
         retries = 0;
         isComputing = false;
-        if (retryInterval) {
-          clearInterval(retryInterval);
-          retryInterval = null;
-        }
+        if (retryInterval) {}
       }
 

[NoCoverage] BlockStatement
layouts/navbar/search/ProgressiveResults.tsx:150:11
         }
       }
 
-      try {
-        if (window.pagefind && window.pagefind.isBroken) throw new Error('window.pagefind.isBroken is true');
-        if (isComputing) return;
-
-        isComputing = true;
-        await throttledComputeAndSetResults();
-        disposeRetryInterval();
-      } catch (e) {
+      try {} catch (e) {
         retries++;
 

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:151:13
       }
 
       try {
-        if (window.pagefind && window.pagefind.isBroken) throw new Error('window.pagefind.isBroken is true');
+        if (false) throw new Error('window.pagefind.isBroken is true');
         if (isComputing) return;
 

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:151:13
       }
 
       try {
-        if (window.pagefind && window.pagefind.isBroken) throw new Error('window.pagefind.isBroken is true');
+        if (true) throw new Error('window.pagefind.isBroken is true');
         if (isComputing) return;
 

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:152:13
 
       try {
         if (window.pagefind && window.pagefind.isBroken) throw new Error('window.pagefind.isBroken is true');
-        if (isComputing) return;
+        if (true) return;
 
         isComputing = true;

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:152:13
 
       try {
         if (window.pagefind && window.pagefind.isBroken) throw new Error('window.pagefind.isBroken is true');
-        if (isComputing) return;
+        if (false) return;
 
         isComputing = true;

[NoCoverage] BooleanLiteral
layouts/navbar/search/ProgressiveResults.tsx:154:23
         if (window.pagefind && window.pagefind.isBroken) throw new Error('window.pagefind.isBroken is true');
         if (isComputing) return;
 
-        isComputing = true;
+        isComputing = false;
         await throttledComputeAndSetResults();
         disposeRetryInterval();

[NoCoverage] BlockStatement
layouts/navbar/search/ProgressiveResults.tsx:157:19
         isComputing = true;
         await throttledComputeAndSetResults();
         disposeRetryInterval();
-      } catch (e) {
-        retries++;
-
-        if (retries >= maxRetries) {
-          const tracedError = new PagefindIntegrationError(
-            (e instanceof Error && e.message) || 'Invalid throw usage, intercepted in a traceError catch.'
-          );
-
-          tracedError.cause = (e instanceof Error && e.cause) || undefined;
-          tracedError.stack = (e instanceof Error && e.stack) || undefined;
-          traceError(tracedError, { userAgent: navigator.userAgent });
-
-          toast({
-            description: globalT(`${i18ns.brokenPagefindIntegrationError}.message`),
-            title: globalT(`${i18ns.brokenPagefindIntegrationError}.title`),
-            variant: 'destructive'
-          });
-
-          setResults([]);
-          disposeRetryInterval();
-        }
-
-        isComputing = false;
-      }
+      } catch (e) {}
     }, intervalMs);
 

[NoCoverage] UpdateOperator
layouts/navbar/search/ProgressiveResults.tsx:158:9
         await throttledComputeAndSetResults();
         disposeRetryInterval();
       } catch (e) {
-        retries++;
+        retries--;
 
         if (retries >= maxRetries) {

[NoCoverage] EqualityOperator
layouts/navbar/search/ProgressiveResults.tsx:160:13
       } catch (e) {
         retries++;
 
-        if (retries >= maxRetries) {
+        if (retries > maxRetries) {
           const tracedError = new PagefindIntegrationError(
             (e instanceof Error && e.message) || 'Invalid throw usage, intercepted in a traceError catch.'

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:160:13
       } catch (e) {
         retries++;
 
-        if (retries >= maxRetries) {
+        if (true) {
           const tracedError = new PagefindIntegrationError(
             (e instanceof Error && e.message) || 'Invalid throw usage, intercepted in a traceError catch.'

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:162:14
 
         if (retries >= maxRetries) {
           const tracedError = new PagefindIntegrationError(
-            (e instanceof Error && e.message) || 'Invalid throw usage, intercepted in a traceError catch.'
+            (false) || 'Invalid throw usage, intercepted in a traceError catch.'
           );
 

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:165:31
             (e instanceof Error && e.message) || 'Invalid throw usage, intercepted in a traceError catch.'
           );
 
-          tracedError.cause = (e instanceof Error && e.cause) || undefined;
+          tracedError.cause = false;
           tracedError.stack = (e instanceof Error && e.stack) || undefined;
           traceError(tracedError, { userAgent: navigator.userAgent });

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:165:31
             (e instanceof Error && e.message) || 'Invalid throw usage, intercepted in a traceError catch.'
           );
 
-          tracedError.cause = (e instanceof Error && e.cause) || undefined;
+          tracedError.cause = true;
           tracedError.stack = (e instanceof Error && e.stack) || undefined;
           traceError(tracedError, { userAgent: navigator.userAgent });

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:166:32
           );
 
           tracedError.cause = (e instanceof Error && e.cause) || undefined;
-          tracedError.stack = (e instanceof Error && e.stack) || undefined;
+          tracedError.stack = (false) || undefined;
           traceError(tracedError, { userAgent: navigator.userAgent });
 

[NoCoverage] ObjectLiteral
layouts/navbar/search/ProgressiveResults.tsx:169:17
           tracedError.stack = (e instanceof Error && e.stack) || undefined;
           traceError(tracedError, { userAgent: navigator.userAgent });
 
-          toast({
-            description: globalT(`${i18ns.brokenPagefindIntegrationError}.message`),
-            title: globalT(`${i18ns.brokenPagefindIntegrationError}.title`),
-            variant: 'destructive'
-          });
+          toast({});
 
           setResults([]);

[NoCoverage] BooleanLiteral
layouts/navbar/search/ProgressiveResults.tsx:179:23
           disposeRetryInterval();
         }
 
-        isComputing = false;
+        isComputing = true;
       }
     }, intervalMs);

[NoCoverage] BlockStatement
layouts/navbar/search/ProgressiveResults.tsx:183:18
       }
     }, intervalMs);
 
-    return () => {
-      if (retryInterval) {
-        clearInterval(retryInterval);
-        retryInterval = null;
-      }
-    };
+    return () => {};
   }, [searchText, searchDocumentType, throttledComputeAndSetResults, toast, globalT, setResults]);
 

[NoCoverage] BlockStatement
layouts/navbar/search/ProgressiveResults.tsx:184:26
     }, intervalMs);
 
     return () => {
-      if (retryInterval) {
-        clearInterval(retryInterval);
-        retryInterval = null;
-      }
+      if (retryInterval) {}
     };
   }, [searchText, searchDocumentType, throttledComputeAndSetResults, toast, globalT, setResults]);

[NoCoverage] ArrayDeclaration
layouts/navbar/search/ProgressiveResults.tsx:189:6
         retryInterval = null;
       }
     };
-  }, [searchText, searchDocumentType, throttledComputeAndSetResults, toast, globalT, setResults]);
+  }, []);
 
   if (results === null) return firstLoadPlaceholder;

[NoCoverage] EqualityOperator
layouts/navbar/search/ProgressiveResults.tsx:195:6
 
   return (
     // eslint-disable-next-line no-magic-numbers
-    (results.length > 0 && (
+    (results.length <= 0 && (
       <>
         <NavigationMenu.Root aria-label={globalT(`${i18ns.searchMenu}.sr-only.results`)} className="contents [&>div]:contents" orientation="vertical">

[NoCoverage] EqualityOperator
layouts/navbar/search/ProgressiveResults.tsx:195:6
 
   return (
     // eslint-disable-next-line no-magic-numbers
-    (results.length > 0 && (
+    (results.length >= 0 && (
       <>
         <NavigationMenu.Root aria-label={globalT(`${i18ns.searchMenu}.sr-only.results`)} className="contents [&>div]:contents" orientation="vertical">

[NoCoverage] LogicalOperator
layouts/navbar/search/ProgressiveResults.tsx:200:14
         <NavigationMenu.Root aria-label={globalT(`${i18ns.searchMenu}.sr-only.results`)} className="contents [&>div]:contents" orientation="vertical">
           <NavigationMenu.List className="contents">
             {results}
-            {displayShowMoreBtn && (
-              <NavigationMenu.Item key={'show-more-btn'}>
-                <NavigationMenu.Link asChild>
-                  <button
-                    onClick={async () => {
-                      const oldLastResultInstance = getRefCurrentPtr(lastResultRef);
-                      setDisplayShowMoreBtn(false);
-                      await computeAndSetResults();
-                      if (oldLastResultInstance) oldLastResultInstance.focus();
-                    }}
-                    className="search-menu-see-more-btn bg-primary font-semibold text-white"
-                  >
-                    {globalT(`${i18ns.vocab}.see-more`)}
-                  </button>
-                </NavigationMenu.Link>
-              </NavigationMenu.Item>
-            )}
+            {displayShowMoreBtn || <NavigationMenu.Item key={'show-more-btn'}>
+                <NavigationMenu.Link asChild>
+                  <button onClick={async () => {
+      const oldLastResultInstance = getRefCurrentPtr(lastResultRef);
+      setDisplayShowMoreBtn(false);
+      await computeAndSetResults();
+      if (oldLastResultInstance) oldLastResultInstance.focus();
+    }} className="search-menu-see-more-btn bg-primary font-semibold text-white">
+                    {globalT(`${i18ns.vocab}.see-more`)}
+                  </button>
+                </NavigationMenu.Link>
+              </NavigationMenu.Item>}
           </NavigationMenu.List>
         </NavigationMenu.Root>

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:200:14
         <NavigationMenu.Root aria-label={globalT(`${i18ns.searchMenu}.sr-only.results`)} className="contents [&>div]:contents" orientation="vertical">
           <NavigationMenu.List className="contents">
             {results}
-            {displayShowMoreBtn && (
-              <NavigationMenu.Item key={'show-more-btn'}>
-                <NavigationMenu.Link asChild>
-                  <button
-                    onClick={async () => {
-                      const oldLastResultInstance = getRefCurrentPtr(lastResultRef);
-                      setDisplayShowMoreBtn(false);
-                      await computeAndSetResults();
-                      if (oldLastResultInstance) oldLastResultInstance.focus();
-                    }}
-                    className="search-menu-see-more-btn bg-primary font-semibold text-white"
-                  >
-                    {globalT(`${i18ns.vocab}.see-more`)}
-                  </button>
-                </NavigationMenu.Link>
-              </NavigationMenu.Item>
-            )}
+            {true}
           </NavigationMenu.List>
         </NavigationMenu.Root>

[NoCoverage] BlockStatement
layouts/navbar/search/ProgressiveResults.tsx:204:42
               <NavigationMenu.Item key={'show-more-btn'}>
                 <NavigationMenu.Link asChild>
                   <button
-                    onClick={async () => {
-                      const oldLastResultInstance = getRefCurrentPtr(lastResultRef);
-                      setDisplayShowMoreBtn(false);
-                      await computeAndSetResults();
-                      if (oldLastResultInstance) oldLastResultInstance.focus();
-                    }}
+                    onClick={async () => {}}
                     className="search-menu-see-more-btn bg-primary font-semibold text-white"
                   >

[NoCoverage] BooleanLiteral
layouts/navbar/search/ProgressiveResults.tsx:206:45
                   <button
                     onClick={async () => {
                       const oldLastResultInstance = getRefCurrentPtr(lastResultRef);
-                      setDisplayShowMoreBtn(false);
+                      setDisplayShowMoreBtn(true);
                       await computeAndSetResults();
                       if (oldLastResultInstance) oldLastResultInstance.focus();

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:208:27
                       const oldLastResultInstance = getRefCurrentPtr(lastResultRef);
                       setDisplayShowMoreBtn(false);
                       await computeAndSetResults();
-                      if (oldLastResultInstance) oldLastResultInstance.focus();
+                      if (true) oldLastResultInstance.focus();
                     }}
                     className="search-menu-see-more-btn bg-primary font-semibold text-white"

[NoCoverage] ConditionalExpression
layouts/navbar/search/ProgressiveResults.tsx:208:27
                       const oldLastResultInstance = getRefCurrentPtr(lastResultRef);
                       setDisplayShowMoreBtn(false);
                       await computeAndSetResults();
-                      if (oldLastResultInstance) oldLastResultInstance.focus();
+                      if (false) oldLastResultInstance.focus();
                     }}
                     className="search-menu-see-more-btn bg-primary font-semibold text-white"
