[NoCoverage] EqualityOperator
components/pages/blog/BlogPost.tsx:28:19
   const scopedT2 = await getScopedI18n(i18ns.blogTags);
 
   // eslint-disable-next-line no-magic-numbers
-  const hasTags = post.tags.length > 0;
+  const hasTags = post.tags.length <= 0;
   // eslint-disable-next-line no-magic-numbers
   const showToC = post.headings.length > 1;

[NoCoverage] EqualityOperator
components/pages/blog/BlogPost.tsx:28:19
   const scopedT2 = await getScopedI18n(i18ns.blogTags);
 
   // eslint-disable-next-line no-magic-numbers
-  const hasTags = post.tags.length > 0;
+  const hasTags = post.tags.length >= 0;
   // eslint-disable-next-line no-magic-numbers
   const showToC = post.headings.length > 1;

[NoCoverage] ConditionalExpression
components/pages/blog/BlogPost.tsx:30:19
   // eslint-disable-next-line no-magic-numbers
   const hasTags = post.tags.length > 0;
   // eslint-disable-next-line no-magic-numbers
-  const showToC = post.headings.length > 1;
+  const showToC = false;
   const showDraftSuffix = BlogConfig.SHOW_DRAFTS_BADGE && post.draft;
   const draftSuffix = showDraftSuffix ? ' (' + scopedT('draft') + ')' : undefined;

[NoCoverage] EqualityOperator
components/pages/blog/BlogPost.tsx:30:19
   // eslint-disable-next-line no-magic-numbers
   const hasTags = post.tags.length > 0;
   // eslint-disable-next-line no-magic-numbers
-  const showToC = post.headings.length > 1;
+  const showToC = post.headings.length <= 1;
   const showDraftSuffix = BlogConfig.SHOW_DRAFTS_BADGE && post.draft;
   const draftSuffix = showDraftSuffix ? ' (' + scopedT('draft') + ')' : undefined;

[NoCoverage] ConditionalExpression
components/pages/blog/BlogPost.tsx:31:27
   const hasTags = post.tags.length > 0;
   // eslint-disable-next-line no-magic-numbers
   const showToC = post.headings.length > 1;
-  const showDraftSuffix = BlogConfig.SHOW_DRAFTS_BADGE && post.draft;
+  const showDraftSuffix = true;
   const draftSuffix = showDraftSuffix ? ' (' + scopedT('draft') + ')' : undefined;
 

[NoCoverage] ConditionalExpression
components/pages/blog/BlogPost.tsx:31:27
   const hasTags = post.tags.length > 0;
   // eslint-disable-next-line no-magic-numbers
   const showToC = post.headings.length > 1;
-  const showDraftSuffix = BlogConfig.SHOW_DRAFTS_BADGE && post.draft;
+  const showDraftSuffix = false;
   const draftSuffix = showDraftSuffix ? ' (' + scopedT('draft') + ')' : undefined;
 

[NoCoverage] ConditionalExpression
components/pages/blog/BlogPost.tsx:39:10
       <header className="my-2 p-2 text-center">
         <h1>{post.title}</h1>
         <BlogPostDate suffix={draftSuffix} language={language} date={post.date} />
-        {hasTags && (
-          <div className="mt-1 flex flex-wrap justify-center gap-2 md:mx-auto md:w-fit md:justify-normal">
-            {tagsGenerator({ ...post, scopedT: scopedT2 })}
-          </div>
-        )}
+        {false}
       </header>
       <div className="flex max-w-full flex-col lg:flex-row">

[NoCoverage] LogicalOperator
components/pages/blog/BlogPost.tsx:39:10
       <header className="my-2 p-2 text-center">
         <h1>{post.title}</h1>
         <BlogPostDate suffix={draftSuffix} language={language} date={post.date} />
-        {hasTags && (
-          <div className="mt-1 flex flex-wrap justify-center gap-2 md:mx-auto md:w-fit md:justify-normal">
-            {tagsGenerator({ ...post, scopedT: scopedT2 })}
-          </div>
-        )}
+        {hasTags || <div className="mt-1 flex flex-wrap justify-center gap-2 md:mx-auto md:w-fit md:justify-normal">
+            {tagsGenerator({
+    ...post,
+    scopedT: scopedT2
+  })}
+          </div>}
       </header>
       <div className="flex max-w-full flex-col lg:flex-row">

[NoCoverage] ConditionalExpression
components/pages/blog/BlogPost.tsx:46:10
         )}
       </header>
       <div className="flex max-w-full flex-col lg:flex-row">
-        {showToC && <BlogPostTocMobile headings={post.headings} />}
+        {true}
         <BlogPostMDX code={post.body.code} />
         {showToC && <BlogPostTocDesktop headings={post.headings} />}

[NoCoverage] ConditionalExpression
components/pages/blog/BlogPost.tsx:46:10
         )}
       </header>
       <div className="flex max-w-full flex-col lg:flex-row">
-        {showToC && <BlogPostTocMobile headings={post.headings} />}
+        {false}
         <BlogPostMDX code={post.body.code} />
         {showToC && <BlogPostTocDesktop headings={post.headings} />}

[NoCoverage] ConditionalExpression
components/pages/blog/BlogPost.tsx:48:10
       <div className="flex max-w-full flex-col lg:flex-row">
         {showToC && <BlogPostTocMobile headings={post.headings} />}
         <BlogPostMDX code={post.body.code} />
-        {showToC && <BlogPostTocDesktop headings={post.headings} />}
+        {false}
       </div>
     </section>

[NoCoverage] ConditionalExpression
components/pages/blog/BlogPost.tsx:48:10
       <div className="flex max-w-full flex-col lg:flex-row">
         {showToC && <BlogPostTocMobile headings={post.headings} />}
         <BlogPostMDX code={post.body.code} />
-        {showToC && <BlogPostTocDesktop headings={post.headings} />}
+        {true}
       </div>
     </section>

[NoCoverage] BooleanLiteral
components/pages/blog/BlogPost.tsx:58:7
   const [category, subcategory, language] = [params[BlogTaxonomy.CATEGORY], params[BlogTaxonomy.SUBCATEGORY], params[I18nTaxonomy.LANGUAGE]];
 
   const isValidPair: boolean = await isValidBlogCategoryAndSubcategoryPair(category, subcategory, language);
-  if (!isValidPair) notFound();
+  if (isValidPair) notFound();
 
   const slug = params[BlogTaxonomy.SLUG];

[NoCoverage] ConditionalExpression
components/pages/blog/BlogPost.tsx:58:7
   const [category, subcategory, language] = [params[BlogTaxonomy.CATEGORY], params[BlogTaxonomy.SUBCATEGORY], params[I18nTaxonomy.LANGUAGE]];
 
   const isValidPair: boolean = await isValidBlogCategoryAndSubcategoryPair(category, subcategory, language);
-  if (!isValidPair) notFound();
+  if (false) notFound();
 
   const slug = params[BlogTaxonomy.SLUG];
