[NoCoverage] ConditionalExpression
components/pages/blog/CategoryRelatedSubcategoriesAndBlogPosts.tsx:25:71
   const getBlogPostsWithAllowedDraftsCtx = (postsCollection: BlogPostType[]): BlogPostType[] =>
     ComputedBlogCtx.TESTING
       ? postsCollection
-      : postsCollection.filter(({ category: currentPostCategory }) => currentPostCategory !== BlogConfig.TESTING_CATEGORY);
+      : postsCollection.filter(({ category: currentPostCategory }) => true);
 
   const getBlogPostsWithDisallowedDraftsCtx = (postsCollection: BlogPostType[]): BlogPostType[] =>

[NoCoverage] ArrowFunction
components/pages/blog/CategoryRelatedSubcategoriesAndBlogPosts.tsx:25:32
   const getBlogPostsWithAllowedDraftsCtx = (postsCollection: BlogPostType[]): BlogPostType[] =>
     ComputedBlogCtx.TESTING
       ? postsCollection
-      : postsCollection.filter(({ category: currentPostCategory }) => currentPostCategory !== BlogConfig.TESTING_CATEGORY);
+      : postsCollection.filter(() => undefined);
 
   const getBlogPostsWithDisallowedDraftsCtx = (postsCollection: BlogPostType[]): BlogPostType[] =>

[NoCoverage] ArrowFunction
components/pages/blog/CategoryRelatedSubcategoriesAndBlogPosts.tsx:29:32
 
   const getBlogPostsWithDisallowedDraftsCtx = (postsCollection: BlogPostType[]): BlogPostType[] =>
     ComputedBlogCtx.TESTING
-      ? postsCollection.filter(({ draft: currentPostDraft }) => !currentPostDraft)
+      ? postsCollection.filter(() => undefined)
       : postsCollection.filter(
           ({ category: currentPostCategory, draft: currentPostDraft }) => currentPostCategory !== BlogConfig.TESTING_CATEGORY && !currentPostDraft

[NoCoverage] MethodExpression
components/pages/blog/CategoryRelatedSubcategoriesAndBlogPosts.tsx:29:9
 
   const getBlogPostsWithDisallowedDraftsCtx = (postsCollection: BlogPostType[]): BlogPostType[] =>
     ComputedBlogCtx.TESTING
-      ? postsCollection.filter(({ draft: currentPostDraft }) => !currentPostDraft)
+      ? postsCollection
       : postsCollection.filter(
           ({ category: currentPostCategory, draft: currentPostDraft }) => currentPostCategory !== BlogConfig.TESTING_CATEGORY && !currentPostDraft

[NoCoverage] MethodExpression
components/pages/blog/CategoryRelatedSubcategoriesAndBlogPosts.tsx:30:9
   const getBlogPostsWithDisallowedDraftsCtx = (postsCollection: BlogPostType[]): BlogPostType[] =>
     ComputedBlogCtx.TESTING
       ? postsCollection.filter(({ draft: currentPostDraft }) => !currentPostDraft)
-      : postsCollection.filter(
-          ({ category: currentPostCategory, draft: currentPostDraft }) => currentPostCategory !== BlogConfig.TESTING_CATEGORY && !currentPostDraft
-        );
+      : postsCollection;
 
   const postsCollection = await getAllBlogPostsByCategory(category);

[NoCoverage] ConditionalExpression
components/pages/blog/CategoryRelatedSubcategoriesAndBlogPosts.tsx:31:75
     ComputedBlogCtx.TESTING
       ? postsCollection.filter(({ draft: currentPostDraft }) => !currentPostDraft)
       : postsCollection.filter(
-          ({ category: currentPostCategory, draft: currentPostDraft }) => currentPostCategory !== BlogConfig.TESTING_CATEGORY && !currentPostDraft
+          ({ category: currentPostCategory, draft: currentPostDraft }) => false
         );
 

[NoCoverage] LogicalOperator
components/pages/blog/CategoryRelatedSubcategoriesAndBlogPosts.tsx:31:75
     ComputedBlogCtx.TESTING
       ? postsCollection.filter(({ draft: currentPostDraft }) => !currentPostDraft)
       : postsCollection.filter(
-          ({ category: currentPostCategory, draft: currentPostDraft }) => currentPostCategory !== BlogConfig.TESTING_CATEGORY && !currentPostDraft
+          ({ category: currentPostCategory, draft: currentPostDraft }) => currentPostCategory !== BlogConfig.TESTING_CATEGORY || !currentPostDraft
         );
 

[NoCoverage] MethodExpression
components/pages/blog/CategoryRelatedSubcategoriesAndBlogPosts.tsx:41:17
     ? getBlogPostsWithAllowedDraftsCtx(postsCollection)
     : getBlogPostsWithDisallowedDraftsCtx(postsCollection);
 
-  const posts = gettedOnTheFlyPosts.sort((post1, post2) =>
-    BlogConfig.DEFAULT_COMPARE_FUNCTION_USED_TO_SORT_POSTS_ON_BLOG_CATEGORY_PAGE(new Date(post1.date), new Date(post2.date))
-  );
+  const posts = gettedOnTheFlyPosts;
 
   const content = await blogCategoryPageBuilder(posts, category, language);
