[NoCoverage] BooleanLiteral
components/pages/blog/FiltersSelectWidget.tsx:33:45
 }) => {
   const globalT = getClientSideI18n();
 
-  const [open, setOpen] = useState<boolean>(false);
+  const [open, setOpen] = useState<boolean>(true);
   const onOpenChange = (opened: boolean) => setOpen(opened);
 

[NoCoverage] ArrowFunction
components/pages/blog/FiltersSelectWidget.tsx:37:5
   const onOpenChange = (opened: boolean) => setOpen(opened);
 
   const selectItems = useMemo(
-    () =>
-      filtersAssoc.map((config, index) => (
-        <SelectItem
-          className={cn('max-lg:h-12', {
-            'hover:bg-accent active:pointer-events-none max-lg:pointer-events-none': index === selectedFilter
-          })}
-          key={`select-item-${index}`}
-          value={String(index)}
-        >
-          {globalT(config.i18nTitle)}
-        </SelectItem>
-      )),
+    () => undefined,
     [filtersAssoc, globalT, selectedFilter]
   );

[NoCoverage] ArrowFunction
components/pages/blog/FiltersSelectWidget.tsx:38:24
 
   const selectItems = useMemo(
     () =>
-      filtersAssoc.map((config, index) => (
-        <SelectItem
-          className={cn('max-lg:h-12', {
-            'hover:bg-accent active:pointer-events-none max-lg:pointer-events-none': index === selectedFilter
-          })}
-          key={`select-item-${index}`}
-          value={String(index)}
-        >
-          {globalT(config.i18nTitle)}
-        </SelectItem>
-      )),
+      filtersAssoc.map(() => undefined),
     [filtersAssoc, globalT, selectedFilter]
   );

[NoCoverage] StringLiteral
components/pages/blog/FiltersSelectWidget.tsx:40:25
     () =>
       filtersAssoc.map((config, index) => (
         <SelectItem
-          className={cn('max-lg:h-12', {
+          className={cn("", {
             'hover:bg-accent active:pointer-events-none max-lg:pointer-events-none': index === selectedFilter
           })}

[NoCoverage] ConditionalExpression
components/pages/blog/FiltersSelectWidget.tsx:41:86
       filtersAssoc.map((config, index) => (
         <SelectItem
           className={cn('max-lg:h-12', {
-            'hover:bg-accent active:pointer-events-none max-lg:pointer-events-none': index === selectedFilter
+            'hover:bg-accent active:pointer-events-none max-lg:pointer-events-none': true
           })}
           key={`select-item-${index}`}

[NoCoverage] EqualityOperator
components/pages/blog/FiltersSelectWidget.tsx:41:86
       filtersAssoc.map((config, index) => (
         <SelectItem
           className={cn('max-lg:h-12', {
-            'hover:bg-accent active:pointer-events-none max-lg:pointer-events-none': index === selectedFilter
+            'hover:bg-accent active:pointer-events-none max-lg:pointer-events-none': index !== selectedFilter
           })}
           key={`select-item-${index}`}

[NoCoverage] StringLiteral
components/pages/blog/FiltersSelectWidget.tsx:43:16
           className={cn('max-lg:h-12', {
             'hover:bg-accent active:pointer-events-none max-lg:pointer-events-none': index === selectedFilter
           })}
-          key={`select-item-${index}`}
+          key={``}
           value={String(index)}
         >

[NoCoverage] ArrayDeclaration
components/pages/blog/FiltersSelectWidget.tsx:49:5
           {globalT(config.i18nTitle)}
         </SelectItem>
       )),
-    [filtersAssoc, globalT, selectedFilter]
+    []
   );
 

[NoCoverage] BlockStatement
components/pages/blog/FiltersSelectWidget.tsx:54:41
 
   return (
     <Select
-      onValueChange={(value: string) => {
-        const filter = Number(value);
-
-        if (filter === selectedFilter) {
-          newSelectedFilter.current = null;
-        } else {
-          newSelectedFilter.current = filter;
-          setSelectedFilterSwitch(true);
-        }
-      }}
+      onValueChange={(value: string) => {}}
       onOpenChange={(isOpen: boolean) => onOpenChange(isOpen)}
       value={String(selectedFilter)}

[NoCoverage] BlockStatement
components/pages/blog/FiltersSelectWidget.tsx:57:40
       onValueChange={(value: string) => {
         const filter = Number(value);
 
-        if (filter === selectedFilter) {
-          newSelectedFilter.current = null;
-        } else {
+        if (filter === selectedFilter) {} else {
           newSelectedFilter.current = filter;
           setSelectedFilterSwitch(true);

[NoCoverage] EqualityOperator
components/pages/blog/FiltersSelectWidget.tsx:57:13
       onValueChange={(value: string) => {
         const filter = Number(value);
 
-        if (filter === selectedFilter) {
+        if (filter !== selectedFilter) {
           newSelectedFilter.current = null;
         } else {

[NoCoverage] BlockStatement
components/pages/blog/FiltersSelectWidget.tsx:59:16
 
         if (filter === selectedFilter) {
           newSelectedFilter.current = null;
-        } else {
-          newSelectedFilter.current = filter;
-          setSelectedFilterSwitch(true);
-        }
+        } else {}
       }}
       onOpenChange={(isOpen: boolean) => onOpenChange(isOpen)}

[NoCoverage] BooleanLiteral
components/pages/blog/FiltersSelectWidget.tsx:61:35
           newSelectedFilter.current = null;
         } else {
           newSelectedFilter.current = filter;
-          setSelectedFilterSwitch(true);
+          setSelectedFilterSwitch(false);
         }
       }}

[NoCoverage] ArrowFunction
components/pages/blog/FiltersSelectWidget.tsx:64:21
           setSelectedFilterSwitch(true);
         }
       }}
-      onOpenChange={(isOpen: boolean) => onOpenChange(isOpen)}
+      onOpenChange={() => undefined}
       value={String(selectedFilter)}
       open={open}

[NoCoverage] ObjectLiteral
components/pages/blog/FiltersSelectWidget.tsx:69:54
       open={open}
     >
       <SelectTrigger
-        chevronClassName={cn('transition-transform', {
-          'ltr:-rotate-180 rtl:rotate-180': open
-        })}
+        chevronClassName={cn('transition-transform', {})}
         className={cn('mx-[2px] min-w-[124px] lg:min-w-[176px]', triggerClassName)}
         aria-label={globalT(`${i18ns.filters}.select-a-filter`)}
