[NoCoverage] ArithmeticOperator
components/pages/blog/PaginationWidget.tsx:28:66
   const isLargeScreen = useIsLargeScreen();
 
   // eslint-disable-next-line no-magic-numbers
-  const prevBtnPageId = useMemo(() => Math.max(FIRST_PAGE_PARAM, currentPage - 1), [currentPage]);
+  const prevBtnPageId = useMemo(() => Math.max(FIRST_PAGE_PARAM, currentPage + 1), [currentPage]);
   // eslint-disable-next-line no-magic-numbers
   const nextBtnPageId = useMemo(() => Math.min(pagesAmount, currentPage + 1), [pagesAmount, currentPage]);

[NoCoverage] MethodExpression
components/pages/blog/PaginationWidget.tsx:28:39
   const isLargeScreen = useIsLargeScreen();
 
   // eslint-disable-next-line no-magic-numbers
-  const prevBtnPageId = useMemo(() => Math.max(FIRST_PAGE_PARAM, currentPage - 1), [currentPage]);
+  const prevBtnPageId = useMemo(() => Math.min(FIRST_PAGE_PARAM, currentPage - 1), [currentPage]);
   // eslint-disable-next-line no-magic-numbers
   const nextBtnPageId = useMemo(() => Math.min(pagesAmount, currentPage + 1), [pagesAmount, currentPage]);

[NoCoverage] ArithmeticOperator
components/pages/blog/PaginationWidget.tsx:30:61
   // eslint-disable-next-line no-magic-numbers
   const prevBtnPageId = useMemo(() => Math.max(FIRST_PAGE_PARAM, currentPage - 1), [currentPage]);
   // eslint-disable-next-line no-magic-numbers
-  const nextBtnPageId = useMemo(() => Math.min(pagesAmount, currentPage + 1), [pagesAmount, currentPage]);
+  const nextBtnPageId = useMemo(() => Math.min(pagesAmount, currentPage - 1), [pagesAmount, currentPage]);
 
   const buildPaginationItems = useCallback(

[NoCoverage] MethodExpression
components/pages/blog/PaginationWidget.tsx:30:39
   // eslint-disable-next-line no-magic-numbers
   const prevBtnPageId = useMemo(() => Math.max(FIRST_PAGE_PARAM, currentPage - 1), [currentPage]);
   // eslint-disable-next-line no-magic-numbers
-  const nextBtnPageId = useMemo(() => Math.min(pagesAmount, currentPage + 1), [pagesAmount, currentPage]);
+  const nextBtnPageId = useMemo(() => Math.max(pagesAmount, currentPage + 1), [pagesAmount, currentPage]);
 
   const buildPaginationItems = useCallback(

[NoCoverage] ArrowFunction
components/pages/blog/PaginationWidget.tsx:33:5
   const nextBtnPageId = useMemo(() => Math.min(pagesAmount, currentPage + 1), [pagesAmount, currentPage]);
 
   const buildPaginationItems = useCallback(
-    () => doBuildPaginationItems(currentPage, pagesAmount, pathname, searchParams, isLargeScreen, PAGE_KEY),
+    () => undefined,
     [pagesAmount, currentPage, pathname, searchParams, isLargeScreen]
   );

[NoCoverage] ArrayDeclaration
components/pages/blog/PaginationWidget.tsx:34:5
 
   const buildPaginationItems = useCallback(
     () => doBuildPaginationItems(currentPage, pagesAmount, pathname, searchParams, isLargeScreen, PAGE_KEY),
-    [pagesAmount, currentPage, pathname, searchParams, isLargeScreen]
+    []
   );
 

[NoCoverage] ConditionalExpression
components/pages/blog/PaginationWidget.tsx:38:7
   );
 
   // eslint-disable-next-line no-magic-numbers
-  if (pagesAmount <= 1) return null;
+  if (false) return null;
 
   const previousBtn = buildPreviousBtn(prevBtnPageId, pathname, searchParams, currentPage, PAGE_KEY);

[NoCoverage] EqualityOperator
components/pages/blog/PaginationWidget.tsx:38:7
   );
 
   // eslint-disable-next-line no-magic-numbers
-  if (pagesAmount <= 1) return null;
+  if (pagesAmount < 1) return null;
 
   const previousBtn = buildPreviousBtn(prevBtnPageId, pathname, searchParams, currentPage, PAGE_KEY);
