[NoCoverage] BooleanLiteral
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:56:77
 
   const selectedTagsIds = useMemo(() => getUnpackedAndSanitizedFilters(searchParams, expectedTagsIds, TAGS_KEY), [searchParams, expectedTagsIds]);
 
-  const [selectedFilterSwitch, setSelectedFilterSwitch] = useState<boolean>(false);
+  const [selectedFilterSwitch, setSelectedFilterSwitch] = useState<boolean>(true);
   const [selectedTagSwitch, setSelectedTagSwitch] = useState<ETagsSwitch>(ETagsSwitch.OFF);
 

[NoCoverage] ArrayDeclaration
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:61:5
 
   const getMaybeFilteredPostsCollection = useCallback(
     () => doGetMaybeFilteredPostsCollection(selectedTagsIds, postsCollection),
-    [postsCollection, selectedTagsIds]
+    []
   );
 

[NoCoverage] ArrayDeclaration
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:64:89
     [postsCollection, selectedTagsIds]
   );
 
-  const maybeFilteredPostsCollection = useMemo(() => getMaybeFilteredPostsCollection(), [getMaybeFilteredPostsCollection]);
+  const maybeFilteredPostsCollection = useMemo(() => getMaybeFilteredPostsCollection(), []);
 
   const computePaginatedElements = useCallback(

[NoCoverage] ArrayDeclaration
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:68:5
 
   const computePaginatedElements = useCallback(
     () => doComputePaginatedElements(selectedFilter, maybeFilteredPostsCollection),
-    [maybeFilteredPostsCollection, selectedFilter]
+    []
   );
 

[NoCoverage] ArrowFunction
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:76:5
   const currentPage = useMemo(() => getSanitizedCurrentPage(searchParams, pagesAmount, PAGE_KEY), [pagesAmount, searchParams]);
 
   const paginated = useMemo(
-    () => <PaginatedElements paginatedElements={paginatedElements} elementsPerPage={elementsPerPage} currentPage={currentPage} />,
+    () => undefined,
     [paginatedElements, elementsPerPage, currentPage]
   );

[NoCoverage] BlockStatement
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:84:19
   const newSelectedTagsIds = useRef<MaybeNull<Id[]>>(null);
   const memorizedPageBeforeFiltering = useRef<MaybeNull<Id>>(null);
 
-  useEffect(() => {
-    if (!selectedFilterSwitch || newSelectedFilter.current === null) return;
-
-    const slice = getPaginatedElementsCurrentSlice(currentPage, elementsPerPage, paginatedElements);
-
-    const keys: ReactElementKey[] = [];
-    for (const element of slice) if (element.key) keys.push(element.key);
-
-    const toSorted = getSortedPostsCollection(newSelectedFilter.current, maybeFilteredPostsCollection);
-
-    const newPageIndex = computeReconciliatedPageIndex(keys, toSorted, elementsPerPage);
-    const q = createURLSearchParams({ [FILTERS_KEY]: newSelectedFilter.current, [PAGE_KEY]: newPageIndex }, searchParams);
-
-    newSelectedFilter.current = null;
-
-    router.replace(q, { scroll: false });
-    setSelectedFilterSwitch(false);
-  }, [selectedFilterSwitch, currentPage, elementsPerPage, maybeFilteredPostsCollection, paginatedElements, router, searchParams]);
+  useEffect(() => {}, [selectedFilterSwitch, currentPage, elementsPerPage, maybeFilteredPostsCollection, paginatedElements, router, searchParams]);
 
   useEffect(() => {

[NoCoverage] BooleanLiteral
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:85:9
   const memorizedPageBeforeFiltering = useRef<MaybeNull<Id>>(null);
 
   useEffect(() => {
-    if (!selectedFilterSwitch || newSelectedFilter.current === null) return;
+    if (selectedFilterSwitch || newSelectedFilter.current === null) return;
 
     const slice = getPaginatedElementsCurrentSlice(currentPage, elementsPerPage, paginatedElements);

[NoCoverage] BooleanLiteral
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:99:33
 
     newSelectedFilter.current = null;
 
-    router.replace(q, { scroll: false });
+    router.replace(q, { scroll: true });
     setSelectedFilterSwitch(false);
   }, [selectedFilterSwitch, currentPage, elementsPerPage, maybeFilteredPostsCollection, paginatedElements, router, searchParams]);

[NoCoverage] ObjectLiteral
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:99:23
 
     newSelectedFilter.current = null;
 
-    router.replace(q, { scroll: false });
+    router.replace(q, {});
     setSelectedFilterSwitch(false);
   }, [selectedFilterSwitch, currentPage, elementsPerPage, maybeFilteredPostsCollection, paginatedElements, router, searchParams]);

[NoCoverage] BooleanLiteral
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:100:29
     newSelectedFilter.current = null;
 
     router.replace(q, { scroll: false });
-    setSelectedFilterSwitch(false);
+    setSelectedFilterSwitch(true);
   }, [selectedFilterSwitch, currentPage, elementsPerPage, maybeFilteredPostsCollection, paginatedElements, router, searchParams]);
 

[NoCoverage] BlockStatement
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:114:65
     const toMaybeFiltered = doGetMaybeFilteredPostsCollection(newSelectedTagsIds.current, postsCollection);
     const toSorted = getSortedPostsCollection(selectedFilter, toMaybeFiltered);
 
-    function handleSelecting(__newSelectedTagsIds: BlogTagId[]) {
-      const newPageIndex = computeReconciliatedPageIndex(keys, toSorted, elementsPerPage);
-
-      const packedTagsIds = packIds(__newSelectedTagsIds);
-      const q = createURLSearchParams({ [TAGS_KEY]: packedTagsIds, [PAGE_KEY]: newPageIndex }, searchParams);
-
-      newSelectedTagsIds.current = null;
-
-      router.replace(q, { scroll: false });
-    }
+    function handleSelecting(__newSelectedTagsIds: BlogTagId[]) {}
 
     function handleUnselecting(__newSelectedTagsIds: BlogTagId[]) {

[NoCoverage] ObjectLiteral
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:118:39
       const newPageIndex = computeReconciliatedPageIndex(keys, toSorted, elementsPerPage);
 
       const packedTagsIds = packIds(__newSelectedTagsIds);
-      const q = createURLSearchParams({ [TAGS_KEY]: packedTagsIds, [PAGE_KEY]: newPageIndex }, searchParams);
+      const q = createURLSearchParams({}, searchParams);
 
       newSelectedTagsIds.current = null;

[NoCoverage] BlockStatement
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:125:67
       router.replace(q, { scroll: false });
     }
 
-    function handleUnselecting(__newSelectedTagsIds: BlogTagId[]) {
-      const newPaginatedElements = doComputePaginatedElements(selectedFilter, toMaybeFiltered);
-      const newSlice = getPaginatedElementsCurrentSlice(currentPage, elementsPerPage, newPaginatedElements);
-
-      const newKeys: ReactElementKey[] = [];
-      for (const element of newSlice) if (element.key) newKeys.push(element.key);
-
-      const firstCommonKey: MaybeNull<ReactElementKey> = keys.find((key) => newKeys.includes(key)) ?? null;
-      if (firstCommonKey === null) {
-        handleSelecting(__newSelectedTagsIds);
-        return;
-      }
-
-      const packedTagsIds = packIds(__newSelectedTagsIds);
-      const q = createURLSearchParams({ [TAGS_KEY]: packedTagsIds }, searchParams);
-
-      newSelectedTagsIds.current = null;
-
-      router.replace(q, { scroll: false });
-    }
+    function handleUnselecting(__newSelectedTagsIds: BlogTagId[]) {}
 
     function handleClearing(__newSelectedTagsIds: BlogTagId[]) {

[NoCoverage] ArrayDeclaration
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:129:42
       const newPaginatedElements = doComputePaginatedElements(selectedFilter, toMaybeFiltered);
       const newSlice = getPaginatedElementsCurrentSlice(currentPage, elementsPerPage, newPaginatedElements);
 
-      const newKeys: ReactElementKey[] = [];
+      const newKeys: ReactElementKey[] = ["Stryker was here"];
       for (const element of newSlice) if (element.key) newKeys.push(element.key);
 

[NoCoverage] ArrowFunction
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:132:68
       const newKeys: ReactElementKey[] = [];
       for (const element of newSlice) if (element.key) newKeys.push(element.key);
 
-      const firstCommonKey: MaybeNull<ReactElementKey> = keys.find((key) => newKeys.includes(key)) ?? null;
+      const firstCommonKey: MaybeNull<ReactElementKey> = keys.find(() => undefined) ?? null;
       if (firstCommonKey === null) {
         handleSelecting(__newSelectedTagsIds);

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:133:11
       for (const element of newSlice) if (element.key) newKeys.push(element.key);
 
       const firstCommonKey: MaybeNull<ReactElementKey> = keys.find((key) => newKeys.includes(key)) ?? null;
-      if (firstCommonKey === null) {
+      if (false) {
         handleSelecting(__newSelectedTagsIds);
         return;

[NoCoverage] BlockStatement
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:133:36
       for (const element of newSlice) if (element.key) newKeys.push(element.key);
 
       const firstCommonKey: MaybeNull<ReactElementKey> = keys.find((key) => newKeys.includes(key)) ?? null;
-      if (firstCommonKey === null) {
-        handleSelecting(__newSelectedTagsIds);
-        return;
-      }
+      if (firstCommonKey === null) {}
 
       const packedTagsIds = packIds(__newSelectedTagsIds);

[NoCoverage] BlockStatement
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:146:64
       router.replace(q, { scroll: false });
     }
 
-    function handleClearing(__newSelectedTagsIds: BlogTagId[]) {
-      if (memorizedPageBeforeFiltering.current === null) {
-        handleUnselecting(__newSelectedTagsIds);
-        return;
-      }
-
-      const q = createURLSearchParams({ [PAGE_KEY]: memorizedPageBeforeFiltering.current, [TAGS_KEY]: null }, searchParams);
-
-      router.replace(q, { scroll: false });
-    }
+    function handleClearing(__newSelectedTagsIds: BlogTagId[]) {}
 
     const handlers = {

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:147:11
     }
 
     function handleClearing(__newSelectedTagsIds: BlogTagId[]) {
-      if (memorizedPageBeforeFiltering.current === null) {
+      if (true) {
         handleUnselecting(__newSelectedTagsIds);
         return;

[NoCoverage] BlockStatement
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:147:58
     }
 
     function handleClearing(__newSelectedTagsIds: BlogTagId[]) {
-      if (memorizedPageBeforeFiltering.current === null) {
-        handleUnselecting(__newSelectedTagsIds);
-        return;
-      }
+      if (memorizedPageBeforeFiltering.current === null) {}
 
       const q = createURLSearchParams({ [PAGE_KEY]: memorizedPageBeforeFiltering.current, [TAGS_KEY]: null }, searchParams);

[NoCoverage] ArrayDeclaration
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:165:6
 
     handlers[selectedTagSwitch](newSelectedTagsIds.current);
     setSelectedTagSwitch(ETagsSwitch.OFF);
-  }, [selectedTagSwitch, currentPage, elementsPerPage, paginatedElements, postsCollection, selectedFilter, selectedTagsIds, router, searchParams]);
+  }, []);
 
   useEffect(() => {

[NoCoverage] BlockStatement
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:167:19
     setSelectedTagSwitch(ETagsSwitch.OFF);
   }, [selectedTagSwitch, currentPage, elementsPerPage, paginatedElements, postsCollection, selectedFilter, selectedTagsIds, router, searchParams]);
 
-  useEffect(() => {
-    // eslint-disable-next-line no-magic-numbers
-    if (selectedTagsIds.length !== 0) return;
-    memorizedPageBeforeFiltering.current = getSanitizedCurrentPage(searchParams, pagesAmount, PAGE_KEY);
-  }, [searchParams, selectedTagsIds, pagesAmount]);
+  useEffect(() => {}, [searchParams, selectedTagsIds, pagesAmount]);
 
   const showTopToolbar = shouldShowTopToolbar(postsCollection);

[NoCoverage] EqualityOperator
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:169:9
 
   useEffect(() => {
     // eslint-disable-next-line no-magic-numbers
-    if (selectedTagsIds.length !== 0) return;
+    if (selectedTagsIds.length === 0) return;
     memorizedPageBeforeFiltering.current = getSanitizedCurrentPage(searchParams, pagesAmount, PAGE_KEY);
   }, [searchParams, selectedTagsIds, pagesAmount]);

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:169:9
 
   useEffect(() => {
     // eslint-disable-next-line no-magic-numbers
-    if (selectedTagsIds.length !== 0) return;
+    if (true) return;
     memorizedPageBeforeFiltering.current = getSanitizedCurrentPage(searchParams, pagesAmount, PAGE_KEY);
   }, [searchParams, selectedTagsIds, pagesAmount]);

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:179:8
   return (
     <section className="w-full">
       <h1 className="mb-2 ltr:text-left rtl:text-right">{title}</h1>
-      {showTopToolbar && (
-        <SubcategoryRelatedBlogPostsClientToolbar
-          filtersAssoc={BlogConfigClient.COMPARE_FUNCTIONS_USED_TO_SORT_POSTS_ON_BLOG_SUBCATEGORY_PAGE}
-          memorizedPageBeforeFiltering={memorizedPageBeforeFiltering}
-          setSelectedFilterSwitch={setSelectedFilterSwitch}
-          setSelectedTagSwitch={setSelectedTagSwitch}
-          newSelectedTagsIds={newSelectedTagsIds}
-          postsAmount={paginatedElements.length}
-          newSelectedFilter={newSelectedFilter}
-          selectedTagsIds={selectedTagsIds}
-          selectedFilter={selectedFilter}
-          currentPage={currentPage}
-          pagesAmount={pagesAmount}
-          tags={tags}
-        />
-      )}
+      {false}
       {/* {ToDo} https://github.com/Tirraa/dashboard_rtm/issues/126 */}
       <div className="mb-4 flex min-w-full flex-col [&>article:not(:last-of-type)]:mb-6">{paginated}</div>

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:179:8
   return (
     <section className="w-full">
       <h1 className="mb-2 ltr:text-left rtl:text-right">{title}</h1>
-      {showTopToolbar && (
-        <SubcategoryRelatedBlogPostsClientToolbar
-          filtersAssoc={BlogConfigClient.COMPARE_FUNCTIONS_USED_TO_SORT_POSTS_ON_BLOG_SUBCATEGORY_PAGE}
-          memorizedPageBeforeFiltering={memorizedPageBeforeFiltering}
-          setSelectedFilterSwitch={setSelectedFilterSwitch}
-          setSelectedTagSwitch={setSelectedTagSwitch}
-          newSelectedTagsIds={newSelectedTagsIds}
-          postsAmount={paginatedElements.length}
-          newSelectedFilter={newSelectedFilter}
-          selectedTagsIds={selectedTagsIds}
-          selectedFilter={selectedFilter}
-          currentPage={currentPage}
-          pagesAmount={pagesAmount}
-          tags={tags}
-        />
-      )}
+      {true}
       {/* {ToDo} https://github.com/Tirraa/dashboard_rtm/issues/126 */}
       <div className="mb-4 flex min-w-full flex-col [&>article:not(:last-of-type)]:mb-6">{paginated}</div>

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:197:8
       )}
       {/* {ToDo} https://github.com/Tirraa/dashboard_rtm/issues/126 */}
       <div className="mb-4 flex min-w-full flex-col [&>article:not(:last-of-type)]:mb-6">{paginated}</div>
-      {showBottomToolbar && (
-        <SubcategoryRelatedBlogPostsClientToolbar
-          filtersAssoc={BlogConfigClient.COMPARE_FUNCTIONS_USED_TO_SORT_POSTS_ON_BLOG_SUBCATEGORY_PAGE}
-          memorizedPageBeforeFiltering={memorizedPageBeforeFiltering}
-          setSelectedFilterSwitch={setSelectedFilterSwitch}
-          setSelectedTagSwitch={setSelectedTagSwitch}
-          newSelectedTagsIds={newSelectedTagsIds}
-          postsAmount={paginatedElements.length}
-          newSelectedFilter={newSelectedFilter}
-          selectedTagsIds={selectedTagsIds}
-          selectedFilter={selectedFilter}
-          currentPage={currentPage}
-          pagesAmount={pagesAmount}
-          isBottomWidget
-          tags={tags}
-        />
-      )}
+      {false}
     </section>
   );

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/Client.tsx:197:8
       )}
       {/* {ToDo} https://github.com/Tirraa/dashboard_rtm/issues/126 */}
       <div className="mb-4 flex min-w-full flex-col [&>article:not(:last-of-type)]:mb-6">{paginated}</div>
-      {showBottomToolbar && (
-        <SubcategoryRelatedBlogPostsClientToolbar
-          filtersAssoc={BlogConfigClient.COMPARE_FUNCTIONS_USED_TO_SORT_POSTS_ON_BLOG_SUBCATEGORY_PAGE}
-          memorizedPageBeforeFiltering={memorizedPageBeforeFiltering}
-          setSelectedFilterSwitch={setSelectedFilterSwitch}
-          setSelectedTagSwitch={setSelectedTagSwitch}
-          newSelectedTagsIds={newSelectedTagsIds}
-          postsAmount={paginatedElements.length}
-          newSelectedFilter={newSelectedFilter}
-          selectedTagsIds={selectedTagsIds}
-          selectedFilter={selectedFilter}
-          currentPage={currentPage}
-          pagesAmount={pagesAmount}
-          isBottomWidget
-          tags={tags}
-        />
-      )}
+      {true}
     </section>
   );
