[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/Server.tsx:26:7
   const [category, subcategory, language] = [params[BlogTaxonomy.CATEGORY], params[BlogTaxonomy.SUBCATEGORY], params[I18nTaxonomy.LANGUAGE]];
 
   const isValidPair: boolean = await isValidBlogCategoryAndSubcategoryPairInAnyLanguage(category, subcategory);
-  if (!isValidPair) notFound();
+  if (false) notFound();
 
   const postsCollection: BlogPostPreviewComponentWithMetadatas[] = (

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/Server.tsx:26:7
   const [category, subcategory, language] = [params[BlogTaxonomy.CATEGORY], params[BlogTaxonomy.SUBCATEGORY], params[I18nTaxonomy.LANGUAGE]];
 
   const isValidPair: boolean = await isValidBlogCategoryAndSubcategoryPairInAnyLanguage(category, subcategory);
-  if (!isValidPair) notFound();
+  if (true) notFound();
 
   const postsCollection: BlogPostPreviewComponentWithMetadatas[] = (

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/Server.tsx:40:7
     _id: post._id
   }));
 
-  if (blogSubcategoryShouldTriggerNotFound(postsCollection)) notFound();
+  if (true) notFound();
   // eslint-disable-next-line no-magic-numbers
   else if (postsCollection.length === 0) return <BlogPostsNotFound />;

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/Server.tsx:40:7
     _id: post._id
   }));
 
-  if (blogSubcategoryShouldTriggerNotFound(postsCollection)) notFound();
+  if (false) notFound();
   // eslint-disable-next-line no-magic-numbers
   else if (postsCollection.length === 0) return <BlogPostsNotFound />;

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/Server.tsx:42:12
 
   if (blogSubcategoryShouldTriggerNotFound(postsCollection)) notFound();
   // eslint-disable-next-line no-magic-numbers
-  else if (postsCollection.length === 0) return <BlogPostsNotFound />;
+  else if (false) return <BlogPostsNotFound />;
 
   const tags = Array.from(

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/Server.tsx:42:12
 
   if (blogSubcategoryShouldTriggerNotFound(postsCollection)) notFound();
   // eslint-disable-next-line no-magic-numbers
-  else if (postsCollection.length === 0) return <BlogPostsNotFound />;
+  else if (true) return <BlogPostsNotFound />;
 
   const tags = Array.from(

[NoCoverage] ArrowFunction
pages/blog/SubcategoryRelatedBlogPosts/Server.tsx:45:45
   else if (postsCollection.length === 0) return <BlogPostsNotFound />;
 
   const tags = Array.from(
-    new Set<BlogTag>(postsCollection.reduce((accumulator, currentValue) => accumulator.concat(currentValue.tags), [] as BlogTag[]))
+    new Set<BlogTag>(postsCollection.reduce(() => undefined, [] as BlogTag[]))
   );
 
