[NoCoverage] StringLiteral
pages/blog/SubcategoryRelatedBlogPosts/Toolbar.tsx:19:66
   const margin = 'my-4';
 
   const bottomWidgetPlaceholder = <div className={cn(margin, 'min-h-[40px]')} />;
-  const topWidgetTwoColsPlaceholder = <div className={cn(margin, 'min-h-[84px]')} />;
+  const topWidgetTwoColsPlaceholder = <div className={cn(margin, "")} />;
   const topWidgetOneColPlaceholder = <div className={cn(margin, 'min-h-[40px]')} />;
 

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/Toolbar.tsx:22:7
   const topWidgetTwoColsPlaceholder = <div className={cn(margin, 'min-h-[84px]')} />;
   const topWidgetOneColPlaceholder = <div className={cn(margin, 'min-h-[40px]')} />;
 
-  if (isBottomWidget) return bottomWidgetPlaceholder;
+  if (true) return bottomWidgetPlaceholder;
   // eslint-disable-next-line no-magic-numbers
   if (shouldShowPaginationWidget(pagesAmount)) return topWidgetTwoColsPlaceholder;

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/Toolbar.tsx:22:7
   const topWidgetTwoColsPlaceholder = <div className={cn(margin, 'min-h-[84px]')} />;
   const topWidgetOneColPlaceholder = <div className={cn(margin, 'min-h-[40px]')} />;
 
-  if (isBottomWidget) return bottomWidgetPlaceholder;
+  if (false) return bottomWidgetPlaceholder;
   // eslint-disable-next-line no-magic-numbers
   if (shouldShowPaginationWidget(pagesAmount)) return topWidgetTwoColsPlaceholder;

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/Toolbar.tsx:24:7
 
   if (isBottomWidget) return bottomWidgetPlaceholder;
   // eslint-disable-next-line no-magic-numbers
-  if (shouldShowPaginationWidget(pagesAmount)) return topWidgetTwoColsPlaceholder;
+  if (true) return topWidgetTwoColsPlaceholder;
   return topWidgetOneColPlaceholder;
 }

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/Toolbar.tsx:24:7
 
   if (isBottomWidget) return bottomWidgetPlaceholder;
   // eslint-disable-next-line no-magic-numbers
-  if (shouldShowPaginationWidget(pagesAmount)) return topWidgetTwoColsPlaceholder;
+  if (false) return topWidgetTwoColsPlaceholder;
   return topWidgetOneColPlaceholder;
 }

[NoCoverage] BlockStatement
pages/blog/SubcategoryRelatedBlogPosts/Toolbar.tsx:34:19
   const placeholder = buildPlaceholder(Boolean(isBottomWidget), pagesAmount);
 
   const [Component, setComponent] = useState<MaybeNull<FunctionComponent<SubcategoryRelatedBlogPostsClientToolbarInnerProps>>>(null);
-  useEffect(() => {
-    // eslint-disable-next-line promise/catch-or-return
-    import('@/components/pages/blog/SubcategoryRelatedBlogPosts/ToolbarInner').then((component) => setComponent(() => component.default));
-  }, []);
+  useEffect(() => {}, []);
   if (Component === null) return placeholder;
   return <Component {...props} />;

[NoCoverage] ArrowFunction
pages/blog/SubcategoryRelatedBlogPosts/Toolbar.tsx:36:85
   const [Component, setComponent] = useState<MaybeNull<FunctionComponent<SubcategoryRelatedBlogPostsClientToolbarInnerProps>>>(null);
   useEffect(() => {
     // eslint-disable-next-line promise/catch-or-return
-    import('@/components/pages/blog/SubcategoryRelatedBlogPosts/ToolbarInner').then((component) => setComponent(() => component.default));
+    import('@/components/pages/blog/SubcategoryRelatedBlogPosts/ToolbarInner').then(() => undefined);
   }, []);
   if (Component === null) return placeholder;

[NoCoverage] ArrowFunction
pages/blog/SubcategoryRelatedBlogPosts/Toolbar.tsx:36:113
   const [Component, setComponent] = useState<MaybeNull<FunctionComponent<SubcategoryRelatedBlogPostsClientToolbarInnerProps>>>(null);
   useEffect(() => {
     // eslint-disable-next-line promise/catch-or-return
-    import('@/components/pages/blog/SubcategoryRelatedBlogPosts/ToolbarInner').then((component) => setComponent(() => component.default));
+    import('@/components/pages/blog/SubcategoryRelatedBlogPosts/ToolbarInner').then((component) => setComponent(() => undefined));
   }, []);
   if (Component === null) return placeholder;
