[NoCoverage] BooleanLiteral
pages/blog/SubcategoryRelatedBlogPosts/ToolbarInner.tsx:39:39
   const searchParams = useSearchParams();
   const pathname = usePathname();
 
-  const leftWidgets: ReactElement[] = !isBottomWidget
+  const leftWidgets: ReactElement[] = isBottomWidget
     ? buildTopLeftWidgets({ memorizedPageBeforeFiltering, setSelectedTagSwitch, newSelectedTagsIds, selectedTagsIds, tags })
     : [];

[NoCoverage] BooleanLiteral
pages/blog/SubcategoryRelatedBlogPosts/ToolbarInner.tsx:43:24
     ? buildTopLeftWidgets({ memorizedPageBeforeFiltering, setSelectedTagSwitch, newSelectedTagsIds, selectedTagsIds, tags })
     : [];
 
-  const rightWidgets = !isBottomWidget
+  const rightWidgets = isBottomWidget
     ? buildTopRightWidgets(
         { pagesAmount, postsAmount, currentPage },

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/ToolbarInner.tsx:56:7
     : buildBottomRightWidgets(pathname, searchParams, { pagesAmount, currentPage });
 
   // eslint-disable-next-line no-magic-numbers
-  if (rightWidgets.length + leftWidgets.length <= 0) return null;
+  if (false) return null;
 
   return (

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/ToolbarInner.tsx:56:7
     : buildBottomRightWidgets(pathname, searchParams, { pagesAmount, currentPage });
 
   // eslint-disable-next-line no-magic-numbers
-  if (rightWidgets.length + leftWidgets.length <= 0) return null;
+  if (true) return null;
 
   return (

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/ToolbarInner.tsx:62:24
     <nav
       className={cn('my-4 flex items-end justify-between', {
         // eslint-disable-next-line no-magic-numbers
-        'justify-end': isBottomWidget || leftWidgets.length <= 0
+        'justify-end': true
       })}
     >

[NoCoverage] LogicalOperator
pages/blog/SubcategoryRelatedBlogPosts/ToolbarInner.tsx:62:24
     <nav
       className={cn('my-4 flex items-end justify-between', {
         // eslint-disable-next-line no-magic-numbers
-        'justify-end': isBottomWidget || leftWidgets.length <= 0
+        'justify-end': isBottomWidget && leftWidgets.length <= 0
       })}
     >

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/ToolbarInner.tsx:66:8
       })}
     >
       {/* eslint-disable-next-line no-magic-numbers */}
-      {leftWidgets.length > 0 && leftWidgets}
+      {true}
       {/* eslint-disable-next-line no-magic-numbers */}
       {rightWidgets.length > 0 && <div className="flex flex-col">{rightWidgets}</div>}

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/ToolbarInner.tsx:66:8
       })}
     >
       {/* eslint-disable-next-line no-magic-numbers */}
-      {leftWidgets.length > 0 && leftWidgets}
+      {true && leftWidgets}
       {/* eslint-disable-next-line no-magic-numbers */}
       {rightWidgets.length > 0 && <div className="flex flex-col">{rightWidgets}</div>}

[NoCoverage] LogicalOperator
pages/blog/SubcategoryRelatedBlogPosts/ToolbarInner.tsx:68:8
       {/* eslint-disable-next-line no-magic-numbers */}
       {leftWidgets.length > 0 && leftWidgets}
       {/* eslint-disable-next-line no-magic-numbers */}
-      {rightWidgets.length > 0 && <div className="flex flex-col">{rightWidgets}</div>}
+      {rightWidgets.length > 0 || <div className="flex flex-col">{rightWidgets}</div>}
     </nav>
   );

[NoCoverage] ConditionalExpression
pages/blog/SubcategoryRelatedBlogPosts/ToolbarInner.tsx:68:8
       {/* eslint-disable-next-line no-magic-numbers */}
       {leftWidgets.length > 0 && leftWidgets}
       {/* eslint-disable-next-line no-magic-numbers */}
-      {rightWidgets.length > 0 && <div className="flex flex-col">{rightWidgets}</div>}
+      {false}
     </nav>
   );
