[Killed] ConditionalExpression
SubcategoryRelatedBlogPosts/helpers/functions/shouldShowPaginationWidget.ts:4:72
 import type { Quantity } from '@rtm/shared-types/Numbers';
 
 // eslint-disable-next-line no-magic-numbers
-const shouldShowPaginationWidget = (pagesAmount: Quantity): boolean => pagesAmount > 1;
+const shouldShowPaginationWidget = (pagesAmount: Quantity): boolean => true;
 
 export default shouldShowPaginationWidget;
killedBy: buildTopRightWidgets should return empty list, given there is only one page and only one post
statusReason: expected [ { …(9) } ] to strictly equal []

[Killed] EqualityOperator
SubcategoryRelatedBlogPosts/helpers/functions/shouldShowPaginationWidget.ts:4:72
 import type { Quantity } from '@rtm/shared-types/Numbers';
 
 // eslint-disable-next-line no-magic-numbers
-const shouldShowPaginationWidget = (pagesAmount: Quantity): boolean => pagesAmount > 1;
+const shouldShowPaginationWidget = (pagesAmount: Quantity): boolean => pagesAmount <= 1;
 
 export default shouldShowPaginationWidget;
killedBy: buildBottomRightWidgets should match snapshot
statusReason: Snapshot `buildBottomRightWidgets > should match snapshot 1` mismatched
