[Killed] EqualityOperator
SubcategoryRelatedBlogPosts/helpers/functions/shouldShowTagsCommandWidget.ts:4:72
 import type { Quantity } from '@rtm/shared-types/Numbers';
 
 // eslint-disable-next-line no-magic-numbers
-const shouldShowTagsCommandWidget = (tagsAmount: Quantity): boolean => tagsAmount > 1;
+const shouldShowTagsCommandWidget = (tagsAmount: Quantity): boolean => tagsAmount <= 1;
 
 export default shouldShowTagsCommandWidget;
killedBy: buildTopLeftWidgets should return empty list, given there is only one tag
statusReason: expected [ { …(9) } ] to strictly equal []

[Killed] ConditionalExpression
SubcategoryRelatedBlogPosts/helpers/functions/shouldShowTagsCommandWidget.ts:4:72
 import type { Quantity } from '@rtm/shared-types/Numbers';
 
 // eslint-disable-next-line no-magic-numbers
-const shouldShowTagsCommandWidget = (tagsAmount: Quantity): boolean => tagsAmount > 1;
+const shouldShowTagsCommandWidget = (tagsAmount: Quantity): boolean => true;
 
 export default shouldShowTagsCommandWidget;
killedBy: buildTopLeftWidgets should return empty list, given there is only one tag
statusReason: expected [ { …(9) } ] to strictly equal []
