[Killed] EqualityOperator
SubcategoryRelatedBlogPosts/helpers/functions/toolbarInner.tsx:21:75
 import PaginationWidget from '../../../PaginationWidget';
 
 // eslint-disable-next-line no-magic-numbers
-const shouldShowFiltersSelectWidget = (postsAmount: Quantity): boolean => postsAmount > 1;
+const shouldShowFiltersSelectWidget = (postsAmount: Quantity): boolean => postsAmount >= 1;
 
 const getMaybeDropdown = (
killedBy: buildTopRightWidgets should return empty list, given there is only one page and only one post
statusReason: expected [ { …(9) } ] to strictly equal []

[Killed] EqualityOperator
SubcategoryRelatedBlogPosts/helpers/functions/toolbarInner.tsx:21:75
 import PaginationWidget from '../../../PaginationWidget';
 
 // eslint-disable-next-line no-magic-numbers
-const shouldShowFiltersSelectWidget = (postsAmount: Quantity): boolean => postsAmount > 1;
+const shouldShowFiltersSelectWidget = (postsAmount: Quantity): boolean => postsAmount <= 1;
 
 const getMaybeDropdown = (
killedBy: buildTopRightWidgets should return empty list, given there is only one page and only one post
statusReason: expected [ { …(9) } ] to strictly equal []

[Killed] BooleanLiteral
SubcategoryRelatedBlogPosts/helpers/functions/toolbarInner.tsx:31:3
   searchParams: URLSearchParams,
   isBottomWidget?: boolean
 ): MaybeNull<ReactElement> =>
-  !showPaginationWidget
+  showPaginationWidget
     ? null
     : buildDropdown(pagesAmount, currentPage, pathname, searchParams, PAGE_KEY, { dropdownContentClassName: 'z-20', isBottomWidget });
killedBy: buildBottomRightWidgets should match snapshot
statusReason: Snapshot `buildBottomRightWidgets > should match snapshot 1` mismatched

[Killed] ObjectLiteral
SubcategoryRelatedBlogPosts/helpers/functions/toolbarInner.tsx:33:81
 ): MaybeNull<ReactElement> =>
   !showPaginationWidget
     ? null
-    : buildDropdown(pagesAmount, currentPage, pathname, searchParams, PAGE_KEY, { dropdownContentClassName: 'z-20', isBottomWidget });
+    : buildDropdown(pagesAmount, currentPage, pathname, searchParams, PAGE_KEY, {});
 
 function buildWidgetsForTopRight(
killedBy: buildBottomRightWidgets should match snapshot
statusReason: Snapshot `buildBottomRightWidgets > should match snapshot 1` mismatched

[Killed] ConditionalExpression
SubcategoryRelatedBlogPosts/helpers/functions/toolbarInner.tsx:51:7
 ): ReactElement[] {
   const elements: ReactElement[] = [];
 
-  if (filtersWidgetProps.showFiltersSelectWidget) {
+  if (false) {
     elements.push(
       <FiltersSelectWidget
killedBy: buildTopRightWidgets should return a list containing only the FiltersSelectWidget, given only one page but several posts
statusReason: expected [] to strictly equal [ { …(9) } ]

[Killed] ConditionalExpression
SubcategoryRelatedBlogPosts/helpers/functions/toolbarInner.tsx:51:7
 ): ReactElement[] {
   const elements: ReactElement[] = [];
 
-  if (filtersWidgetProps.showFiltersSelectWidget) {
+  if (true) {
     elements.push(
       <FiltersSelectWidget
killedBy: buildTopRightWidgets should return empty list, given there is only one page and only one post
statusReason: expected [ { …(9) } ] to strictly equal []

[Killed] BlockStatement
SubcategoryRelatedBlogPosts/helpers/functions/toolbarInner.tsx:65:51
     );
   }
 
-  if (paginationWidgetProps.showPaginationWidget) {
-    elements.push(
-      <PaginationWidget
-        pagesAmount={paginationWidgetProps.pagesAmount}
-        currentPage={paginationWidgetProps.currentPage}
-        className="w-full justify-end"
-        key="pagination-widget"
-      />
-    );
-  }
+  if (paginationWidgetProps.showPaginationWidget) {}
 
   return elements;
killedBy: buildTopRightWidgets should return a list containing both the FiltersSelectWidget and the PaginationWidget, given several pages and several posts
statusReason: expected [ { …(9) } ] to strictly equal [ { …(9) }, { …(9) } ]

[Killed] ConditionalExpression
SubcategoryRelatedBlogPosts/helpers/functions/toolbarInner.tsx:65:7
     );
   }
 
-  if (paginationWidgetProps.showPaginationWidget) {
+  if (false) {
     elements.push(
       <PaginationWidget
killedBy: buildTopRightWidgets should return a list containing both the FiltersSelectWidget and the PaginationWidget, given several pages and several posts
statusReason: expected [ { …(9) } ] to strictly equal [ { …(9) }, { …(9) } ]

[Killed] BooleanLiteral
SubcategoryRelatedBlogPosts/helpers/functions/toolbarInner.tsx:89:26
   searchParams: URLSearchParams
 ): ReactElement[] {
   const elements: ReactElement[] = [];
-  const isBottomWidget = true;
+  const isBottomWidget = false;
 
   const maybeDropdown = getMaybeDropdown(
killedBy: buildBottomRightWidgets should match snapshot
statusReason: Snapshot `buildBottomRightWidgets > should match snapshot 1` mismatched

[Killed] ConditionalExpression
SubcategoryRelatedBlogPosts/helpers/functions/toolbarInner.tsx:116:7
 
   const elements: ReactElement[] = [];
 
-  if (showTagsCommandWidget) {
+  if (true) {
     elements.push(
       <TagsCommandWidget
killedBy: buildTopLeftWidgets should return empty list, given there is only one tag
statusReason: expected [ { …(9) } ] to strictly equal []

[Killed] BlockStatement
SubcategoryRelatedBlogPosts/helpers/functions/toolbarInner.tsx:116:30
 
   const elements: ReactElement[] = [];
 
-  if (showTagsCommandWidget) {
-    elements.push(
-      <TagsCommandWidget
-        memorizedPageBeforeFiltering={tagsCommandWidgetProps.memorizedPageBeforeFiltering}
-        setSelectedTagSwitch={tagsCommandWidgetProps.setSelectedTagSwitch}
-        newSelectedTagsIds={tagsCommandWidgetProps.newSelectedTagsIds}
-        selectedTagsIds={tagsCommandWidgetProps.selectedTagsIds}
-        tags={tagsCommandWidgetProps.tags}
-        key="tags-filter-widget"
-      />
-    );
-  }
+  if (showTagsCommandWidget) {}
 
   return elements;
killedBy: buildTopLeftWidgets should return crafted top left widgets, given there is enough tags
statusReason: expected [] to strictly equal [ { …(9) } ]
