[Survived] StringLiteral
components/pages/blog/TagsCommandWidget.tsx:31:23
   tags: BlogTag[];
 }
 
-const classNameBase = 'flex h-10 items-center rounded-md px-2 py-4';
+const classNameBase = "";
 
 const TagsCommandWidget: FunctionComponent<TagsCommandWidgetProps> = ({

[NoCoverage] BlockStatement
components/pages/blog/TagsCommandWidget.tsx:57:32
         const tagId = indexedBlogTagOptions[tag];
         const isSelected = selectedTagsIds.includes(tagId);
 
-        const onSelect = () => {
-          if (isSelected) {
-            newSelectedTagsIds.current = selectedTagsIds.filter((id) => id !== tagId);
-            // eslint-disable-next-line no-magic-numbers
-            if (newSelectedTagsIds.current.length === 0) setSelectedTagSwitch(ETagsSwitch.CLEARING);
-            else setSelectedTagSwitch(ETagsSwitch.UNSELECTING);
-          } else {
-            newSelectedTagsIds.current = [...selectedTagsIds, tagId];
-            setSelectedTagSwitch(ETagsSwitch.SELECTING);
-          }
-        };
+        const onSelect = () => {};
 
         return (

[NoCoverage] BlockStatement
components/pages/blog/TagsCommandWidget.tsx:58:27
         const isSelected = selectedTagsIds.includes(tagId);
 
         const onSelect = () => {
-          if (isSelected) {
-            newSelectedTagsIds.current = selectedTagsIds.filter((id) => id !== tagId);
-            // eslint-disable-next-line no-magic-numbers
-            if (newSelectedTagsIds.current.length === 0) setSelectedTagSwitch(ETagsSwitch.CLEARING);
-            else setSelectedTagSwitch(ETagsSwitch.UNSELECTING);
-          } else {
+          if (isSelected) {} else {
             newSelectedTagsIds.current = [...selectedTagsIds, tagId];
             setSelectedTagSwitch(ETagsSwitch.SELECTING);

[NoCoverage] ConditionalExpression
components/pages/blog/TagsCommandWidget.tsx:58:15
         const isSelected = selectedTagsIds.includes(tagId);
 
         const onSelect = () => {
-          if (isSelected) {
+          if (true) {
             newSelectedTagsIds.current = selectedTagsIds.filter((id) => id !== tagId);
             // eslint-disable-next-line no-magic-numbers

[NoCoverage] ConditionalExpression
components/pages/blog/TagsCommandWidget.tsx:59:73
 
         const onSelect = () => {
           if (isSelected) {
-            newSelectedTagsIds.current = selectedTagsIds.filter((id) => id !== tagId);
+            newSelectedTagsIds.current = selectedTagsIds.filter((id) => true);
             // eslint-disable-next-line no-magic-numbers
             if (newSelectedTagsIds.current.length === 0) setSelectedTagSwitch(ETagsSwitch.CLEARING);

[NoCoverage] EqualityOperator
components/pages/blog/TagsCommandWidget.tsx:59:73
 
         const onSelect = () => {
           if (isSelected) {
-            newSelectedTagsIds.current = selectedTagsIds.filter((id) => id !== tagId);
+            newSelectedTagsIds.current = selectedTagsIds.filter((id) => id === tagId);
             // eslint-disable-next-line no-magic-numbers
             if (newSelectedTagsIds.current.length === 0) setSelectedTagSwitch(ETagsSwitch.CLEARING);

[NoCoverage] EqualityOperator
components/pages/blog/TagsCommandWidget.tsx:61:17
           if (isSelected) {
             newSelectedTagsIds.current = selectedTagsIds.filter((id) => id !== tagId);
             // eslint-disable-next-line no-magic-numbers
-            if (newSelectedTagsIds.current.length === 0) setSelectedTagSwitch(ETagsSwitch.CLEARING);
+            if (newSelectedTagsIds.current.length !== 0) setSelectedTagSwitch(ETagsSwitch.CLEARING);
             else setSelectedTagSwitch(ETagsSwitch.UNSELECTING);
           } else {

[NoCoverage] ConditionalExpression
components/pages/blog/TagsCommandWidget.tsx:61:17
           if (isSelected) {
             newSelectedTagsIds.current = selectedTagsIds.filter((id) => id !== tagId);
             // eslint-disable-next-line no-magic-numbers
-            if (newSelectedTagsIds.current.length === 0) setSelectedTagSwitch(ETagsSwitch.CLEARING);
+            if (false) setSelectedTagSwitch(ETagsSwitch.CLEARING);
             else setSelectedTagSwitch(ETagsSwitch.UNSELECTING);
           } else {

[NoCoverage] BlockStatement
components/pages/blog/TagsCommandWidget.tsx:63:18
             // eslint-disable-next-line no-magic-numbers
             if (newSelectedTagsIds.current.length === 0) setSelectedTagSwitch(ETagsSwitch.CLEARING);
             else setSelectedTagSwitch(ETagsSwitch.UNSELECTING);
-          } else {
-            newSelectedTagsIds.current = [...selectedTagsIds, tagId];
-            setSelectedTagSwitch(ETagsSwitch.SELECTING);
-          }
+          } else {}
         };
 

[NoCoverage] ArrowFunction
components/pages/blog/TagsCommandWidget.tsx:70:34
         };
 
         return (
-          <CommandItem onSelect={() => onSelect()} className="h-12 lg:h-8" key={`filter-${tag}`}>
+          <CommandItem onSelect={() => undefined} className="h-12 lg:h-8" key={`filter-${tag}`}>
             <div
               className={cn(

[NoCoverage] StringLiteral
components/pages/blog/TagsCommandWidget.tsx:74:30
             <div
               className={cn(
                 'flex h-4 w-4 items-center justify-center rounded-sm border border-primary ltr:mr-2 rtl:ml-2',
-                isSelected ? 'bg-primary text-primary-foreground' : '[&_svg]:invisible'
+                isSelected ? "" : '[&_svg]:invisible'
               )}
             >

[NoCoverage] StringLiteral
components/pages/blog/TagsCommandWidget.tsx:74:69
             <div
               className={cn(
                 'flex h-4 w-4 items-center justify-center rounded-sm border border-primary ltr:mr-2 rtl:ml-2',
-                isSelected ? 'bg-primary text-primary-foreground' : '[&_svg]:invisible'
+                isSelected ? 'bg-primary text-primary-foreground' : ""
               )}
             >

[NoCoverage] ArrayDeclaration
components/pages/blog/TagsCommandWidget.tsx:83:5
           </CommandItem>
         );
       }),
-    [globalT, selectedTagsIds, tags, setSelectedTagSwitch, newSelectedTagsIds]
+    []
   );
 

[NoCoverage] BlockStatement
components/pages/blog/TagsCommandWidget.tsx:86:19
     [globalT, selectedTagsIds, tags, setSelectedTagSwitch, newSelectedTagsIds]
   );
 
-  useEffect(() => {
-    isOpenedRef.current = isOpened;
-  }, [isOpened]);
+  useEffect(() => {}, [isOpened]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
components/pages/blog/TagsCommandWidget.tsx:90:19
     isOpenedRef.current = isOpened;
   }, [isOpened]);
 
-  useEffect(() => {
-    function killswitchMemorizedPageBeforeFilteringOnPaginationWidgetClick() {
-      // eslint-disable-next-line no-magic-numbers
-      if (isOpenedRef.current || selectedTagsIds.length === 0) return;
-      memorizedPageBeforeFiltering.current = null;
-    }
-    killswitchMemorizedPageBeforeFilteringOnPaginationWidgetClick();
-  }, [searchParams, selectedTagsIds, memorizedPageBeforeFiltering]);
+  useEffect(() => {}, [searchParams, selectedTagsIds, memorizedPageBeforeFiltering]);
 
   const activeFiltersIndicator = (

[NoCoverage] BlockStatement
components/pages/blog/TagsCommandWidget.tsx:91:78
   }, [isOpened]);
 
   useEffect(() => {
-    function killswitchMemorizedPageBeforeFilteringOnPaginationWidgetClick() {
-      // eslint-disable-next-line no-magic-numbers
-      if (isOpenedRef.current || selectedTagsIds.length === 0) return;
-      memorizedPageBeforeFiltering.current = null;
-    }
+    function killswitchMemorizedPageBeforeFilteringOnPaginationWidgetClick() {}
     killswitchMemorizedPageBeforeFilteringOnPaginationWidgetClick();
   }, [searchParams, selectedTagsIds, memorizedPageBeforeFiltering]);

[NoCoverage] EqualityOperator
components/pages/blog/TagsCommandWidget.tsx:93:34
   useEffect(() => {
     function killswitchMemorizedPageBeforeFilteringOnPaginationWidgetClick() {
       // eslint-disable-next-line no-magic-numbers
-      if (isOpenedRef.current || selectedTagsIds.length === 0) return;
+      if (isOpenedRef.current || selectedTagsIds.length !== 0) return;
       memorizedPageBeforeFiltering.current = null;
     }

[NoCoverage] ConditionalExpression
components/pages/blog/TagsCommandWidget.tsx:93:11
   useEffect(() => {
     function killswitchMemorizedPageBeforeFilteringOnPaginationWidgetClick() {
       // eslint-disable-next-line no-magic-numbers
-      if (isOpenedRef.current || selectedTagsIds.length === 0) return;
+      if (true) return;
       memorizedPageBeforeFiltering.current = null;
     }

[NoCoverage] BlockStatement
components/pages/blog/TagsCommandWidget.tsx:116:27
       <CommandSeparator />
       <CommandGroup>
         <CommandItem
-          onSelect={() => {
-            newSelectedTagsIds.current = [];
-            setSelectedTagSwitch(ETagsSwitch.CLEARING);
-          }}
+          onSelect={() => {}}
           className="justify-center text-center"
         >

[NoCoverage] BooleanLiteral
components/pages/blog/TagsCommandWidget.tsx:129:99
   );
 
   return (
-    <Popover onOpenChange={(_isOpened: boolean) => setIsOpened(_isOpened)} open={isOpened} modal={true}>
+    <Popover onOpenChange={(_isOpened: boolean) => setIsOpened(_isOpened)} open={isOpened} modal={false}>
       <PopoverTrigger asChild>
         <button

[NoCoverage] ArrowFunction
components/pages/blog/TagsCommandWidget.tsx:129:28
   );
 
   return (
-    <Popover onOpenChange={(_isOpened: boolean) => setIsOpened(_isOpened)} open={isOpened} modal={true}>
+    <Popover onOpenChange={() => undefined} open={isOpened} modal={true}>
       <PopoverTrigger asChild>
         <button

[NoCoverage] ObjectLiteral
components/pages/blog/TagsCommandWidget.tsx:132:65
     <Popover onOpenChange={(_isOpened: boolean) => setIsOpened(_isOpened)} open={isOpened} modal={true}>
       <PopoverTrigger asChild>
         <button
-          className={cn(classNameBase, BUTTON_CONFIG.CLASSNAME, {
-            [BUTTON_CONFIG.NOT_ACTIVE_CLASSNAME]: !isOpened,
-            [BUTTON_CONFIG.ACTIVE_CLASSNAME]: isOpened
-          })}
+          className={cn(classNameBase, BUTTON_CONFIG.CLASSNAME, {})}
         >
           <PlusCircledIcon

[NoCoverage] BooleanLiteral
components/pages/blog/TagsCommandWidget.tsx:133:51
       <PopoverTrigger asChild>
         <button
           className={cn(classNameBase, BUTTON_CONFIG.CLASSNAME, {
-            [BUTTON_CONFIG.NOT_ACTIVE_CLASSNAME]: !isOpened,
+            [BUTTON_CONFIG.NOT_ACTIVE_CLASSNAME]: isOpened,
             [BUTTON_CONFIG.ACTIVE_CLASSNAME]: isOpened
           })}

[NoCoverage] StringLiteral
components/pages/blog/TagsCommandWidget.tsx:138:27
           })}
         >
           <PlusCircledIcon
-            className={cn('h-5 w-5 transition-transform duration-300 ltr:mr-2 rtl:ml-2', { 'ltr:-rotate-45 rtl:rotate-45': isOpened })}
+            className={cn("", { 'ltr:-rotate-45 rtl:rotate-45': isOpened })}
           />
           {title}

[NoCoverage] ObjectLiteral
components/pages/blog/TagsCommandWidget.tsx:138:90
           })}
         >
           <PlusCircledIcon
-            className={cn('h-5 w-5 transition-transform duration-300 ltr:mr-2 rtl:ml-2', { 'ltr:-rotate-45 rtl:rotate-45': isOpened })}
+            className={cn('h-5 w-5 transition-transform duration-300 ltr:mr-2 rtl:ml-2', {})}
           />
           {title}

[NoCoverage] LogicalOperator
components/pages/blog/TagsCommandWidget.tsx:142:12
           />
           {title}
           {/* eslint-disable-next-line no-magic-numbers */}
-          {selectedTagsIds.length > 0 && activeFiltersIndicator}
+          {selectedTagsIds.length > 0 || activeFiltersIndicator}
         </button>
       </PopoverTrigger>

[NoCoverage] EqualityOperator
components/pages/blog/TagsCommandWidget.tsx:142:12
           />
           {title}
           {/* eslint-disable-next-line no-magic-numbers */}
-          {selectedTagsIds.length > 0 && activeFiltersIndicator}
+          {selectedTagsIds.length <= 0 && activeFiltersIndicator}
         </button>
       </PopoverTrigger>

[NoCoverage] LogicalOperator
components/pages/blog/TagsCommandWidget.tsx:152:14
             <CommandEmpty>{noResultFound}</CommandEmpty>
             <CommandGroup>{buildCommandItems()}</CommandGroup>
             {/* eslint-disable-next-line no-magic-numbers */}
-            {selectedTagsIds.length > 0 && clearFiltersBtn}
+            {selectedTagsIds.length > 0 || clearFiltersBtn}
           </CommandList>
         </Command>

[NoCoverage] ConditionalExpression
components/pages/blog/TagsCommandWidget.tsx:152:14
             <CommandEmpty>{noResultFound}</CommandEmpty>
             <CommandGroup>{buildCommandItems()}</CommandGroup>
             {/* eslint-disable-next-line no-magic-numbers */}
-            {selectedTagsIds.length > 0 && clearFiltersBtn}
+            {true}
           </CommandList>
         </Command>
