[Killed] MethodExpression
blog/helpers/functions/filters.ts:12:28
 function buildUnpackedAndSanitizedFilters(packedIds: string, expectedIds: Set<Id>) {
   const unpackedAndSanitizedFilters = sortNumbers(
     // eslint-disable-next-line no-magic-numbers
-    Array.from(new Set<Id>(unpackIds(packedIds).filter((id) => expectedIds.has(id))))
+    Array.from(new Set<Id>(unpackIds(packedIds)))
   );
 
killedBy: getUnpackedAndSanitizedFilters should return sanitized and sorted filter ids, given valid but ugly input
statusReason: expected [ +0, 1, 2 ] to strictly equal [ +0, 1 ]

[Killed] ArrowFunction
blog/helpers/functions/filters.ts:12:56
 function buildUnpackedAndSanitizedFilters(packedIds: string, expectedIds: Set<Id>) {
   const unpackedAndSanitizedFilters = sortNumbers(
     // eslint-disable-next-line no-magic-numbers
-    Array.from(new Set<Id>(unpackIds(packedIds).filter((id) => expectedIds.has(id))))
+    Array.from(new Set<Id>(unpackIds(packedIds).filter(() => undefined)))
   );
 
killedBy: getUnpackedAndSanitizedFilters should return sanitized and sorted filter ids, given valid but ugly input
statusReason: expected [] to strictly equal [ +0, 1 ]
