[Killed] ConditionalExpression
blog/helpers/functions/filtersSelectWidget.ts:8:31
 
 export function getSanitizedCurrentFilterIndex(searchParams: URLSearchParams, maxFilter: Limit, filtersKey: string) {
   const maybeUnsafeFilterFromUrl: MaybeNull<string> = searchParams.get(filtersKey);
-  const unsafeFilterFromUrl = maybeUnsafeFilterFromUrl === null ? FIRST_FILTER_INDEX : Number(maybeUnsafeFilterFromUrl);
+  const unsafeFilterFromUrl = true ? FIRST_FILTER_INDEX : Number(maybeUnsafeFilterFromUrl);
 
   if (isNaN(unsafeFilterFromUrl)) return FIRST_FILTER_INDEX;
killedBy: getSanitizedCurrentFilterIndex should return maxFilter, given filter is bigger than maxFilter
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
blog/helpers/functions/filtersSelectWidget.ts:8:31
 
 export function getSanitizedCurrentFilterIndex(searchParams: URLSearchParams, maxFilter: Limit, filtersKey: string) {
   const maybeUnsafeFilterFromUrl: MaybeNull<string> = searchParams.get(filtersKey);
-  const unsafeFilterFromUrl = maybeUnsafeFilterFromUrl === null ? FIRST_FILTER_INDEX : Number(maybeUnsafeFilterFromUrl);
+  const unsafeFilterFromUrl = maybeUnsafeFilterFromUrl !== null ? FIRST_FILTER_INDEX : Number(maybeUnsafeFilterFromUrl);
 
   if (isNaN(unsafeFilterFromUrl)) return FIRST_FILTER_INDEX;
killedBy: getSanitizedCurrentFilterIndex should return maxFilter, given filter is bigger than maxFilter
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
blog/helpers/functions/filtersSelectWidget.ts:10:7
   const maybeUnsafeFilterFromUrl: MaybeNull<string> = searchParams.get(filtersKey);
   const unsafeFilterFromUrl = maybeUnsafeFilterFromUrl === null ? FIRST_FILTER_INDEX : Number(maybeUnsafeFilterFromUrl);
 
-  if (isNaN(unsafeFilterFromUrl)) return FIRST_FILTER_INDEX;
+  if (false) return FIRST_FILTER_INDEX;
   if (unsafeFilterFromUrl < FIRST_FILTER_INDEX) return FIRST_FILTER_INDEX;
   if (unsafeFilterFromUrl > maxFilter) return maxFilter;
killedBy: getSanitizedCurrentFilterIndex should return FIRST_FILTER_INDEX, given filter is not a number
statusReason: expected NaN to be +0 // Object.is equality

[Killed] ConditionalExpression
blog/helpers/functions/filtersSelectWidget.ts:10:7
   const maybeUnsafeFilterFromUrl: MaybeNull<string> = searchParams.get(filtersKey);
   const unsafeFilterFromUrl = maybeUnsafeFilterFromUrl === null ? FIRST_FILTER_INDEX : Number(maybeUnsafeFilterFromUrl);
 
-  if (isNaN(unsafeFilterFromUrl)) return FIRST_FILTER_INDEX;
+  if (true) return FIRST_FILTER_INDEX;
   if (unsafeFilterFromUrl < FIRST_FILTER_INDEX) return FIRST_FILTER_INDEX;
   if (unsafeFilterFromUrl > maxFilter) return maxFilter;
killedBy: getSanitizedCurrentFilterIndex should return maxFilter, given filter is bigger than maxFilter
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
blog/helpers/functions/filtersSelectWidget.ts:11:7
   const unsafeFilterFromUrl = maybeUnsafeFilterFromUrl === null ? FIRST_FILTER_INDEX : Number(maybeUnsafeFilterFromUrl);
 
   if (isNaN(unsafeFilterFromUrl)) return FIRST_FILTER_INDEX;
-  if (unsafeFilterFromUrl < FIRST_FILTER_INDEX) return FIRST_FILTER_INDEX;
+  if (true) return FIRST_FILTER_INDEX;
   if (unsafeFilterFromUrl > maxFilter) return maxFilter;
   return unsafeFilterFromUrl;
killedBy: getSanitizedCurrentFilterIndex should return maxFilter, given filter is bigger than maxFilter
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
blog/helpers/functions/filtersSelectWidget.ts:11:7
   const unsafeFilterFromUrl = maybeUnsafeFilterFromUrl === null ? FIRST_FILTER_INDEX : Number(maybeUnsafeFilterFromUrl);
 
   if (isNaN(unsafeFilterFromUrl)) return FIRST_FILTER_INDEX;
-  if (unsafeFilterFromUrl < FIRST_FILTER_INDEX) return FIRST_FILTER_INDEX;
+  if (false) return FIRST_FILTER_INDEX;
   if (unsafeFilterFromUrl > maxFilter) return maxFilter;
   return unsafeFilterFromUrl;
killedBy: getSanitizedCurrentFilterIndex should return FIRST_FILTER_INDEX, given FIRST_FILTER_INDEX is bigger than filter
statusReason: expected -1 to be +0 // Object.is equality

[Killed] EqualityOperator
blog/helpers/functions/filtersSelectWidget.ts:12:7
 
   if (isNaN(unsafeFilterFromUrl)) return FIRST_FILTER_INDEX;
   if (unsafeFilterFromUrl < FIRST_FILTER_INDEX) return FIRST_FILTER_INDEX;
-  if (unsafeFilterFromUrl > maxFilter) return maxFilter;
+  if (unsafeFilterFromUrl <= maxFilter) return maxFilter;
   return unsafeFilterFromUrl;
 }
killedBy: getSanitizedCurrentFilterIndex should return FIRST_FILTER_INDEX, given valid inputs and expecting FIRST_FILTER_INDEX
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
blog/helpers/functions/filtersSelectWidget.ts:12:7
 
   if (isNaN(unsafeFilterFromUrl)) return FIRST_FILTER_INDEX;
   if (unsafeFilterFromUrl < FIRST_FILTER_INDEX) return FIRST_FILTER_INDEX;
-  if (unsafeFilterFromUrl > maxFilter) return maxFilter;
+  if (false) return maxFilter;
   return unsafeFilterFromUrl;
 }
killedBy: getSanitizedCurrentFilterIndex should return maxFilter, given filter is bigger than maxFilter
statusReason: expected 2 to be 1 // Object.is equality
