[Killed] ConditionalExpression
blog/helpers/functions/paginationWidget.tsx:17:49
 const MAX_USER_INTERFACE_ITEMS_AMOUNT: Quantity = 3;
 
 const getItemHref = (i: Count, pathname: AppPath, searchParams: URLSearchParams, pageKey: string) =>
-  pathname + createURLSearchParams({ [pageKey]: i === FIRST_PAGE_PARAM ? null : i }, searchParams);
+  pathname + createURLSearchParams({ [pageKey]: true ? null : i }, searchParams);
 
 const buildDropdownMenu = (
killedBy: doBuildPaginationItems should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown) 1` mismatched

[Killed] EqualityOperator
blog/helpers/functions/paginationWidget.tsx:17:49
 const MAX_USER_INTERFACE_ITEMS_AMOUNT: Quantity = 3;
 
 const getItemHref = (i: Count, pathname: AppPath, searchParams: URLSearchParams, pageKey: string) =>
-  pathname + createURLSearchParams({ [pageKey]: i === FIRST_PAGE_PARAM ? null : i }, searchParams);
+  pathname + createURLSearchParams({ [pageKey]: i !== FIRST_PAGE_PARAM ? null : i }, searchParams);
 
 const buildDropdownMenu = (
killedBy: doBuildPaginationItems should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown) 1` mismatched

[Survived] StringLiteral
blog/helpers/functions/paginationWidget.tsx:29:10
     pageNumberIndicator={pageNumberIndicator}
     isBottomWidget={options?.isBottomWidget}
     dropdownItems={dropdownItems}
-    key={'ellipsis'}
+    key={""}
   />
 );

[Killed] ObjectLiteral
blog/helpers/functions/paginationWidget.tsx:36:65
 const buildPaginationItem = (i: Count, isActive: boolean, pathname: AppPath, searchParams: URLSearchParams, pageKey: string) => (
   <PaginationItem key={`page-${i}`}>
     <PaginationLink
-      className={cn('border-none font-bold transition-opacity', {
-        'pointer-events-none underline opacity-50': isActive
-      })}
+      className={cn('border-none font-bold transition-opacity', {})}
       href={getItemHref(i, pathname, searchParams, pageKey)}
       aria-current={isActive ? 'page' : undefined}
killedBy: doBuildPaginationItems should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown) 1` mismatched

[Killed] EqualityOperator
blog/helpers/functions/paginationWidget.tsx:58:7
   const maybeDropdown: MaybeNull<ReactElement> = buildDropdown(pagesAmount, currentPage, pathname, searchParams, pageKey, {
     dropdownContentClassName: 'z-20'
   });
-  if (maybeDropdown === null) return null;
+  if (maybeDropdown !== null) return null;
   return <li key="pagination-dropdown-mobile">{maybeDropdown}</li>;
 }
killedBy: doBuildPaginationItems should match snapshot (mobile)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (mobile) 1` mismatched

[Killed] ConditionalExpression
blog/helpers/functions/paginationWidget.tsx:58:7
   const maybeDropdown: MaybeNull<ReactElement> = buildDropdown(pagesAmount, currentPage, pathname, searchParams, pageKey, {
     dropdownContentClassName: 'z-20'
   });
-  if (maybeDropdown === null) return null;
+  if (false) return null;
   return <li key="pagination-dropdown-mobile">{maybeDropdown}</li>;
 }
killedBy: doBuildPaginationItems should return null (mobile)
statusReason: expected { …(9) } to be null // Object.is equality

[Killed] EqualityOperator
blog/helpers/functions/paginationWidget.tsx:71:34
 ) {
   const elements: ReactElement[] = [];
 
-  for (let i = FIRST_PAGE_PARAM; i <= pagesAmount; i++) {
+  for (let i = FIRST_PAGE_PARAM; i > pagesAmount; i++) {
     const isActive = currentPage === i;
     elements.push(buildPaginationItem(i, isActive, pathname, searchParams, pageKey));
killedBy: doBuildPaginationItems should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown) 1` mismatched

[Killed] EqualityOperator
blog/helpers/functions/paginationWidget.tsx:71:34
 ) {
   const elements: ReactElement[] = [];
 
-  for (let i = FIRST_PAGE_PARAM; i <= pagesAmount; i++) {
+  for (let i = FIRST_PAGE_PARAM; i < pagesAmount; i++) {
     const isActive = currentPage === i;
     elements.push(buildPaginationItem(i, isActive, pathname, searchParams, pageKey));
killedBy: doBuildPaginationItems should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown) 1` mismatched

[Killed] ConditionalExpression
blog/helpers/functions/paginationWidget.tsx:72:22
   const elements: ReactElement[] = [];
 
   for (let i = FIRST_PAGE_PARAM; i <= pagesAmount; i++) {
-    const isActive = currentPage === i;
+    const isActive = false;
     elements.push(buildPaginationItem(i, isActive, pathname, searchParams, pageKey));
   }
killedBy: doBuildPaginationItems should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown) 1` mismatched

[Killed] ConditionalExpression
blog/helpers/functions/paginationWidget.tsx:72:22
   const elements: ReactElement[] = [];
 
   for (let i = FIRST_PAGE_PARAM; i <= pagesAmount; i++) {
-    const isActive = currentPage === i;
+    const isActive = true;
     elements.push(buildPaginationItem(i, isActive, pathname, searchParams, pageKey));
   }
killedBy: doBuildPaginationItems should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown) 1` mismatched

[Killed] EqualityOperator
blog/helpers/functions/paginationWidget.tsx:86:76
   searchParams: URLSearchParams,
   pageKey: string
 ) {
-  const isTrivialCase = pagesAmount === MAX_USER_INTERFACE_ITEMS_AMOUNT || pagesAmount === MIN_USER_INTERFACE_ITEMS_AMOUNT;
+  const isTrivialCase = pagesAmount === MAX_USER_INTERFACE_ITEMS_AMOUNT || pagesAmount !== MIN_USER_INTERFACE_ITEMS_AMOUNT;
 
   if (isTrivialCase) {
killedBy: doBuildPaginationItems should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown) 1` mismatched

[Killed] ConditionalExpression
blog/helpers/functions/paginationWidget.tsx:86:25
   searchParams: URLSearchParams,
   pageKey: string
 ) {
-  const isTrivialCase = pagesAmount === MAX_USER_INTERFACE_ITEMS_AMOUNT || pagesAmount === MIN_USER_INTERFACE_ITEMS_AMOUNT;
+  const isTrivialCase = false;
 
   if (isTrivialCase) {
killedBy: doBuildPaginationItems should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown) 1` mismatched

[Killed] ConditionalExpression
blog/helpers/functions/paginationWidget.tsx:88:7
 ) {
   const isTrivialCase = pagesAmount === MAX_USER_INTERFACE_ITEMS_AMOUNT || pagesAmount === MIN_USER_INTERFACE_ITEMS_AMOUNT;
 
-  if (isTrivialCase) {
+  if (true) {
     return buildPaginationItemsForDesktopTrivialCases(pagesAmount, currentPage, pathname, searchParams, pageKey);
   }
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown) 1` mismatched

[Killed] ConditionalExpression
blog/helpers/functions/paginationWidget.tsx:88:7
 ) {
   const isTrivialCase = pagesAmount === MAX_USER_INTERFACE_ITEMS_AMOUNT || pagesAmount === MIN_USER_INTERFACE_ITEMS_AMOUNT;
 
-  if (isTrivialCase) {
+  if (false) {
     return buildPaginationItemsForDesktopTrivialCases(pagesAmount, currentPage, pathname, searchParams, pageKey);
   }
killedBy: doBuildPaginationItems should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, trivial pagesAmount === 2 case, i.e: 2 parts UI without dropdown) 1` mismatched

[Killed] EqualityOperator
blog/helpers/functions/paginationWidget.tsx:92:32
     return buildPaginationItemsForDesktopTrivialCases(pagesAmount, currentPage, pathname, searchParams, pageKey);
   }
 
-  const activePageIsLastPage = currentPage === pagesAmount;
+  const activePageIsLastPage = currentPage !== pagesAmount;
 
   const dropdownItems: ReactElement[] = [];
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown) 1` mismatched

[Killed] ConditionalExpression
blog/helpers/functions/paginationWidget.tsx:92:32
     return buildPaginationItemsForDesktopTrivialCases(pagesAmount, currentPage, pathname, searchParams, pageKey);
   }
 
-  const activePageIsLastPage = currentPage === pagesAmount;
+  const activePageIsLastPage = false;
 
   const dropdownItems: ReactElement[] = [];
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown, current page being last page)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown, current page being last page) 1` mismatched

[Killed] BooleanLiteral
blog/helpers/functions/paginationWidget.tsx:98:61
   let leftItem: MaybeNull<ReactElement> = null;
   let rightItem: MaybeNull<ReactElement> = null;
 
-  function buildDropdownItem(i: Count, isCurrent: boolean = false) {
+  function buildDropdownItem(i: Count, isCurrent: boolean = true) {
     const href = getItemHref(i, pathname, searchParams, pageKey);
     const item = (
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown) 1` mismatched

[Killed] ObjectLiteral
blog/helpers/functions/paginationWidget.tsx:103:30
     const item = (
       <DropdownMenuItem
         onClick={(event) => dispatchClickOnLinkOrButtonFirstChild(event.target)}
-        className={cn('p-0', {
-          'opacity-50': isCurrent
-        })}
+        className={cn('p-0', {})}
         key={`page-${i}`}
       >
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown) 1` mismatched

[Killed] EqualityOperator
blog/helpers/functions/paginationWidget.tsx:122:22
   }
 
   for (let i = FIRST_PAGE_PARAM; i <= pagesAmount; i++) {
-    const isActive = currentPage === i;
+    const isActive = currentPage !== i;
 
     if (i === pagesAmount) {
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown) 1` mismatched

[Killed] EqualityOperator
blog/helpers/functions/paginationWidget.tsx:124:9
   for (let i = FIRST_PAGE_PARAM; i <= pagesAmount; i++) {
     const isActive = currentPage === i;
 
-    if (i === pagesAmount) {
+    if (i !== pagesAmount) {
       rightItem = buildPaginationItem(i, isActive, pathname, searchParams, pageKey);
       if (!leftItem) {
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown) 1` mismatched

[Killed] ConditionalExpression
blog/helpers/functions/paginationWidget.tsx:124:9
   for (let i = FIRST_PAGE_PARAM; i <= pagesAmount; i++) {
     const isActive = currentPage === i;
 
-    if (i === pagesAmount) {
+    if (true) {
       rightItem = buildPaginationItem(i, isActive, pathname, searchParams, pageKey);
       if (!leftItem) {
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown) 1` mismatched

[Killed] ConditionalExpression
blog/helpers/functions/paginationWidget.tsx:126:11
 
     if (i === pagesAmount) {
       rightItem = buildPaginationItem(i, isActive, pathname, searchParams, pageKey);
-      if (!leftItem) {
+      if (false) {
         leftItem = buildPaginationItem(FIRST_PAGE_PARAM, false, pathname, searchParams, pageKey);
       }
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown, current page being last page)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown, current page being last page) 1` mismatched

[Killed] BlockStatement
blog/helpers/functions/paginationWidget.tsx:126:22
 
     if (i === pagesAmount) {
       rightItem = buildPaginationItem(i, isActive, pathname, searchParams, pageKey);
-      if (!leftItem) {
-        leftItem = buildPaginationItem(FIRST_PAGE_PARAM, false, pathname, searchParams, pageKey);
-      }
+      if (!leftItem) {}
 
       if (activePageIsLastPage) {
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown, current page being last page)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown, current page being last page) 1` mismatched

[Killed] BooleanLiteral
blog/helpers/functions/paginationWidget.tsx:127:58
     if (i === pagesAmount) {
       rightItem = buildPaginationItem(i, isActive, pathname, searchParams, pageKey);
       if (!leftItem) {
-        leftItem = buildPaginationItem(FIRST_PAGE_PARAM, false, pathname, searchParams, pageKey);
+        leftItem = buildPaginationItem(FIRST_PAGE_PARAM, true, pathname, searchParams, pageKey);
       }
 
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown, current page being last page)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown, current page being last page) 1` mismatched

[Killed] ConditionalExpression
blog/helpers/functions/paginationWidget.tsx:130:11
         leftItem = buildPaginationItem(FIRST_PAGE_PARAM, false, pathname, searchParams, pageKey);
       }
 
-      if (activePageIsLastPage) {
+      if (false) {
         const dropdownItem = buildDropdownItem(i, true);
         dropdownItems.push(dropdownItem);
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown, current page being last page)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown, current page being last page) 1` mismatched

[Killed] ConditionalExpression
blog/helpers/functions/paginationWidget.tsx:130:11
         leftItem = buildPaginationItem(FIRST_PAGE_PARAM, false, pathname, searchParams, pageKey);
       }
 
-      if (activePageIsLastPage) {
+      if (true) {
         const dropdownItem = buildDropdownItem(i, true);
         dropdownItems.push(dropdownItem);
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown) 1` mismatched

[Killed] BooleanLiteral
blog/helpers/functions/paginationWidget.tsx:131:51
       }
 
       if (activePageIsLastPage) {
-        const dropdownItem = buildDropdownItem(i, true);
+        const dropdownItem = buildDropdownItem(i, false);
         dropdownItems.push(dropdownItem);
       } else {
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown, current page being last page)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown, current page being last page) 1` mismatched

[Killed] BlockStatement
blog/helpers/functions/paginationWidget.tsx:133:14
       if (activePageIsLastPage) {
         const dropdownItem = buildDropdownItem(i, true);
         dropdownItems.push(dropdownItem);
-      } else {
-        const dropdownItem = buildDropdownItem(i);
-        dropdownItems.push(dropdownItem);
-      }
+      } else {}
 
       continue;
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown) 1` mismatched

[Killed] BlockStatement
blog/helpers/functions/paginationWidget.tsx:141:19
       continue;
     }
 
-    if (isActive) {
-      leftItem = buildPaginationItem(i, isActive, pathname, searchParams, pageKey);
-
-      const dropdownItem = buildDropdownItem(i, true);
-      dropdownItems.push(dropdownItem);
-
-      continue;
-    }
+    if (isActive) {}
 
     const dropdownItem = buildDropdownItem(i);
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown) 1` mismatched

[Killed] ConditionalExpression
blog/helpers/functions/paginationWidget.tsx:141:9
       continue;
     }
 
-    if (isActive) {
+    if (true) {
       leftItem = buildPaginationItem(i, isActive, pathname, searchParams, pageKey);
 
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown) 1` mismatched

[Killed] BooleanLiteral
blog/helpers/functions/paginationWidget.tsx:144:49
     if (isActive) {
       leftItem = buildPaginationItem(i, isActive, pathname, searchParams, pageKey);
 
-      const dropdownItem = buildDropdownItem(i, true);
+      const dropdownItem = buildDropdownItem(i, false);
       dropdownItems.push(dropdownItem);
 
killedBy: doBuildPaginationItems should match snapshot (desktop, 3 parts UI with dropdown)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (desktop, 3 parts UI with dropdown) 1` mismatched

[Killed] EqualityOperator
blog/helpers/functions/paginationWidget.tsx:168:7
 ) {
   const dropdownItems: ReactElement[] = [];
   // eslint-disable-next-line no-magic-numbers
-  if (pagesAmount === 1) return null;
+  if (pagesAmount !== 1) return null;
 
   for (let i = FIRST_PAGE_PARAM; i <= pagesAmount; i++) {
killedBy: doBuildPaginationItems should match snapshot (mobile)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (mobile) 1` mismatched

[Killed] ConditionalExpression
blog/helpers/functions/paginationWidget.tsx:168:7
 ) {
   const dropdownItems: ReactElement[] = [];
   // eslint-disable-next-line no-magic-numbers
-  if (pagesAmount === 1) return null;
+  if (true) return null;
 
   for (let i = FIRST_PAGE_PARAM; i <= pagesAmount; i++) {
killedBy: doBuildPaginationItems should match snapshot (mobile)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (mobile) 1` mismatched

[Killed] BlockStatement
blog/helpers/functions/paginationWidget.tsx:170:57
   // eslint-disable-next-line no-magic-numbers
   if (pagesAmount === 1) return null;
 
-  for (let i = FIRST_PAGE_PARAM; i <= pagesAmount; i++) {
-    const isActive = pageFromUrl === i;
-    const href = getItemHref(i, pathname, searchParams, pageKey);
-
-    const dropdownItem = (
-      <DropdownMenuItem onClick={(event) => dispatchClickOnLinkOrButtonFirstChild(event.target)} className="h-10 p-0" key={`page-${i}`}>
-        <Link
-          className={cn('flex h-full w-full items-center justify-center border-none px-2 text-center font-bold', {
-            'rounded-md bg-primary': isActive
-          })}
-          aria-current={isActive ? 'page' : undefined}
-          title={String(i)}
-          href={href}
-        >
-          {i}
-        </Link>
-      </DropdownMenuItem>
-    );
-
-    dropdownItems.push(dropdownItem);
-  }
+  for (let i = FIRST_PAGE_PARAM; i <= pagesAmount; i++) {}
 
   return buildDropdownMenu(dropdownItems, pageFromUrl, options);
killedBy: doBuildPaginationItems should match snapshot (mobile)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (mobile) 1` mismatched

[Killed] ConditionalExpression
blog/helpers/functions/paginationWidget.tsx:171:22
   if (pagesAmount === 1) return null;
 
   for (let i = FIRST_PAGE_PARAM; i <= pagesAmount; i++) {
-    const isActive = pageFromUrl === i;
+    const isActive = false;
     const href = getItemHref(i, pathname, searchParams, pageKey);
 
killedBy: doBuildPaginationItems should match snapshot (mobile)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (mobile) 1` mismatched

[Killed] EqualityOperator
blog/helpers/functions/paginationWidget.tsx:171:22
   if (pagesAmount === 1) return null;
 
   for (let i = FIRST_PAGE_PARAM; i <= pagesAmount; i++) {
-    const isActive = pageFromUrl === i;
+    const isActive = pageFromUrl !== i;
     const href = getItemHref(i, pathname, searchParams, pageKey);
 
killedBy: doBuildPaginationItems should match snapshot (mobile)
statusReason: Snapshot `doBuildPaginationItems > should match snapshot (mobile) 1` mismatched

[Killed] ArrowFunction
blog/helpers/functions/paginationWidget.tsx:175:34
     const href = getItemHref(i, pathname, searchParams, pageKey);
 
     const dropdownItem = (
-      <DropdownMenuItem onClick={(event) => dispatchClickOnLinkOrButtonFirstChild(event.target)} className="h-10 p-0" key={`page-${i}`}>
+      <DropdownMenuItem onClick={() => undefined} className="h-10 p-0" key={`page-${i}`}>
         <Link
           className={cn('flex h-full w-full items-center justify-center border-none px-2 text-center font-bold', {
killedBy: doBuildPaginationItems should match snapshot (mobile)
statusReason: expected "dispatchClickOnLinkOrButtonFirstChild" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
blog/helpers/functions/paginationWidget.tsx:177:114
     const dropdownItem = (
       <DropdownMenuItem onClick={(event) => dispatchClickOnLinkOrButtonFirstChild(event.target)} className="h-10 p-0" key={`page-${i}`}>
         <Link
-          className={cn('flex h-full w-full items-center justify-center border-none px-2 text-center font-bold', {
-            'rounded-md bg-primary': isActive
-          })}
+          className={cn('flex h-full w-full items-center justify-center border-none px-2 text-center font-bold', {})}
           aria-current={isActive ? 'page' : undefined}
           title={String(i)}
killedBy: buildBottomRightWidgets should match snapshot
statusReason: Snapshot `buildBottomRightWidgets > should match snapshot 1` mismatched

[Killed] EqualityOperator
blog/helpers/functions/paginationWidget.tsx:208:22
     : buildPaginationItemsForMobile(pagesAmount, currentPage, pathname, searchParams, pageKey);
 
 export const buildPreviousBtn = (prevBtnPageId: Count, pathname: AppPath, searchParams: URLSearchParams, currentPage: Count, pageKey: string) => {
-  const isDisabled = currentPage <= FIRST_PAGE_PARAM;
+  const isDisabled = currentPage < FIRST_PAGE_PARAM;
 
   return (
killedBy: buildPreviousBtn should build a disabled previousBtn, given a currentPage equal to FIRST_PAGE_PARAM
statusReason: expected 'max-lg:h-10 max-lg:w-10 max-lg:p-0' to include 'pointer-events-none'

[Killed] EqualityOperator
blog/helpers/functions/paginationWidget.tsx:208:22
     : buildPaginationItemsForMobile(pagesAmount, currentPage, pathname, searchParams, pageKey);
 
 export const buildPreviousBtn = (prevBtnPageId: Count, pathname: AppPath, searchParams: URLSearchParams, currentPage: Count, pageKey: string) => {
-  const isDisabled = currentPage <= FIRST_PAGE_PARAM;
+  const isDisabled = currentPage > FIRST_PAGE_PARAM;
 
   return (
killedBy: buildPreviousBtn should build a disabled previousBtn, given a currentPage equal to FIRST_PAGE_PARAM
statusReason: expected 'max-lg:h-10 max-lg:w-10 max-lg:p-0' to include 'pointer-events-none'

[Killed] EqualityOperator
blog/helpers/functions/paginationWidget.tsx:212:59
 
   return (
     <PaginationPrevious
-      href={pathname + createURLSearchParams({ [pageKey]: prevBtnPageId <= FIRST_PAGE_PARAM ? null : prevBtnPageId }, searchParams)}
+      href={pathname + createURLSearchParams({ [pageKey]: prevBtnPageId > FIRST_PAGE_PARAM ? null : prevBtnPageId }, searchParams)}
       className={cn('max-lg:h-10 max-lg:w-10 max-lg:p-0', { 'pointer-events-none opacity-50': isDisabled })}
       aria-disabled={isDisabled}
killedBy: buildPreviousBtn should build an active previousBtn with cleaned page param, given a currentPage just bigger than FIRST_PAGE_PARAM
statusReason: expected 'pathname?foo=bar&bar=bar&baz=baz&page…' to be 'pathname?foo=bar&bar=bar&baz=baz' // Object.is equality

[Killed] ConditionalExpression
blog/helpers/functions/paginationWidget.tsx:212:59
 
   return (
     <PaginationPrevious
-      href={pathname + createURLSearchParams({ [pageKey]: prevBtnPageId <= FIRST_PAGE_PARAM ? null : prevBtnPageId }, searchParams)}
+      href={pathname + createURLSearchParams({ [pageKey]: false ? null : prevBtnPageId }, searchParams)}
       className={cn('max-lg:h-10 max-lg:w-10 max-lg:p-0', { 'pointer-events-none opacity-50': isDisabled })}
       aria-disabled={isDisabled}
killedBy: buildPreviousBtn should build an active previousBtn with cleaned page param, given a currentPage just bigger than FIRST_PAGE_PARAM
statusReason: expected 'pathname?foo=bar&bar=bar&baz=baz&page…' to be 'pathname?foo=bar&bar=bar&baz=baz' // Object.is equality

[Killed] ObjectLiteral
blog/helpers/functions/paginationWidget.tsx:213:59
   return (
     <PaginationPrevious
       href={pathname + createURLSearchParams({ [pageKey]: prevBtnPageId <= FIRST_PAGE_PARAM ? null : prevBtnPageId }, searchParams)}
-      className={cn('max-lg:h-10 max-lg:w-10 max-lg:p-0', { 'pointer-events-none opacity-50': isDisabled })}
+      className={cn('max-lg:h-10 max-lg:w-10 max-lg:p-0', {})}
       aria-disabled={isDisabled}
     />
killedBy: buildPreviousBtn should build a disabled previousBtn, given a currentPage equal to FIRST_PAGE_PARAM
statusReason: expected 'max-lg:h-10 max-lg:w-10 max-lg:p-0' to include 'pointer-events-none'

[Killed] EqualityOperator
blog/helpers/functions/paginationWidget.tsx:227:22
   pagesAmount: Quantity,
   pageKey: string
 ) => {
-  const isDisabled = currentPage >= pagesAmount;
+  const isDisabled = currentPage > pagesAmount;
 
   return (
killedBy: buildNextBtn should build a disabled nextBtn, given a currentPage equal to pagesAmount
statusReason: expected 'max-lg:h-10 max-lg:w-10 max-lg:p-0' to include 'pointer-events-none'

[Killed] EqualityOperator
blog/helpers/functions/paginationWidget.tsx:227:22
   pagesAmount: Quantity,
   pageKey: string
 ) => {
-  const isDisabled = currentPage >= pagesAmount;
+  const isDisabled = currentPage < pagesAmount;
 
   return (
killedBy: buildNextBtn should build a disabled nextBtn, given a currentPage bigger than pagesAmount
statusReason: expected 'max-lg:h-10 max-lg:w-10 max-lg:p-0' to include 'pointer-events-none'

[Survived] StringLiteral
blog/helpers/functions/paginationWidget.tsx:231:21
 
   return (
     <PaginationNext
-      className={cn('max-lg:h-10 max-lg:w-10 max-lg:p-0', { 'pointer-events-none opacity-50': isDisabled })}
+      className={cn("", { 'pointer-events-none opacity-50': isDisabled })}
       href={pathname + createURLSearchParams({ [pageKey]: nextBtnPageId }, searchParams)}
       aria-disabled={isDisabled}
