[NoCoverage] MethodExpression
src/components/phantoms/NotFoundCatchall.ts:15:36
   const pathname = usePathname();
   const pathnameUnknownPart = params[NotFoundTaxonomy.NOT_FOUND].join('/');
   // eslint-disable-next-line no-magic-numbers
-  const computedRedirectPathname = pathname.slice(0, -pathnameUnknownPart.length);
+  const computedRedirectPathname = pathname;
   redirect(computedRedirectPathname, RedirectType.replace);
 };

[NoCoverage] UnaryOperator
src/components/phantoms/NotFoundCatchall.ts:15:54
   const pathname = usePathname();
   const pathnameUnknownPart = params[NotFoundTaxonomy.NOT_FOUND].join('/');
   // eslint-disable-next-line no-magic-numbers
-  const computedRedirectPathname = pathname.slice(0, -pathnameUnknownPart.length);
+  const computedRedirectPathname = pathname.slice(0, +pathnameUnknownPart.length);
   redirect(computedRedirectPathname, RedirectType.replace);
 };
