[NoCoverage] BooleanLiteral
src/components/ui/Footer.tsx:20:61
 const FooterHeadline: FunctionComponent = () => {
   const [heart, setHeart] = useState<string>('❤️');
   const [nextHeart, setNextHeart] = useState<string>('❤️');
-  const [heartToggler, setHeartToggler] = useState<boolean>(true);
+  const [heartToggler, setHeartToggler] = useState<boolean>(false);
   // eslint-disable-next-line no-magic-numbers
   const [heartContainerWidthInPx, setHeartContainerWidthInPx] = useState<number>(0);

[NoCoverage] ArrayDeclaration
src/components/ui/Footer.tsx:24:48
   // eslint-disable-next-line no-magic-numbers
   const [heartContainerWidthInPx, setHeartContainerWidthInPx] = useState<number>(0);
 
-  const heartsCollectionRef = useRef<string[]>(['❤️', '🧡', '💛', '💚', '💙', '💜', '💕', '💓', '💗', '💖']);
+  const heartsCollectionRef = useRef<string[]>([]
   const heartRef = useRef<string>(heart);
   const nextHeartRef = useRef<string>(nextHeart);

[NoCoverage] StringLiteral
src/components/ui/Footer.tsx:24:61
   // eslint-disable-next-line no-magic-numbers
   const [heartContainerWidthInPx, setHeartContainerWidthInPx] = useState<number>(0);
 
-  const heartsCollectionRef = useRef<string[]>(['❤️', '🧡', '💛', '💚', '💙', '💜', '💕', '💓', '💗', '💖']);
+  const heartsCollectionRef = useRef<string[]>(['❤️', '🧡', '""'💚', '💙', '💜', '💕', '💓', '💗', '💖']);
   const heartRef = useRef<string>(heart);
   const nextHeartRef = useRef<string>(nextHeart);

[NoCoverage] StringLiteral
src/components/ui/Footer.tsx:33:53
   const secondHeartRef = useRef<MaybeNull<HTMLSpanElement>>(null);
 
   const scopedT = useScopedI18n(i18ns.vocab);
-  const footerCopy = scopedT('footer-copy').replace('❤️', '');
+  const footerCopy = scopedT('footer-copy').replace("", '');
 
   const pickRandomHeart = useCallback(() => {

[NoCoverage] StringLiteral
src/components/ui/Footer.tsx:33:59
   const secondHeartRef = useRef<MaybeNull<HTMLSpanElement>>(null);
 
   const scopedT = useScopedI18n(i18ns.vocab);
-  const footerCopy = scopedT('footer-copy').replace('❤️', '');
+  const footerCopy = scopedT('footer-copy').replace('❤️', "Stryker was here!");
 
   const pickRandomHeart = useCallback(() => {

[NoCoverage] ConditionalExpression
src/components/ui/Footer.tsx:37:9
 
   const pickRandomHeart = useCallback(() => {
     const hearts = getRefCurrentPtr(heartsCollectionRef);
-    if (!hearts) return '❤️';
+    if (true) return '❤️';
     return hearts[Math.floor(Math.random() * hearts.length)];
   }, []);

[NoCoverage] ConditionalExpression
src/components/ui/Footer.tsx:37:9
 
   const pickRandomHeart = useCallback(() => {
     const hearts = getRefCurrentPtr(heartsCollectionRef);
-    if (!hearts) return '❤️';
+    if (false) return '❤️';
     return hearts[Math.floor(Math.random() * hearts.length)];
   }, []);

[NoCoverage] ArithmeticOperator
src/components/ui/Footer.tsx:38:30
   const pickRandomHeart = useCallback(() => {
     const hearts = getRefCurrentPtr(heartsCollectionRef);
     if (!hearts) return '❤️';
-    return hearts[Math.floor(Math.random() * hearts.length)];
+    return hearts[Math.floor(Math.random() / hearts.length)];
   }, []);
 

[NoCoverage] BlockStatement
src/components/ui/Footer.tsx:41:19
     return hearts[Math.floor(Math.random() * hearts.length)];
   }, []);
 
-  useEffect(() => {
-    function heartsEffectHandler() {
-      let newHeart = pickRandomHeart();
-
-      const heartToggler = getRefCurrentPtr(heartTogglerRef);
-      const [heart, nextHeart] = [getRefCurrentPtr(heartRef), getRefCurrentPtr(nextHeartRef)];
-
-      const oldHeart = heartToggler ? nextHeart : heart;
-
-      while (newHeart === oldHeart) newHeart = pickRandomHeart();
-
-      if (heartToggler) setHeart(newHeart);
-      else setNextHeart(newHeart);
-
-      setHeartToggler(!heartToggler);
-    }
-
-    const interval = setInterval(() => {
-      heartsEffectHandler();
-    }, INTERVAL_DURATION);
-
-    return () => clearInterval(interval);
-  }, [pickRandomHeart]);
+  useEffect(() => {}, [pickRandomHeart]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/components/ui/Footer.tsx:42:36
   }, []);
 
   useEffect(() => {
-    function heartsEffectHandler() {
-      let newHeart = pickRandomHeart();
-
-      const heartToggler = getRefCurrentPtr(heartTogglerRef);
-      const [heart, nextHeart] = [getRefCurrentPtr(heartRef), getRefCurrentPtr(nextHeartRef)];
-
-      const oldHeart = heartToggler ? nextHeart : heart;
-
-      while (newHeart === oldHeart) newHeart = pickRandomHeart();
-
-      if (heartToggler) setHeart(newHeart);
-      else setNextHeart(newHeart);
-
-      setHeartToggler(!heartToggler);
-    }
+    function heartsEffectHandler() {}
 
     const interval = setInterval(() => {

[NoCoverage] ConditionalExpression
src/components/ui/Footer.tsx:50:14
 
       const oldHeart = heartToggler ? nextHeart : heart;
 
-      while (newHeart === oldHeart) newHeart = pickRandomHeart();
+      while (false) newHeart = pickRandomHeart();
 
       if (heartToggler) setHeart(newHeart);

[NoCoverage] EqualityOperator
src/components/ui/Footer.tsx:50:14
 
       const oldHeart = heartToggler ? nextHeart : heart;
 
-      while (newHeart === oldHeart) newHeart = pickRandomHeart();
+      while (newHeart !== oldHeart) newHeart = pickRandomHeart();
 
       if (heartToggler) setHeart(newHeart);

[NoCoverage] ConditionalExpression
src/components/ui/Footer.tsx:52:11
 
       while (newHeart === oldHeart) newHeart = pickRandomHeart();
 
-      if (heartToggler) setHeart(newHeart);
+      if (true) setHeart(newHeart);
       else setNextHeart(newHeart);
 

[NoCoverage] ConditionalExpression
src/components/ui/Footer.tsx:52:11
 
       while (newHeart === oldHeart) newHeart = pickRandomHeart();
 
-      if (heartToggler) setHeart(newHeart);
+      if (false) setHeart(newHeart);
       else setNextHeart(newHeart);
 

[NoCoverage] BooleanLiteral
src/components/ui/Footer.tsx:55:23
       if (heartToggler) setHeart(newHeart);
       else setNextHeart(newHeart);
 
-      setHeartToggler(!heartToggler);
+      setHeartToggler(heartToggler);
     }
 

[NoCoverage] BlockStatement
src/components/ui/Footer.tsx:58:40
       setHeartToggler(!heartToggler);
     }
 
-    const interval = setInterval(() => {
-      heartsEffectHandler();
-    }, INTERVAL_DURATION);
+    const interval = setInterval(() => {}, INTERVAL_DURATION);
 
     return () => clearInterval(interval);

[NoCoverage] ArrowFunction
src/components/ui/Footer.tsx:62:12
       heartsEffectHandler();
     }, INTERVAL_DURATION);
 
-    return () => clearInterval(interval);
+    return () => undefined;
   }, [pickRandomHeart]);
 

[NoCoverage] BlockStatement
src/components/ui/Footer.tsx:65:19
     return () => clearInterval(interval);
   }, [pickRandomHeart]);
 
-  useEffect(() => {
-    heartTogglerRef.current = heartToggler;
-    heartRef.current = heart;
-    nextHeartRef.current = nextHeart;
-  }, [heartToggler, heart, nextHeart]);
+  useEffect(() => {}, [heartToggler, heart, nextHeart]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/components/ui/Footer.tsx:71:19
     nextHeartRef.current = nextHeart;
   }, [heartToggler, heart, nextHeart]);
 
-  useEffect(() => {
-    const firstHeartInstance = getRefCurrentPtr(firstHeartRef);
-    const secondHeartInstance = getRefCurrentPtr(secondHeartRef);
-
-    if (firstHeartInstance === null || secondHeartInstance === null) return;
-
-    if (heartToggler) setHeartContainerWidthInPx(secondHeartInstance.getBoundingClientRect().width);
-    else setHeartContainerWidthInPx(firstHeartInstance.getBoundingClientRect().width);
-  }, [heartToggler]);
+  useEffect(() => {}, [heartToggler]);
 
   return (

[NoCoverage] ConditionalExpression
src/components/ui/Footer.tsx:75:9
     const firstHeartInstance = getRefCurrentPtr(firstHeartRef);
     const secondHeartInstance = getRefCurrentPtr(secondHeartRef);
 
-    if (firstHeartInstance === null || secondHeartInstance === null) return;
+    if (false) return;
 
     if (heartToggler) setHeartContainerWidthInPx(secondHeartInstance.getBoundingClientRect().width);

[NoCoverage] ConditionalExpression
src/components/ui/Footer.tsx:75:9
     const firstHeartInstance = getRefCurrentPtr(firstHeartRef);
     const secondHeartInstance = getRefCurrentPtr(secondHeartRef);
 
-    if (firstHeartInstance === null || secondHeartInstance === null) return;
+    if (false || secondHeartInstance === null) return;
 
     if (heartToggler) setHeartContainerWidthInPx(secondHeartInstance.getBoundingClientRect().width);

[NoCoverage] ConditionalExpression
src/components/ui/Footer.tsx:77:9
 
     if (firstHeartInstance === null || secondHeartInstance === null) return;
 
-    if (heartToggler) setHeartContainerWidthInPx(secondHeartInstance.getBoundingClientRect().width);
+    if (true) setHeartContainerWidthInPx(secondHeartInstance.getBoundingClientRect().width);
     else setHeartContainerWidthInPx(firstHeartInstance.getBoundingClientRect().width);
   }, [heartToggler]);

[NoCoverage] ConditionalExpression
src/components/ui/Footer.tsx:77:9
 
     if (firstHeartInstance === null || secondHeartInstance === null) return;
 
-    if (heartToggler) setHeartContainerWidthInPx(secondHeartInstance.getBoundingClientRect().width);
+    if (false) setHeartContainerWidthInPx(secondHeartInstance.getBoundingClientRect().width);
     else setHeartContainerWidthInPx(firstHeartInstance.getBoundingClientRect().width);
   }, [heartToggler]);

[NoCoverage] ArrayDeclaration
src/components/ui/Footer.tsx:79:6
 
     if (heartToggler) setHeartContainerWidthInPx(secondHeartInstance.getBoundingClientRect().width);
     else setHeartContainerWidthInPx(firstHeartInstance.getBoundingClientRect().width);
-  }, [heartToggler]);
+  }, []);
 
   return (

[NoCoverage] ConditionalExpression
src/components/ui/Footer.tsx:86:24
       <span
         className={cn('opacity-100 transition-opacity delay-75 duration-500', {
           // eslint-disable-next-line no-magic-numbers
-          'opacity-0': heartContainerWidthInPx === 0
+          'opacity-0': true
         })}
       >

[NoCoverage] EqualityOperator
src/components/ui/Footer.tsx:86:24
       <span
         className={cn('opacity-100 transition-opacity delay-75 duration-500', {
           // eslint-disable-next-line no-magic-numbers
-          'opacity-0': heartContainerWidthInPx === 0
+          'opacity-0': heartContainerWidthInPx !== 0
         })}
       >

[NoCoverage] ObjectLiteral
src/components/ui/Footer.tsx:92:89
         {footerCopy}
       </span>
       <span
-        className={cn('relative opacity-100 transition-opacity delay-200 duration-500', {
-          // eslint-disable-next-line no-magic-numbers
-          'opacity-0': heartContainerWidthInPx === 0
-        })}
+        className={cn('relative opacity-100 transition-opacity delay-200 duration-500', {})}
         style={{ width: heartContainerWidthInPx + 'px' }}
       >

[NoCoverage] ConditionalExpression
src/components/ui/Footer.tsx:94:24
       <span
         className={cn('relative opacity-100 transition-opacity delay-200 duration-500', {
           // eslint-disable-next-line no-magic-numbers
-          'opacity-0': heartContainerWidthInPx === 0
+          'opacity-0': false
         })}
         style={{ width: heartContainerWidthInPx + 'px' }}

[NoCoverage] StringLiteral
src/components/ui/Footer.tsx:99:25
         style={{ width: heartContainerWidthInPx + 'px' }}
       >
         <span
-          className={cn('absolute bottom-0 left-0 right-0 top-0 w-fit opacity-100 transition-opacity duration-700', {
+          className={cn("", {
             'opacity-0': heartToggler
           })}

[NoCoverage] StringLiteral
src/components/ui/Footer.tsx:108:25
           &nbsp;{heart}
         </span>
         <span
-          className={cn('absolute bottom-0 left-0 right-0 top-0 z-10 w-fit opacity-100 transition-opacity duration-700', {
+          className={cn("", {
             'opacity-0': !heartToggler
           })}

[NoCoverage] BooleanLiteral
src/components/ui/Footer.tsx:109:26
         </span>
         <span
           className={cn('absolute bottom-0 left-0 right-0 top-0 z-10 w-fit opacity-100 transition-opacity duration-700', {
-            'opacity-0': !heartToggler
+            'opacity-0': heartToggler
           })}
           aria-hidden={!heartToggler}

[NoCoverage] BooleanLiteral
src/components/ui/Footer.tsx:111:24
           className={cn('absolute bottom-0 left-0 right-0 top-0 z-10 w-fit opacity-100 transition-opacity duration-700', {
             'opacity-0': !heartToggler
           })}
-          aria-hidden={!heartToggler}
+          aria-hidden={heartToggler}
           ref={secondHeartRef}
         >

[NoCoverage] ArrowFunction
src/components/ui/Footer.tsx:121:48
   );
 };
 
-const Footer: FunctionComponent<FooterProps> = () => (
-  <footer
-    className="z-10 flex min-h-20 flex-col items-center justify-center border-t-[1px] border-transparent bg-black text-center text-white dark:border-card dark:bg-black"
-    data-pagefind-ignore="all"
-    id={FOOTER_CONTAINER_ID}
-  >
-    <FooterHeadline />
-  </footer>
-);
+const Footer: FunctionComponent<FooterProps> = () => undefined;
 
 export default Footer;
