[NoCoverage] BooleanLiteral
components/ui/blog/CopyToClipboard.tsx:19:51
 const CopyToClipboard: FunctionComponent<CopyToClipboardProps> = ({ children }) => {
   const textInputRef = useRef<HTMLDivElement>(null);
   const copyBtnRef = useRef<HTMLButtonElement>(null);
-  const [hovered, setHovered] = useState<boolean>(false);
+  const [hovered, setHovered] = useState<boolean>(true);
   const [focused, setFocused] = useState<boolean>(false);
   const [copied, setCopied] = useState<boolean>(false);

[NoCoverage] BooleanLiteral
components/ui/blog/CopyToClipboard.tsx:20:51
   const textInputRef = useRef<HTMLDivElement>(null);
   const copyBtnRef = useRef<HTMLButtonElement>(null);
   const [hovered, setHovered] = useState<boolean>(false);
-  const [focused, setFocused] = useState<boolean>(false);
+  const [focused, setFocused] = useState<boolean>(true);
   const [copied, setCopied] = useState<boolean>(false);
   const globalT = getClientSideI18n();

[NoCoverage] BooleanLiteral
components/ui/blog/CopyToClipboard.tsx:21:49
   const copyBtnRef = useRef<HTMLButtonElement>(null);
   const [hovered, setHovered] = useState<boolean>(false);
   const [focused, setFocused] = useState<boolean>(false);
-  const [copied, setCopied] = useState<boolean>(false);
+  const [copied, setCopied] = useState<boolean>(true);
   const globalT = getClientSideI18n();
 

[NoCoverage] BooleanLiteral
components/ui/blog/CopyToClipboard.tsx:24:41
   const [copied, setCopied] = useState<boolean>(false);
   const globalT = getClientSideI18n();
 
-  const onMouseEnter = () => setHovered(true);
+  const onMouseEnter = () => setHovered(false);
   const onMouseLeave = () => {
     setHovered(false);

[NoCoverage] ArrowFunction
components/ui/blog/CopyToClipboard.tsx:24:24
   const [copied, setCopied] = useState<boolean>(false);
   const globalT = getClientSideI18n();
 
-  const onMouseEnter = () => setHovered(true);
+  const onMouseEnter = () => undefined;
   const onMouseLeave = () => {
     setHovered(false);

[NoCoverage] BlockStatement
components/ui/blog/CopyToClipboard.tsx:25:30
   const globalT = getClientSideI18n();
 
   const onMouseEnter = () => setHovered(true);
-  const onMouseLeave = () => {
-    setHovered(false);
-  };
+  const onMouseLeave = () => {};
 
   const onFocus = () => setFocused(true);

[NoCoverage] BooleanLiteral
components/ui/blog/CopyToClipboard.tsx:26:16
 
   const onMouseEnter = () => setHovered(true);
   const onMouseLeave = () => {
-    setHovered(false);
+    setHovered(true);
   };
 

[NoCoverage] ArrowFunction
components/ui/blog/CopyToClipboard.tsx:29:19
     setHovered(false);
   };
 
-  const onFocus = () => setFocused(true);
+  const onFocus = () => undefined;
   const onBlur = () => {
     setFocused(false);

[NoCoverage] BooleanLiteral
components/ui/blog/CopyToClipboard.tsx:29:36
     setHovered(false);
   };
 
-  const onFocus = () => setFocused(true);
+  const onFocus = () => setFocused(false);
   const onBlur = () => {
     setFocused(false);

[NoCoverage] BlockStatement
components/ui/blog/CopyToClipboard.tsx:30:24
   };
 
   const onFocus = () => setFocused(true);
-  const onBlur = () => {
-    setFocused(false);
-  };
+  const onBlur = () => {};
 
   const isHidden = () => !hovered && !focused;

[NoCoverage] BooleanLiteral
components/ui/blog/CopyToClipboard.tsx:31:16
 
   const onFocus = () => setFocused(true);
   const onBlur = () => {
-    setFocused(false);
+    setFocused(true);
   };
 

[NoCoverage] ConditionalExpression
components/ui/blog/CopyToClipboard.tsx:34:26
     setFocused(false);
   };
 
-  const isHidden = () => !hovered && !focused;
+  const isHidden = () => false;
   const isShown = () => hovered || focused;
 

[NoCoverage] BooleanLiteral
components/ui/blog/CopyToClipboard.tsx:34:26
     setFocused(false);
   };
 
-  const isHidden = () => !hovered && !focused;
+  const isHidden = () => hovered && !focused;
   const isShown = () => hovered || focused;
 

[NoCoverage] ArrowFunction
components/ui/blog/CopyToClipboard.tsx:35:19
   };
 
   const isHidden = () => !hovered && !focused;
-  const isShown = () => hovered || focused;
+  const isShown = () => undefined;
 
   const onCopy = () => {

[NoCoverage] LogicalOperator
components/ui/blog/CopyToClipboard.tsx:35:25
   };
 
   const isHidden = () => !hovered && !focused;
-  const isShown = () => hovered || focused;
+  const isShown = () => hovered && focused;
 
   const onCopy = () => {

[NoCoverage] BlockStatement
components/ui/blog/CopyToClipboard.tsx:37:24
   const isHidden = () => !hovered && !focused;
   const isShown = () => hovered || focused;
 
-  const onCopy = () => {
-    let currentCoroutine: NodeJS.Timeout | null = null;
-    const textInputInstance = getRefCurrentPtr(textInputRef);
-
-    setCopied(true);
-    if (textInputInstance && textInputInstance.textContent !== null) navigator.clipboard.writeText(textInputInstance.textContent);
-    if (currentCoroutine) clearTimeout(currentCoroutine);
-
-    currentCoroutine = setTimeout(() => {
-      if (!currentCoroutine) return;
-      setCopied(false);
-      const copyBtnInstance = getRefCurrentPtr(copyBtnRef);
-      if (copyBtnInstance) copyBtnInstance.blur();
-      clearTimeout(currentCoroutine);
-      currentCoroutine = null;
-    }, MS_DELAY);
-  };
+  const onCopy = () => {};
 
   return (

[NoCoverage] BooleanLiteral
components/ui/blog/CopyToClipboard.tsx:41:15
     let currentCoroutine: NodeJS.Timeout | null = null;
     const textInputInstance = getRefCurrentPtr(textInputRef);
 
-    setCopied(true);
+    setCopied(false);
     if (textInputInstance && textInputInstance.textContent !== null) navigator.clipboard.writeText(textInputInstance.textContent);
     if (currentCoroutine) clearTimeout(currentCoroutine);

[NoCoverage] BlockStatement
components/ui/blog/CopyToClipboard.tsx:45:41
     if (textInputInstance && textInputInstance.textContent !== null) navigator.clipboard.writeText(textInputInstance.textContent);
     if (currentCoroutine) clearTimeout(currentCoroutine);
 
-    currentCoroutine = setTimeout(() => {
-      if (!currentCoroutine) return;
-      setCopied(false);
-      const copyBtnInstance = getRefCurrentPtr(copyBtnRef);
-      if (copyBtnInstance) copyBtnInstance.blur();
-      clearTimeout(currentCoroutine);
-      currentCoroutine = null;
-    }, MS_DELAY);
+    currentCoroutine = setTimeout(() => {}, MS_DELAY);
   };
 

[NoCoverage] BooleanLiteral
components/ui/blog/CopyToClipboard.tsx:47:17
 
     currentCoroutine = setTimeout(() => {
       if (!currentCoroutine) return;
-      setCopied(false);
+      setCopied(true);
       const copyBtnInstance = getRefCurrentPtr(copyBtnRef);
       if (copyBtnInstance) copyBtnInstance.blur();

[NoCoverage] ConditionalExpression
components/ui/blog/CopyToClipboard.tsx:49:11
       if (!currentCoroutine) return;
       setCopied(false);
       const copyBtnInstance = getRefCurrentPtr(copyBtnRef);
-      if (copyBtnInstance) copyBtnInstance.blur();
+      if (false) copyBtnInstance.blur();
       clearTimeout(currentCoroutine);
       currentCoroutine = null;

[NoCoverage] ConditionalExpression
components/ui/blog/CopyToClipboard.tsx:49:11
       if (!currentCoroutine) return;
       setCopied(false);
       const copyBtnInstance = getRefCurrentPtr(copyBtnRef);
-      if (copyBtnInstance) copyBtnInstance.blur();
+      if (true) copyBtnInstance.blur();
       clearTimeout(currentCoroutine);
       currentCoroutine = null;

[NoCoverage] StringLiteral
components/ui/blog/CopyToClipboard.tsx:59:25
     <div className="code-block relative" onMouseEnter={onMouseEnter} onMouseLeave={onMouseLeave} ref={textInputRef}>
       {
         <button
-          className={cn('absolute right-2 top-2 h-8 w-8 rounded border-2 bg-gray-700 p-1 transition-[opacity] dark:bg-gray-800', {
+          className={cn("", {
             'border-green-400 focus:border-green-400 focus:outline-none': copied,
             'opacity-0 delay-200': isHidden(),

[NoCoverage] BooleanLiteral
components/ui/blog/CopyToClipboard.tsx:62:38
           className={cn('absolute right-2 top-2 h-8 w-8 rounded border-2 bg-gray-700 p-1 transition-[opacity] dark:bg-gray-800', {
             'border-green-400 focus:border-green-400 focus:outline-none': copied,
             'opacity-0 delay-200': isHidden(),
-            'hover:border-gray-300': !copied,
+            'hover:border-gray-300': copied,
             'opacity-100': isShown()
           })}
