[NoCoverage] LogicalOperator
components/ui/blog/DraftBadge.tsx:17:21
 
 const DraftBadge: FunctionComponent<DraftBadgeProps> = ({ className: classNameValue }) => {
   const scopedT = useScopedI18n(i18ns.vocab);
-  const className = classNameValue ?? '';
+  const className = classNameValue && '';
 
   return (
