[NoCoverage] MethodExpression
components/ui/blog/tagsGenerator.tsx:13:37
   scopedT,
   tags
 }: { scopedT: Awaited<ReturnType<typeof getScopedI18n<typeof i18ns.blogTags>>> } & Pick<BlogPostType, 'language' | 'tags'>): ReactElement[] {
-  const sortedTagsByCurrentLocale = tags.sort((a, b) => a.localeCompare(b, language));
+  const sortedTagsByCurrentLocale = tags;
   return sortedTagsByCurrentLocale.map((tag) => <Badge key={tag}>{scopedT(tag)}</Badge>);
 }
