[NoCoverage] LogicalOperator
blog/toc/desktop/BlogPostTocCollapseButton.tsx:29:21
   isCollapsed,
   isDisabled
 }) => {
-  const className = classNameValue ?? '';
+  const className = classNameValue && '';
 
   const tocCollapseBtnIconClassList = isCollapsed ? btnIconIsActiveClassList : btnIconIsNotActiveClassList;

[NoCoverage] StringLiteral
blog/toc/desktop/BlogPostTocCollapseButton.tsx:29:39
   isCollapsed,
   isDisabled
 }) => {
-  const className = classNameValue ?? '';
+  const className = classNameValue ?? "Stryker was here!";
 
   const tocCollapseBtnIconClassList = isCollapsed ? btnIconIsActiveClassList : btnIconIsNotActiveClassList;

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocCollapseButton.tsx:42:8
 
   return (
     <div className="h-0">
-      {(!isDisabled && (
-        <button
-          className={cn(tocCollapseBtnClassList, 'hidden lg:inline', className)}
-          style={{ height: COLLAPSE_BUTTON_HEIGTH_IN_PX + 'px' }}
-          onClick={() => setIsCollapsed(!isCollapsed)}
-          aria-expanded={ariaExpanded}
-          aria-label={ariaLabel}
-          type={type}
-        >
-          <ArrowDownIcon className={tocCollapseBtnIconClassList} />
-        </button>
-      )) || (
-        <div
-          className={cn(tocCollapseBtnClassList, 'hidden cursor-default lg:inline', className)}
-          style={{ height: COLLAPSE_BUTTON_HEIGTH_IN_PX + 'px' }}
-          aria-hidden="true"
-        >
-          <ArrowDownIcon className={tocCollapseBtnIconClassList} />
-        </div>
-      )}
+      {true}
     </div>
   );

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocCollapseButton.tsx:42:9
 
   return (
     <div className="h-0">
-      {(!isDisabled && (
+      {(isDisabled && (
         <button
           className={cn(tocCollapseBtnClassList, 'hidden lg:inline', className)}

[NoCoverage] StringLiteral
blog/toc/desktop/BlogPostTocCollapseButton.tsx:45:59
       {(!isDisabled && (
         <button
           className={cn(tocCollapseBtnClassList, 'hidden lg:inline', className)}
-          style={{ height: COLLAPSE_BUTTON_HEIGTH_IN_PX + 'px' }}
+          style={{ height: COLLAPSE_BUTTON_HEIGTH_IN_PX + "" }}
           onClick={() => setIsCollapsed(!isCollapsed)}
           aria-expanded={ariaExpanded}

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocCollapseButton.tsx:46:41
         <button
           className={cn(tocCollapseBtnClassList, 'hidden lg:inline', className)}
           style={{ height: COLLAPSE_BUTTON_HEIGTH_IN_PX + 'px' }}
-          onClick={() => setIsCollapsed(!isCollapsed)}
+          onClick={() => setIsCollapsed(isCollapsed)}
           aria-expanded={ariaExpanded}
           aria-label={ariaLabel}

[NoCoverage] ArrowFunction
blog/toc/desktop/BlogPostTocCollapseButton.tsx:46:20
         <button
           className={cn(tocCollapseBtnClassList, 'hidden lg:inline', className)}
           style={{ height: COLLAPSE_BUTTON_HEIGTH_IN_PX + 'px' }}
-          onClick={() => setIsCollapsed(!isCollapsed)}
+          onClick={() => undefined}
           aria-expanded={ariaExpanded}
           aria-label={ariaLabel}

[NoCoverage] StringLiteral
blog/toc/desktop/BlogPostTocCollapseButton.tsx:56:59
       )) || (
         <div
           className={cn(tocCollapseBtnClassList, 'hidden cursor-default lg:inline', className)}
-          style={{ height: COLLAPSE_BUTTON_HEIGTH_IN_PX + 'px' }}
+          style={{ height: COLLAPSE_BUTTON_HEIGTH_IN_PX + "" }}
           aria-hidden="true"
         >
