[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktop.tsx:9:89
 
 import type { SharedBlogPostTocProps } from '../types';
 
-const BlogPostTocDesktopLazy = dynamic(() => import('./BlogPostTocDesktopLazy'), { ssr: false });
+const BlogPostTocDesktopLazy = dynamic(() => import('./BlogPostTocDesktopLazy'), { ssr: true });
 
 const BlogPostTocDesktop: FunctionComponent<SharedBlogPostTocProps> = ({ headings }) => {
