[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:31:38
 // eslint-disable-next-line no-magic-numbers
 const navbarHeight: PxValue = navbarElement ? navbarElement.getBoundingClientRect().height : 0;
 // eslint-disable-next-line no-magic-numbers
-const BOTTOM_DEAD_ZONE_PX: PxValue = navbarHeight * 2;
+const BOTTOM_DEAD_ZONE_PX: PxValue = navbarHeight / 2;
 const TOP_DEAD_ZONE_PX: PxValue = navbarHeight;
 

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:39:23
 const TOC_SCROLL_TOP_OFFSET_IN_PX: PxValue = 172;
 
 // eslint-disable-next-line no-magic-numbers
-const isAtTop = () => window.scrollY === 0;
+const isAtTop = () => false;
 
 const getTotalVerticalScrollDistance = () => Math.ceil(window.scrollY + window.innerHeight);

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:39:23
 const TOC_SCROLL_TOP_OFFSET_IN_PX: PxValue = 172;
 
 // eslint-disable-next-line no-magic-numbers
-const isAtTop = () => window.scrollY === 0;
+const isAtTop = () => true;
 
 const getTotalVerticalScrollDistance = () => Math.ceil(window.scrollY + window.innerHeight);

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:41:56
 // eslint-disable-next-line no-magic-numbers
 const isAtTop = () => window.scrollY === 0;
 
-const getTotalVerticalScrollDistance = () => Math.ceil(window.scrollY + window.innerHeight);
+const getTotalVerticalScrollDistance = () => Math.ceil(window.scrollY - window.innerHeight);
 
 const getAllDocumentHeadingsFromDOM = () => Array.from(document.querySelectorAll('h1, h2, h3, h4, h5, h6')) as HTMLElement[];

[NoCoverage] StringLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:59:69
   const router = useRouter();
   const isLargeScreen = useIsLargeScreen();
   const [scrollDirection, setScrollDirection] = useScrollDirection();
-  const [currentHeading, setCurrentHeading] = useState<HeadingSlug>('');
+  const [currentHeading, setCurrentHeading] = useState<HeadingSlug>("Stryker was here!");
 
   const lastScrollY = useRef<PxValue>(window.scrollY);

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:65:53
   const headingsRef = useRef<HTMLOListElement>(null);
   const tocRef = useRef<HTMLDivElement>(null);
   const forcedHeadingSlugRef = useRef<HeadingSlug>('');
-  const muteUpdatesUntilScrollEnd = useRef<boolean>(false);
+  const muteUpdatesUntilScrollEnd = useRef<boolean>(true);
   const muteScrollEndNextDoubleCheck = useRef<boolean>(false);
 

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:66:56
   const tocRef = useRef<HTMLDivElement>(null);
   const forcedHeadingSlugRef = useRef<HeadingSlug>('');
   const muteUpdatesUntilScrollEnd = useRef<boolean>(false);
-  const muteScrollEndNextDoubleCheck = useRef<boolean>(false);
+  const muteScrollEndNextDoubleCheck = useRef<boolean>(true);
 
   const handleScrollUpRef = useRef<MaybeNull<(currentScrollY: PxValue, oldScrollY: PxValue, forced?: boolean) => void>>(null);

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:82:77
   }, [headings]);
 
   const headingsFromDOM = useMemo(
-    () => getAllDocumentHeadingsFromDOM().filter((heading) => heading.id && slugAndIndexAssoc[heading.id] !== undefined),
+    () => getAllDocumentHeadingsFromDOM().filter((heading) => heading.id && slugAndIndexAssoc[heading.id] === undefined),
     [slugAndIndexAssoc]
   );

[NoCoverage] MethodExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:82:11
   }, [headings]);
 
   const headingsFromDOM = useMemo(
-    () => getAllDocumentHeadingsFromDOM().filter((heading) => heading.id && slugAndIndexAssoc[heading.id] !== undefined),
+    () => getAllDocumentHeadingsFromDOM(),
     [slugAndIndexAssoc]
   );

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:88:49
 
   const mdxBodyFromDOM = useMemo(() => getMdxBodyFromDOM(), []);
 
-  const dropOldHeadingFocus = useCallback(() => {
-    const headingsRefInstance = getRefCurrentPtr(headingsRef);
-    if (!headingsRefInstance) return;
-
-    const maybeCurrentlyFocusedHeadingParent: MaybeUndefined<Element> = Array.from(headingsRefInstance.children).find((headingLi) =>
-      Array.from(headingLi.children).find((child) => child === document.activeElement)
-    );
-
-    if (!maybeCurrentlyFocusedHeadingParent) return;
-    // eslint-disable-next-line no-magic-numbers
-    const maybeCurrentlyFocusedHeading = maybeCurrentlyFocusedHeadingParent.children[0] as MaybeUndefined<HTMLElement>;
-    if (maybeCurrentlyFocusedHeading) maybeCurrentlyFocusedHeading.blur();
-  }, []);
+  const dropOldHeadingFocus = useCallback(() => {}, []);
 
   const dropOldHeadingFocusAndSetCurrentHeading = useCallback(

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:90:9
 
   const dropOldHeadingFocus = useCallback(() => {
     const headingsRefInstance = getRefCurrentPtr(headingsRef);
-    if (!headingsRefInstance) return;
+    if (false) return;
 
     const maybeCurrentlyFocusedHeadingParent: MaybeUndefined<Element> = Array.from(headingsRefInstance.children).find((headingLi) =>

[NoCoverage] ArrowFunction
blog/toc/desktop/BlogPostTocDesktopInner.tsx:92:119
     const headingsRefInstance = getRefCurrentPtr(headingsRef);
     if (!headingsRefInstance) return;
 
-    const maybeCurrentlyFocusedHeadingParent: MaybeUndefined<Element> = Array.from(headingsRefInstance.children).find((headingLi) =>
-      Array.from(headingLi.children).find((child) => child === document.activeElement)
+    const maybeCurrentlyFocusedHeadingParent: MaybeUndefined<Element> = Array.from(headingsRefInstance.children).find(() => undefined
     );
 

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:93:54
     if (!headingsRefInstance) return;
 
     const maybeCurrentlyFocusedHeadingParent: MaybeUndefined<Element> = Array.from(headingsRefInstance.children).find((headingLi) =>
-      Array.from(headingLi.children).find((child) => child === document.activeElement)
+      Array.from(headingLi.children).find((child) => false)
     );
 

[NoCoverage] ArrowFunction
blog/toc/desktop/BlogPostTocDesktopInner.tsx:93:43
     if (!headingsRefInstance) return;
 
     const maybeCurrentlyFocusedHeadingParent: MaybeUndefined<Element> = Array.from(headingsRefInstance.children).find((headingLi) =>
-      Array.from(headingLi.children).find((child) => child === document.activeElement)
+      Array.from(headingLi.children).find(() => undefined)
     );
 

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:103:41
   }, []);
 
   const dropOldHeadingFocusAndSetCurrentHeading = useCallback(
-    (newCurrentHeading: HeadingSlug) => {
-      dropOldHeadingFocus();
-      setCurrentHeading(newCurrentHeading);
-    },
+    (newCurrentHeading: HeadingSlug) => {},
     [dropOldHeadingFocus]
   );

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:114:20
     let closestHeading = null;
     let closestDistance = Infinity;
     const viewportHeight = window.innerHeight;
-    const yStart = window.scrollY + viewportHeight - BOTTOM_DEAD_ZONE_PX;
+    const yStart = window.scrollY - viewportHeight - BOTTOM_DEAD_ZONE_PX;
 
     for (const heading of headingsFromDOM) {

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:114:20
     let closestHeading = null;
     let closestDistance = Infinity;
     const viewportHeight = window.innerHeight;
-    const yStart = window.scrollY + viewportHeight - BOTTOM_DEAD_ZONE_PX;
+    const yStart = window.scrollY + viewportHeight + BOTTOM_DEAD_ZONE_PX;
 
     for (const heading of headingsFromDOM) {

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:116:44
     const viewportHeight = window.innerHeight;
     const yStart = window.scrollY + viewportHeight - BOTTOM_DEAD_ZONE_PX;
 
-    for (const heading of headingsFromDOM) {
-      const distance = yStart - heading.offsetTop;
-      // eslint-disable-next-line no-magic-numbers
-      if (0 <= distance && distance <= closestDistance) {
-        closestHeading = heading;
-        closestDistance = distance;
-      }
-    }
+    for (const heading of headingsFromDOM) {}
 
     return closestHeading;

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:117:24
     const yStart = window.scrollY + viewportHeight - BOTTOM_DEAD_ZONE_PX;
 
     for (const heading of headingsFromDOM) {
-      const distance = yStart - heading.offsetTop;
+      const distance = yStart + heading.offsetTop;
       // eslint-disable-next-line no-magic-numbers
       if (0 <= distance && distance <= closestDistance) {

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:119:28
     for (const heading of headingsFromDOM) {
       const distance = yStart - heading.offsetTop;
       // eslint-disable-next-line no-magic-numbers
-      if (0 <= distance && distance <= closestDistance) {
+      if (0 <= distance && true) {
         closestHeading = heading;
         closestDistance = distance;

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:119:28
     for (const heading of headingsFromDOM) {
       const distance = yStart - heading.offsetTop;
       // eslint-disable-next-line no-magic-numbers
-      if (0 <= distance && distance <= closestDistance) {
+      if (0 <= distance && distance < closestDistance) {
         closestHeading = heading;
         closestDistance = distance;

[NoCoverage] UnaryOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:130:27
 
   const getClosestHeadingFromTop = useCallback((): MaybeNull<HTMLElement> => {
     let closestHeading = null;
-    let closestDistance = -Infinity; // Like the level of the Intersection Observer devs
+    let closestDistance = +Infinity; // Like the level of the Intersection Observer devs
     const [yMin, yMax] = [window.scrollY + TOP_DEAD_ZONE_PX, getTotalVerticalScrollDistance() - BOTTOM_DEAD_ZONE_PX];
 

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:131:27
   const getClosestHeadingFromTop = useCallback((): MaybeNull<HTMLElement> => {
     let closestHeading = null;
     let closestDistance = -Infinity; // Like the level of the Intersection Observer devs
-    const [yMin, yMax] = [window.scrollY + TOP_DEAD_ZONE_PX, getTotalVerticalScrollDistance() - BOTTOM_DEAD_ZONE_PX];
+    const [yMin, yMax] = [window.scrollY - TOP_DEAD_ZONE_PX, getTotalVerticalScrollDistance() - BOTTOM_DEAD_ZONE_PX];
 
     for (const heading of headingsFromDOM) {

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:131:62
   const getClosestHeadingFromTop = useCallback((): MaybeNull<HTMLElement> => {
     let closestHeading = null;
     let closestDistance = -Infinity; // Like the level of the Intersection Observer devs
-    const [yMin, yMax] = [window.scrollY + TOP_DEAD_ZONE_PX, getTotalVerticalScrollDistance() - BOTTOM_DEAD_ZONE_PX];
+    const [yMin, yMax] = [window.scrollY + TOP_DEAD_ZONE_PX, getTotalVerticalScrollDistance() + BOTTOM_DEAD_ZONE_PX];
 
     for (const heading of headingsFromDOM) {

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:133:44
     let closestDistance = -Infinity; // Like the level of the Intersection Observer devs
     const [yMin, yMax] = [window.scrollY + TOP_DEAD_ZONE_PX, getTotalVerticalScrollDistance() - BOTTOM_DEAD_ZONE_PX];
 
-    for (const heading of headingsFromDOM) {
-      if (heading.offsetTop > yMax) continue;
-      const distance = yMin - heading.offsetTop;
-      // eslint-disable-next-line no-magic-numbers
-      if (0 >= distance && distance >= closestDistance) {
-        closestHeading = heading;
-        closestDistance = distance;
-      }
-    }
+    for (const heading of headingsFromDOM) {}
 
     return closestHeading;

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:134:11
     const [yMin, yMax] = [window.scrollY + TOP_DEAD_ZONE_PX, getTotalVerticalScrollDistance() - BOTTOM_DEAD_ZONE_PX];
 
     for (const heading of headingsFromDOM) {
-      if (heading.offsetTop > yMax) continue;
+      if (true) continue;
       const distance = yMin - heading.offsetTop;
       // eslint-disable-next-line no-magic-numbers

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:134:11
     const [yMin, yMax] = [window.scrollY + TOP_DEAD_ZONE_PX, getTotalVerticalScrollDistance() - BOTTOM_DEAD_ZONE_PX];
 
     for (const heading of headingsFromDOM) {
-      if (heading.offsetTop > yMax) continue;
+      if (heading.offsetTop <= yMax) continue;
       const distance = yMin - heading.offsetTop;
       // eslint-disable-next-line no-magic-numbers

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:135:24
 
     for (const heading of headingsFromDOM) {
       if (heading.offsetTop > yMax) continue;
-      const distance = yMin - heading.offsetTop;
+      const distance = yMin + heading.offsetTop;
       // eslint-disable-next-line no-magic-numbers
       if (0 >= distance && distance >= closestDistance) {

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:137:11
       if (heading.offsetTop > yMax) continue;
       const distance = yMin - heading.offsetTop;
       // eslint-disable-next-line no-magic-numbers
-      if (0 >= distance && distance >= closestDistance) {
+      if (true) {
         closestHeading = heading;
         closestDistance = distance;

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:137:11
       if (heading.offsetTop > yMax) continue;
       const distance = yMin - heading.offsetTop;
       // eslint-disable-next-line no-magic-numbers
-      if (0 >= distance && distance >= closestDistance) {
+      if (true && distance >= closestDistance) {
         closestHeading = heading;
         closestDistance = distance;

[NoCoverage] ArrayDeclaration
blog/toc/desktop/BlogPostTocDesktopInner.tsx:144:6
     }
 
     return closestHeading;
-  }, [headingsFromDOM]);
+  }, []);
 
   const getCurrentHeadingSlugFromHash: (expectedToBeInViewport?: boolean) => MaybeNull<HeadingSlug> = useCallback(

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:147:40
   }, [headingsFromDOM]);
 
   const getCurrentHeadingSlugFromHash: (expectedToBeInViewport?: boolean) => MaybeNull<HeadingSlug> = useCallback(
-    (expectedToBeInViewport: boolean = false) => {
+    (expectedToBeInViewport: boolean = true) => {
       const hash = window.location.hash;
       if (!hash) return null;

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:149:11
   const getCurrentHeadingSlugFromHash: (expectedToBeInViewport?: boolean) => MaybeNull<HeadingSlug> = useCallback(
     (expectedToBeInViewport: boolean = false) => {
       const hash = window.location.hash;
-      if (!hash) return null;
+      if (hash) return null;
 
       // eslint-disable-next-line no-magic-numbers

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:149:11
   const getCurrentHeadingSlugFromHash: (expectedToBeInViewport?: boolean) => MaybeNull<HeadingSlug> = useCallback(
     (expectedToBeInViewport: boolean = false) => {
       const hash = window.location.hash;
-      if (!hash) return null;
+      if (false) return null;
 
       // eslint-disable-next-line no-magic-numbers

[NoCoverage] MethodExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:152:32
       if (!hash) return null;
 
       // eslint-disable-next-line no-magic-numbers
-      const maybeHeadingSlug = hash.substring(1);
+      const maybeHeadingSlug = hash;
       const maybeHeadingSlugIdx = slugAndIndexAssoc[maybeHeadingSlug];
       if (maybeHeadingSlugIdx === undefined) return null;

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:154:11
       // eslint-disable-next-line no-magic-numbers
       const maybeHeadingSlug = hash.substring(1);
       const maybeHeadingSlugIdx = slugAndIndexAssoc[maybeHeadingSlug];
-      if (maybeHeadingSlugIdx === undefined) return null;
+      if (false) return null;
 
       const heading = document.getElementById(headings[maybeHeadingSlugIdx].slug);

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:154:11
       // eslint-disable-next-line no-magic-numbers
       const maybeHeadingSlug = hash.substring(1);
       const maybeHeadingSlugIdx = slugAndIndexAssoc[maybeHeadingSlug];
-      if (maybeHeadingSlugIdx === undefined) return null;
+      if (maybeHeadingSlugIdx !== undefined) return null;
 
       const heading = document.getElementById(headings[maybeHeadingSlugIdx].slug);

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:159:11
       const heading = document.getElementById(headings[maybeHeadingSlugIdx].slug);
       if (!heading) return null;
 
-      if (!expectedToBeInViewport) return maybeHeadingSlug;
+      if (expectedToBeInViewport) return maybeHeadingSlug;
 
       const [yMin, yMax] = [window.scrollY, getTotalVerticalScrollDistance()];

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:159:11
       const heading = document.getElementById(headings[maybeHeadingSlugIdx].slug);
       if (!heading) return null;
 
-      if (!expectedToBeInViewport) return maybeHeadingSlug;
+      if (false) return maybeHeadingSlug;
 
       const [yMin, yMax] = [window.scrollY, getTotalVerticalScrollDistance()];

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:162:64
       if (!expectedToBeInViewport) return maybeHeadingSlug;
 
       const [yMin, yMax] = [window.scrollY, getTotalVerticalScrollDistance()];
-      const headingIsInViewport = yMax >= heading.offsetTop && heading.offsetTop >= yMin;
+      const headingIsInViewport = yMax >= heading.offsetTop && true;
       return !headingIsInViewport ? null : maybeHeadingSlug;
     },

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:162:64
       if (!expectedToBeInViewport) return maybeHeadingSlug;
 
       const [yMin, yMax] = [window.scrollY, getTotalVerticalScrollDistance()];
-      const headingIsInViewport = yMax >= heading.offsetTop && heading.offsetTop >= yMin;
+      const headingIsInViewport = yMax >= heading.offsetTop && heading.offsetTop < yMin;
       return !headingIsInViewport ? null : maybeHeadingSlug;
     },

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:163:14
 
       const [yMin, yMax] = [window.scrollY, getTotalVerticalScrollDistance()];
       const headingIsInViewport = yMax >= heading.offsetTop && heading.offsetTop >= yMin;
-      return !headingIsInViewport ? null : maybeHeadingSlug;
+      return headingIsInViewport ? null : maybeHeadingSlug;
     },
     [slugAndIndexAssoc, headings]

[NoCoverage] ArrayDeclaration
blog/toc/desktop/BlogPostTocDesktopInner.tsx:165:5
       const headingIsInViewport = yMax >= heading.offsetTop && heading.offsetTop >= yMin;
       return !headingIsInViewport ? null : maybeHeadingSlug;
     },
-    [slugAndIndexAssoc, headings]
+    []
   );
 

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:171:19
   const inferCurrentHeading: () => MaybeNull<HTMLElement> = useCallback(() => {
     const infered1 = getClosestHeadingFromTop();
 
-    if (infered1) {
-      const inferedElementHeading = infered1.id;
-      const inferedElementYTopInViewport = infered1.getBoundingClientRect().top;
-      // eslint-disable-next-line no-magic-numbers
-      const midViewportHeight = window.innerHeight / 2;
-      if (midViewportHeight < inferedElementYTopInViewport) {
-        const idx = slugAndIndexAssoc[inferedElementHeading];
-        // eslint-disable-next-line no-magic-numbers
-        if (idx === 0) return infered1;
-        // eslint-disable-next-line no-magic-numbers
-        const rescueHeading = headings[idx - 1].slug;
-        forcedHeadingSlugRef.current = '';
-        muteUpdatesUntilScrollEnd.current = true;
-        setScrollDirection('up');
-        const infered3 = document.getElementById(rescueHeading);
-        return infered3;
-      }
-      return infered1;
-    }
+    if (infered1) {}
 
     const infered2 = getClosestHeadingFromBottom();

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:175:33
       const inferedElementHeading = infered1.id;
       const inferedElementYTopInViewport = infered1.getBoundingClientRect().top;
       // eslint-disable-next-line no-magic-numbers
-      const midViewportHeight = window.innerHeight / 2;
+      const midViewportHeight = window.innerHeight * 2;
       if (midViewportHeight < inferedElementYTopInViewport) {
         const idx = slugAndIndexAssoc[inferedElementHeading];

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:176:11
       const inferedElementYTopInViewport = infered1.getBoundingClientRect().top;
       // eslint-disable-next-line no-magic-numbers
       const midViewportHeight = window.innerHeight / 2;
-      if (midViewportHeight < inferedElementYTopInViewport) {
+      if (midViewportHeight <= inferedElementYTopInViewport) {
         const idx = slugAndIndexAssoc[inferedElementHeading];
         // eslint-disable-next-line no-magic-numbers

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:176:11
       const inferedElementYTopInViewport = infered1.getBoundingClientRect().top;
       // eslint-disable-next-line no-magic-numbers
       const midViewportHeight = window.innerHeight / 2;
-      if (midViewportHeight < inferedElementYTopInViewport) {
+      if (true) {
         const idx = slugAndIndexAssoc[inferedElementHeading];
         // eslint-disable-next-line no-magic-numbers

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:179:13
       if (midViewportHeight < inferedElementYTopInViewport) {
         const idx = slugAndIndexAssoc[inferedElementHeading];
         // eslint-disable-next-line no-magic-numbers
-        if (idx === 0) return infered1;
+        if (idx !== 0) return infered1;
         // eslint-disable-next-line no-magic-numbers
         const rescueHeading = headings[idx - 1].slug;

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:179:13
       if (midViewportHeight < inferedElementYTopInViewport) {
         const idx = slugAndIndexAssoc[inferedElementHeading];
         // eslint-disable-next-line no-magic-numbers
-        if (idx === 0) return infered1;
+        if (true) return infered1;
         // eslint-disable-next-line no-magic-numbers
         const rescueHeading = headings[idx - 1].slug;

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:181:40
         // eslint-disable-next-line no-magic-numbers
         if (idx === 0) return infered1;
         // eslint-disable-next-line no-magic-numbers
-        const rescueHeading = headings[idx - 1].slug;
+        const rescueHeading = headings[idx + 1].slug;
         forcedHeadingSlugRef.current = '';
         muteUpdatesUntilScrollEnd.current = true;

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:183:45
         // eslint-disable-next-line no-magic-numbers
         const rescueHeading = headings[idx - 1].slug;
         forcedHeadingSlugRef.current = '';
-        muteUpdatesUntilScrollEnd.current = true;
+        muteUpdatesUntilScrollEnd.current = false;
         setScrollDirection('up');
         const infered3 = document.getElementById(rescueHeading);

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:205:40
     dropOldHeadingFocusAndSetCurrentHeading
   ]);
 
-  const isAtBottom = useCallback(() => getTotalVerticalScrollDistance() >= document.documentElement.scrollHeight, []);
+  const isAtBottom = useCallback(() => false, []);
 
   const populateHandleScrollUpAndHandleScrollDown = useCallback(() => {

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:205:40
     dropOldHeadingFocusAndSetCurrentHeading
   ]);
 
-  const isAtBottom = useCallback(() => getTotalVerticalScrollDistance() >= document.documentElement.scrollHeight, []);
+  const isAtBottom = useCallback(() => getTotalVerticalScrollDistance() > document.documentElement.scrollHeight, []);
 
   const populateHandleScrollUpAndHandleScrollDown = useCallback(() => {

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:208:98
   const isAtBottom = useCallback(() => getTotalVerticalScrollDistance() >= document.documentElement.scrollHeight, []);
 
   const populateHandleScrollUpAndHandleScrollDown = useCallback(() => {
-    handleScrollUpRef.current = (currentScrollY: PxValue, oldScrollY: PxValue, forced: boolean = false) => {
+    handleScrollUpRef.current = (currentScrollY: PxValue, oldScrollY: PxValue, forced: boolean = true) => {
       if (!isLargeScreen || muteScrollEndNextDoubleCheck.current) return;
 

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:209:11
 
   const populateHandleScrollUpAndHandleScrollDown = useCallback(() => {
     handleScrollUpRef.current = (currentScrollY: PxValue, oldScrollY: PxValue, forced: boolean = false) => {
-      if (!isLargeScreen || muteScrollEndNextDoubleCheck.current) return;
+      if (isLargeScreen || muteScrollEndNextDoubleCheck.current) return;
 
       if (currentScrollY > oldScrollY) {

[NoCoverage] LogicalOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:209:11
 
   const populateHandleScrollUpAndHandleScrollDown = useCallback(() => {
     handleScrollUpRef.current = (currentScrollY: PxValue, oldScrollY: PxValue, forced: boolean = false) => {
-      if (!isLargeScreen || muteScrollEndNextDoubleCheck.current) return;
+      if (!isLargeScreen && muteScrollEndNextDoubleCheck.current) return;
 
       if (currentScrollY > oldScrollY) {

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:211:11
     handleScrollUpRef.current = (currentScrollY: PxValue, oldScrollY: PxValue, forced: boolean = false) => {
       if (!isLargeScreen || muteScrollEndNextDoubleCheck.current) return;
 
-      if (currentScrollY > oldScrollY) {
+      if (currentScrollY >= oldScrollY) {
         setScrollDirection('down');
         const handleScrollDownInstance = getRefCurrentPtr(handleScrollDownRef);

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:211:11
     handleScrollUpRef.current = (currentScrollY: PxValue, oldScrollY: PxValue, forced: boolean = false) => {
       if (!isLargeScreen || muteScrollEndNextDoubleCheck.current) return;
 
-      if (currentScrollY > oldScrollY) {
+      if (false) {
         setScrollDirection('down');
         const handleScrollDownInstance = getRefCurrentPtr(handleScrollDownRef);

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:214:13
       if (currentScrollY > oldScrollY) {
         setScrollDirection('down');
         const handleScrollDownInstance = getRefCurrentPtr(handleScrollDownRef);
-        if (handleScrollDownInstance) handleScrollDownInstance(currentScrollY, oldScrollY, true);
+        if (false) handleScrollDownInstance(currentScrollY, oldScrollY, true);
         return;
       }

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:214:13
       if (currentScrollY > oldScrollY) {
         setScrollDirection('down');
         const handleScrollDownInstance = getRefCurrentPtr(handleScrollDownRef);
-        if (handleScrollDownInstance) handleScrollDownInstance(currentScrollY, oldScrollY, true);
+        if (true) handleScrollDownInstance(currentScrollY, oldScrollY, true);
         return;
       }

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:219:18
       }
 
       const isForced = Boolean(forced);
-      let skip = false;
+      let skip = true;
 
       if (isForced) skip = false;

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:221:28
       const isForced = Boolean(forced);
       let skip = false;
 
-      if (isForced) skip = false;
+      if (isForced) skip = true;
       else if (scrollDirection !== 'up' || muteUpdatesUntilScrollEnd.current) skip = true;
 

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:221:11
       const isForced = Boolean(forced);
       let skip = false;
 
-      if (isForced) skip = false;
+      if (true) skip = false;
       else if (scrollDirection !== 'up' || muteUpdatesUntilScrollEnd.current) skip = true;
 

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:222:16
       let skip = false;
 
       if (isForced) skip = false;
-      else if (scrollDirection !== 'up' || muteUpdatesUntilScrollEnd.current) skip = true;
+      else if (true) skip = true;
 
       if (skip) return;

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:222:16
       let skip = false;
 
       if (isForced) skip = false;
-      else if (scrollDirection !== 'up' || muteUpdatesUntilScrollEnd.current) skip = true;
+      else if (false) skip = true;
 
       if (skip) return;

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:224:11
       if (isForced) skip = false;
       else if (scrollDirection !== 'up' || muteUpdatesUntilScrollEnd.current) skip = true;
 
-      if (skip) return;
+      if (false) return;
 
       if (isAtTop()) {
