[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:226:22
 
       if (skip) return;
 
-      if (isAtTop()) {
-        // eslint-disable-next-line no-magic-numbers
-        const veryFirstHeadingSlug = headings[0].slug;
-        forcedHeadingSlugRef.current = '';
-        dropOldHeadingFocusAndSetCurrentHeading(veryFirstHeadingSlug);
-        return;
-      }
+      if (isAtTop()) {}
 
       const infered: MaybeNull<HeadingSlug> = getClosestHeadingFromTop()?.id ?? null;

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:226:11
 
       if (skip) return;
 
-      if (isAtTop()) {
+      if (false) {
         // eslint-disable-next-line no-magic-numbers
         const veryFirstHeadingSlug = headings[0].slug;

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:238:33
 
       if (!infered) {
         const maybeRescueHeading: MaybeNull<HeadingSlug> = inferCurrentHeading()?.id ?? null;
-        if (maybeRescueHeading) {
-          dropOldHeadingFocusAndSetCurrentHeading(maybeRescueHeading);
-          return;
-        }
+        if (maybeRescueHeading) {}
         // eslint-disable-next-line no-magic-numbers
         const veryFirstHeadingSlug = headings[0].slug;

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:248:41
         return;
       }
 
-      if (forcedHeadingSlugRef.current) {
-        const inferedHeadingIdx = slugAndIndexAssoc[infered];
-        const forcedHeadingIdx = slugAndIndexAssoc[forcedHeadingSlugRef.current];
-        if (inferedHeadingIdx <= forcedHeadingIdx) forcedHeadingSlugRef.current = '';
-        else return;
-      }
+      if (forcedHeadingSlugRef.current) {}
 
       dropOldHeadingFocusAndSetCurrentHeading(infered);

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:248:11
         return;
       }
 
-      if (forcedHeadingSlugRef.current) {
+      if (true) {
         const inferedHeadingIdx = slugAndIndexAssoc[infered];
         const forcedHeadingIdx = slugAndIndexAssoc[forcedHeadingSlugRef.current];

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:251:13
       if (forcedHeadingSlugRef.current) {
         const inferedHeadingIdx = slugAndIndexAssoc[infered];
         const forcedHeadingIdx = slugAndIndexAssoc[forcedHeadingSlugRef.current];
-        if (inferedHeadingIdx <= forcedHeadingIdx) forcedHeadingSlugRef.current = '';
+        if (true) forcedHeadingSlugRef.current = '';
         else return;
       }

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:251:13
       if (forcedHeadingSlugRef.current) {
         const inferedHeadingIdx = slugAndIndexAssoc[infered];
         const forcedHeadingIdx = slugAndIndexAssoc[forcedHeadingSlugRef.current];
-        if (inferedHeadingIdx <= forcedHeadingIdx) forcedHeadingSlugRef.current = '';
+        if (inferedHeadingIdx < forcedHeadingIdx) forcedHeadingSlugRef.current = '';
         else return;
       }

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:259:100
       return;
     };
 
-    handleScrollDownRef.current = (currentScrollY: PxValue, oldScrollY: PxValue, forced: boolean = false) => {
+    handleScrollDownRef.current = (currentScrollY: PxValue, oldScrollY: PxValue, forced: boolean = true) => {
       if (!isLargeScreen || muteScrollEndNextDoubleCheck.current) return;
 

[NoCoverage] LogicalOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:260:11
     };
 
     handleScrollDownRef.current = (currentScrollY: PxValue, oldScrollY: PxValue, forced: boolean = false) => {
-      if (!isLargeScreen || muteScrollEndNextDoubleCheck.current) return;
+      if (!isLargeScreen && muteScrollEndNextDoubleCheck.current) return;
 
       if (currentScrollY < oldScrollY) {

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:260:11
     };
 
     handleScrollDownRef.current = (currentScrollY: PxValue, oldScrollY: PxValue, forced: boolean = false) => {
-      if (!isLargeScreen || muteScrollEndNextDoubleCheck.current) return;
+      if (isLargeScreen || muteScrollEndNextDoubleCheck.current) return;
 
       if (currentScrollY < oldScrollY) {

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:262:40
     handleScrollDownRef.current = (currentScrollY: PxValue, oldScrollY: PxValue, forced: boolean = false) => {
       if (!isLargeScreen || muteScrollEndNextDoubleCheck.current) return;
 
-      if (currentScrollY < oldScrollY) {
-        setScrollDirection('up');
-        const handleScrollUpInstance = getRefCurrentPtr(handleScrollUpRef);
-        if (handleScrollUpInstance) handleScrollUpInstance(currentScrollY, oldScrollY, true);
-        return;
-      }
+      if (currentScrollY < oldScrollY) {}
 
       const isForced = Boolean(forced);

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:262:11
     handleScrollDownRef.current = (currentScrollY: PxValue, oldScrollY: PxValue, forced: boolean = false) => {
       if (!isLargeScreen || muteScrollEndNextDoubleCheck.current) return;
 
-      if (currentScrollY < oldScrollY) {
+      if (currentScrollY >= oldScrollY) {
         setScrollDirection('up');
         const handleScrollUpInstance = getRefCurrentPtr(handleScrollUpRef);

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:265:13
       if (currentScrollY < oldScrollY) {
         setScrollDirection('up');
         const handleScrollUpInstance = getRefCurrentPtr(handleScrollUpRef);
-        if (handleScrollUpInstance) handleScrollUpInstance(currentScrollY, oldScrollY, true);
+        if (false) handleScrollUpInstance(currentScrollY, oldScrollY, true);
         return;
       }

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:265:88
       if (currentScrollY < oldScrollY) {
         setScrollDirection('up');
         const handleScrollUpInstance = getRefCurrentPtr(handleScrollUpRef);
-        if (handleScrollUpInstance) handleScrollUpInstance(currentScrollY, oldScrollY, true);
+        if (handleScrollUpInstance) handleScrollUpInstance(currentScrollY, oldScrollY, false);
         return;
       }

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:272:11
       const isForced = Boolean(forced);
       let skip = false;
 
-      if (isForced) skip = false;
+      if (false) skip = false;
       else if (scrollDirection !== 'down' || muteUpdatesUntilScrollEnd.current) skip = true;
 

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:273:16
       let skip = false;
 
       if (isForced) skip = false;
-      else if (scrollDirection !== 'down' || muteUpdatesUntilScrollEnd.current) skip = true;
+      else if (false) skip = true;
 
       if (skip) return;

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:273:16
       let skip = false;
 
       if (isForced) skip = false;
-      else if (scrollDirection !== 'down' || muteUpdatesUntilScrollEnd.current) skip = true;
+      else if (false || muteUpdatesUntilScrollEnd.current) skip = true;
 
       if (skip) return;

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:277:11
 
       if (skip) return;
 
-      if (isAtBottom()) {
+      if (false) {
         // eslint-disable-next-line no-magic-numbers
         const veryLastHeadingSlug = headings[headings.length - 1].slug;

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:277:25
 
       if (skip) return;
 
-      if (isAtBottom()) {
-        // eslint-disable-next-line no-magic-numbers
-        const veryLastHeadingSlug = headings[headings.length - 1].slug;
-        forcedHeadingSlugRef.current = '';
-        dropOldHeadingFocusAndSetCurrentHeading(veryLastHeadingSlug);
-        return;
-      }
+      if (isAtBottom()) {}
 
       let firstVisibleHeadingSlug: MaybeNull<HeadingSlug> = getClosestHeadingFromTop()?.id ?? null;

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:279:46
 
       if (isAtBottom()) {
         // eslint-disable-next-line no-magic-numbers
-        const veryLastHeadingSlug = headings[headings.length - 1].slug;
+        const veryLastHeadingSlug = headings[headings.length + 1].slug;
         forcedHeadingSlugRef.current = '';
         dropOldHeadingFocusAndSetCurrentHeading(veryLastHeadingSlug);

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:286:11
       }
 
       let firstVisibleHeadingSlug: MaybeNull<HeadingSlug> = getClosestHeadingFromTop()?.id ?? null;
-      if (firstVisibleHeadingSlug === null) {
+      if (true) {
         const rescueHeading: MaybeNull<HeadingSlug> = inferCurrentHeading()?.id ?? null;
         if (rescueHeading) firstVisibleHeadingSlug = rescueHeading;

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:288:13
       let firstVisibleHeadingSlug: MaybeNull<HeadingSlug> = getClosestHeadingFromTop()?.id ?? null;
       if (firstVisibleHeadingSlug === null) {
         const rescueHeading: MaybeNull<HeadingSlug> = inferCurrentHeading()?.id ?? null;
-        if (rescueHeading) firstVisibleHeadingSlug = rescueHeading;
+        if (false) firstVisibleHeadingSlug = rescueHeading;
         else return;
       }

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:292:41
         else return;
       }
 
-      if (forcedHeadingSlugRef.current) {
-        const newIdx = slugAndIndexAssoc[firstVisibleHeadingSlug];
-        const oldIdx = slugAndIndexAssoc[forcedHeadingSlugRef.current];
-        if (newIdx >= oldIdx) forcedHeadingSlugRef.current = '';
-        else return;
-      }
+      if (forcedHeadingSlugRef.current) {}
 
       dropOldHeadingFocusAndSetCurrentHeading(firstVisibleHeadingSlug);

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:295:13
       if (forcedHeadingSlugRef.current) {
         const newIdx = slugAndIndexAssoc[firstVisibleHeadingSlug];
         const oldIdx = slugAndIndexAssoc[forcedHeadingSlugRef.current];
-        if (newIdx >= oldIdx) forcedHeadingSlugRef.current = '';
+        if (newIdx < oldIdx) forcedHeadingSlugRef.current = '';
         else return;
       }

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:295:13
       if (forcedHeadingSlugRef.current) {
         const newIdx = slugAndIndexAssoc[firstVisibleHeadingSlug];
         const oldIdx = slugAndIndexAssoc[forcedHeadingSlugRef.current];
-        if (newIdx >= oldIdx) forcedHeadingSlugRef.current = '';
+        if (true) forcedHeadingSlugRef.current = '';
         else return;
       }

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:313:49
     slugAndIndexAssoc
   ]);
 
-  const handleMagnetization = useCallback(() => {
-    if (!isLargeScreen || !mdxBodyFromDOM?.offsetTop) return;
-
-    setIsMagnetized(window.scrollY + navbarHeight >= mdxBodyFromDOM.offsetTop);
-  }, [isLargeScreen, mdxBodyFromDOM, setIsMagnetized]);
+  const handleMagnetization = useCallback(() => {}, [isLargeScreen, mdxBodyFromDOM, setIsMagnetized]);
 
   const onClickMagic = useCallback(

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:314:9
   ]);
 
   const handleMagnetization = useCallback(() => {
-    if (!isLargeScreen || !mdxBodyFromDOM?.offsetTop) return;
+    if (isLargeScreen || !mdxBodyFromDOM?.offsetTop) return;
 
     setIsMagnetized(window.scrollY + navbarHeight >= mdxBodyFromDOM.offsetTop);

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:316:21
   const handleMagnetization = useCallback(() => {
     if (!isLargeScreen || !mdxBodyFromDOM?.offsetTop) return;
 
-    setIsMagnetized(window.scrollY + navbarHeight >= mdxBodyFromDOM.offsetTop);
+    setIsMagnetized(true);
   }, [isLargeScreen, mdxBodyFromDOM, setIsMagnetized]);
 

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:316:21
   const handleMagnetization = useCallback(() => {
     if (!isLargeScreen || !mdxBodyFromDOM?.offsetTop) return;
 
-    setIsMagnetized(window.scrollY + navbarHeight >= mdxBodyFromDOM.offsetTop);
+    setIsMagnetized(window.scrollY - navbarHeight >= mdxBodyFromDOM.offsetTop);
   }, [isLargeScreen, mdxBodyFromDOM, setIsMagnetized]);
 

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:330:29
       forcedHeadingSlugRef.current = slug;
 
       // eslint-disable-next-line no-magic-numbers
-      const isLastHeading = slug === headings[headings.length - 1].slug;
+      const isLastHeading = true;
 
       if (isLastHeading && isAtBottom()) {

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:330:47
       forcedHeadingSlugRef.current = slug;
 
       // eslint-disable-next-line no-magic-numbers
-      const isLastHeading = slug === headings[headings.length - 1].slug;
+      const isLastHeading = slug === headings[headings.length + 1].slug;
 
       if (isLastHeading && isAtBottom()) {

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:332:11
       // eslint-disable-next-line no-magic-numbers
       const isLastHeading = slug === headings[headings.length - 1].slug;
 
-      if (isLastHeading && isAtBottom()) {
+      if (false) {
         setCurrentHeading(slug);
         router.replace('#' + slug, { scroll: false });

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:332:42
       // eslint-disable-next-line no-magic-numbers
       const isLastHeading = slug === headings[headings.length - 1].slug;
 
-      if (isLastHeading && isAtBottom()) {
-        setCurrentHeading(slug);
-        router.replace('#' + slug, { scroll: false });
-        return;
-      }
+      if (isLastHeading && isAtBottom()) {}
 
       muteUpdatesUntilScrollEnd.current = true;

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:334:46
 
       if (isLastHeading && isAtBottom()) {
         setCurrentHeading(slug);
-        router.replace('#' + slug, { scroll: false });
+        router.replace('#' + slug, { scroll: true });
         return;
       }

[NoCoverage] ObjectLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:334:36
 
       if (isLastHeading && isAtBottom()) {
         setCurrentHeading(slug);
-        router.replace('#' + slug, { scroll: false });
+        router.replace('#' + slug, {});
         return;
       }

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:338:43
         return;
       }
 
-      muteUpdatesUntilScrollEnd.current = true;
+      muteUpdatesUntilScrollEnd.current = false;
       muteScrollEndNextDoubleCheck.current = true;
       const scrollYTarget = Math.min(

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:339:46
       }
 
       muteUpdatesUntilScrollEnd.current = true;
-      muteScrollEndNextDoubleCheck.current = true;
+      muteScrollEndNextDoubleCheck.current = false;
       const scrollYTarget = Math.min(
         // eslint-disable-next-line no-magic-numbers

[NoCoverage] MethodExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:340:29
 
       muteUpdatesUntilScrollEnd.current = true;
       muteScrollEndNextDoubleCheck.current = true;
-      const scrollYTarget = Math.min(
-        // eslint-disable-next-line no-magic-numbers
-        Math.trunc(document.documentElement.scrollHeight) - Math.trunc(window.innerHeight) - 2,
-        elem.offsetTop - SCROLL_TOP_OFFSET_ONCLICK_MAGIC
-      );
+      const scrollYTarget = Math.max(
+// eslint-disable-next-line no-magic-numbers
+Math.trunc(document.documentElement.scrollHeight) - Math.trunc(window.innerHeight) - 2, elem.offsetTop - SCROLL_TOP_OFFSET_ONCLICK_MAGIC);
 
       forcedHeadingSlugRef.current = slug;

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:342:9
       muteScrollEndNextDoubleCheck.current = true;
       const scrollYTarget = Math.min(
         // eslint-disable-next-line no-magic-numbers
-        Math.trunc(document.documentElement.scrollHeight) - Math.trunc(window.innerHeight) - 2,
+        Math.trunc(document.documentElement.scrollHeight) + Math.trunc(window.innerHeight) - 2,
         elem.offsetTop - SCROLL_TOP_OFFSET_ONCLICK_MAGIC
       );

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:342:9
       muteScrollEndNextDoubleCheck.current = true;
       const scrollYTarget = Math.min(
         // eslint-disable-next-line no-magic-numbers
-        Math.trunc(document.documentElement.scrollHeight) - Math.trunc(window.innerHeight) - 2,
+        // eslint-disable-next-line no-magic-numbers
+Math.trunc(document.documentElement.scrollHeight) - Math.trunc(window.innerHeight) + 2,
         elem.offsetTop - SCROLL_TOP_OFFSET_ONCLICK_MAGIC
       );

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:343:9
       const scrollYTarget = Math.min(
         // eslint-disable-next-line no-magic-numbers
         Math.trunc(document.documentElement.scrollHeight) - Math.trunc(window.innerHeight) - 2,
-        elem.offsetTop - SCROLL_TOP_OFFSET_ONCLICK_MAGIC
+        elem.offsetTop + SCROLL_TOP_OFFSET_ONCLICK_MAGIC
       );
 

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:348:11
 
       forcedHeadingSlugRef.current = slug;
 
-      if (Math.trunc(scrollYTarget) === Math.trunc(window.scrollY)) window.dispatchEvent(new Event('scrollend'));
+      if (true) window.dispatchEvent(new Event('scrollend'));
       else window.scrollTo({ behavior: 'instant', top: scrollYTarget });
 

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:348:11
 
       forcedHeadingSlugRef.current = slug;
 
-      if (Math.trunc(scrollYTarget) === Math.trunc(window.scrollY)) window.dispatchEvent(new Event('scrollend'));
+      if (false) window.dispatchEvent(new Event('scrollend'));
       else window.scrollTo({ behavior: 'instant', top: scrollYTarget });
 

[NoCoverage] ObjectLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:349:28
       forcedHeadingSlugRef.current = slug;
 
       if (Math.trunc(scrollYTarget) === Math.trunc(window.scrollY)) window.dispatchEvent(new Event('scrollend'));
-      else window.scrollTo({ behavior: 'instant', top: scrollYTarget });
+      else window.scrollTo({});
 
       setCurrentHeading(slug);

[NoCoverage] ArrayDeclaration
blog/toc/desktop/BlogPostTocDesktopInner.tsx:354:5
       setCurrentHeading(slug);
       router.replace('#' + slug, { scroll: false });
     },
-    [headings, isAtBottom, router]
+    []
   );
 

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:358:23
   );
 
   const handleMagicHeadingClick = useCallback(
-    (event: Event) => {
-      if (!event.target) return;
-
-      const anchorElement = (event.target as HTMLElement).closest('a');
-
-      if (anchorElement?.parentNode) {
-        onClickMagic(event, headings[slugAndIndexAssoc[(anchorElement.parentNode as HTMLElement).id]]);
-      }
-    },
+    (event: Event) => {},
     [headings, onClickMagic, slugAndIndexAssoc]
   );

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:359:11
 
   const handleMagicHeadingClick = useCallback(
     (event: Event) => {
-      if (!event.target) return;
+      if (false) return;
 
       const anchorElement = (event.target as HTMLElement).closest('a');

[NoCoverage] StringLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:361:67
     (event: Event) => {
       if (!event.target) return;
 
-      const anchorElement = (event.target as HTMLElement).closest('a');
+      const anchorElement = (event.target as HTMLElement).closest("");
 
       if (anchorElement?.parentNode) {

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:363:38
 
       const anchorElement = (event.target as HTMLElement).closest('a');
 
-      if (anchorElement?.parentNode) {
-        onClickMagic(event, headings[slugAndIndexAssoc[(anchorElement.parentNode as HTMLElement).id]]);
-      }
+      if (anchorElement?.parentNode) {}
     },
     [headings, onClickMagic, slugAndIndexAssoc]

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:371:32
   );
 
   const setDocumentHeadingsOnClickEvent = useCallback(
-    (doSet: boolean = true) => {
-      for (const heading of headingsFromDOM) {
-        // eslint-disable-next-line no-magic-numbers
-        const firstChild = heading.children[0];
-        if (!firstChild) continue;
-
-        firstChild.removeEventListener('click', handleMagicHeadingClick);
-        if (doSet) firstChild.addEventListener('click', handleMagicHeadingClick);
-      }
-    },
+    (doSet: boolean = true) => {},
     [headingsFromDOM, handleMagicHeadingClick]
   );

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:371:23
   );
 
   const setDocumentHeadingsOnClickEvent = useCallback(
-    (doSet: boolean = true) => {
+    (doSet: boolean = false) => {
       for (const heading of headingsFromDOM) {
         // eslint-disable-next-line no-magic-numbers

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:372:46
 
   const setDocumentHeadingsOnClickEvent = useCallback(
     (doSet: boolean = true) => {
-      for (const heading of headingsFromDOM) {
-        // eslint-disable-next-line no-magic-numbers
-        const firstChild = heading.children[0];
-        if (!firstChild) continue;
-
-        firstChild.removeEventListener('click', handleMagicHeadingClick);
-        if (doSet) firstChild.addEventListener('click', handleMagicHeadingClick);
-      }
+      for (const heading of headingsFromDOM) {}
     },
     [headingsFromDOM, handleMagicHeadingClick]

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:375:13
       for (const heading of headingsFromDOM) {
         // eslint-disable-next-line no-magic-numbers
         const firstChild = heading.children[0];
-        if (!firstChild) continue;
+        if (false) continue;
 
         firstChild.removeEventListener('click', handleMagicHeadingClick);

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:375:13
       for (const heading of headingsFromDOM) {
         // eslint-disable-next-line no-magic-numbers
         const firstChild = heading.children[0];
-        if (!firstChild) continue;
+        if (true) continue;
 
         firstChild.removeEventListener('click', handleMagicHeadingClick);

[NoCoverage] StringLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:377:40
         const firstChild = heading.children[0];
         if (!firstChild) continue;
 
-        firstChild.removeEventListener('click', handleMagicHeadingClick);
+        firstChild.removeEventListener("", handleMagicHeadingClick);
         if (doSet) firstChild.addEventListener('click', handleMagicHeadingClick);
       }

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:378:13
         if (!firstChild) continue;
 
         firstChild.removeEventListener('click', handleMagicHeadingClick);
-        if (doSet) firstChild.addEventListener('click', handleMagicHeadingClick);
+        if (false) firstChild.addEventListener('click', handleMagicHeadingClick);
       }
     },

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:378:13
         if (!firstChild) continue;
 
         firstChild.removeEventListener('click', handleMagicHeadingClick);
-        if (doSet) firstChild.addEventListener('click', handleMagicHeadingClick);
+        if (true) firstChild.addEventListener('click', handleMagicHeadingClick);
       }
     },

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:385:32
   );
 
   useEffect(() => {
-    function handleScrollEnd() {
-      const currentScrollY = window.scrollY;
-      const oldScrollY = lastScrollY.current;
-      lastScrollY.current = currentScrollY;
-
-      if (!isLargeScreen) return;
-
-      muteUpdatesUntilScrollEnd.current = false;
-      if (muteScrollEndNextDoubleCheck.current) {
-        muteScrollEndNextDoubleCheck.current = false;
-        return;
-      }
-
-      if (scrollDirection === 'up') {
-        const handleScrollUpInstance = getRefCurrentPtr(handleScrollUpRef);
-        if (handleScrollUpInstance) handleScrollUpInstance(currentScrollY, oldScrollY, true);
-        return;
-      }
-
-      if (scrollDirection !== 'down') return;
-
-      const handleScrollDownInstance = getRefCurrentPtr(handleScrollDownRef);
-      if (handleScrollDownInstance) handleScrollDownInstance(currentScrollY, oldScrollY, true);
-    }
+    function handleScrollEnd() {}
 
     window.addEventListener('scrollend', handleScrollEnd);

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:390:11
       const oldScrollY = lastScrollY.current;
       lastScrollY.current = currentScrollY;
 
-      if (!isLargeScreen) return;
+      if (true) return;
 
       muteUpdatesUntilScrollEnd.current = false;

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:390:11
       const oldScrollY = lastScrollY.current;
       lastScrollY.current = currentScrollY;
 
-      if (!isLargeScreen) return;
+      if (isLargeScreen) return;
 
       muteUpdatesUntilScrollEnd.current = false;

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:392:43
 
       if (!isLargeScreen) return;
 
-      muteUpdatesUntilScrollEnd.current = false;
+      muteUpdatesUntilScrollEnd.current = true;
       if (muteScrollEndNextDoubleCheck.current) {
         muteScrollEndNextDoubleCheck.current = false;

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:393:11
       if (!isLargeScreen) return;
 
       muteUpdatesUntilScrollEnd.current = false;
-      if (muteScrollEndNextDoubleCheck.current) {
+      if (false) {
         muteScrollEndNextDoubleCheck.current = false;
         return;

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:393:49
       if (!isLargeScreen) return;
 
       muteUpdatesUntilScrollEnd.current = false;
-      if (muteScrollEndNextDoubleCheck.current) {
-        muteScrollEndNextDoubleCheck.current = false;
-        return;
-      }
+      if (muteScrollEndNextDoubleCheck.current) {}
 
       if (scrollDirection === 'up') {

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:394:48
 
       muteUpdatesUntilScrollEnd.current = false;
       if (muteScrollEndNextDoubleCheck.current) {
-        muteScrollEndNextDoubleCheck.current = false;
+        muteScrollEndNextDoubleCheck.current = true;
         return;
       }

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:398:37
         return;
       }
 
-      if (scrollDirection === 'up') {
-        const handleScrollUpInstance = getRefCurrentPtr(handleScrollUpRef);
-        if (handleScrollUpInstance) handleScrollUpInstance(currentScrollY, oldScrollY, true);
-        return;
-      }
+      if (scrollDirection === 'up') {}
 
       if (scrollDirection !== 'down') return;

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:398:11
         return;
       }
 
-      if (scrollDirection === 'up') {
+      if (true) {
         const handleScrollUpInstance = getRefCurrentPtr(handleScrollUpRef);
         if (handleScrollUpInstance) handleScrollUpInstance(currentScrollY, oldScrollY, true);

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:400:13
 
       if (scrollDirection === 'up') {
         const handleScrollUpInstance = getRefCurrentPtr(handleScrollUpRef);
-        if (handleScrollUpInstance) handleScrollUpInstance(currentScrollY, oldScrollY, true);
+        if (true) handleScrollUpInstance(currentScrollY, oldScrollY, true);
         return;
       }

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:404:11
         return;
       }
 
-      if (scrollDirection !== 'down') return;
+      if (true) return;
 
       const handleScrollDownInstance = getRefCurrentPtr(handleScrollDownRef);

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:404:11
         return;
       }
 
-      if (scrollDirection !== 'down') return;
+      if (scrollDirection === 'down') return;
 
       const handleScrollDownInstance = getRefCurrentPtr(handleScrollDownRef);

[NoCoverage] ArrowFunction
blog/toc/desktop/BlogPostTocDesktopInner.tsx:412:12
 
     window.addEventListener('scrollend', handleScrollEnd);
 
-    return () => window.removeEventListener('scrollend', handleScrollEnd);
+    return () => undefined;
   }, [isLargeScreen, scrollDirection]);
 

[NoCoverage] ArrayDeclaration
blog/toc/desktop/BlogPostTocDesktopInner.tsx:413:6
     window.addEventListener('scrollend', handleScrollEnd);
 
     return () => window.removeEventListener('scrollend', handleScrollEnd);
-  }, [isLargeScreen, scrollDirection]);
+  }, []);
 
   useEffect(() => {

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:415:19
     return () => window.removeEventListener('scrollend', handleScrollEnd);
   }, [isLargeScreen, scrollDirection]);
 
-  useEffect(() => {
-    if (!isMagnetized) setIsCollapsed(false);
-  }, [isMagnetized, setIsCollapsed]);
+  useEffect(() => {}, [isMagnetized, setIsCollapsed]);
 
   useEffect(() => {

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:416:9
   }, [isLargeScreen, scrollDirection]);
 
   useEffect(() => {
-    if (!isMagnetized) setIsCollapsed(false);
+    if (isMagnetized) setIsCollapsed(false);
   }, [isMagnetized, setIsCollapsed]);
 
