[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:416:9
   }, [isLargeScreen, scrollDirection]);
 
   useEffect(() => {
-    if (!isMagnetized) setIsCollapsed(false);
+    if (false) setIsCollapsed(false);
   }, [isMagnetized, setIsCollapsed]);
 

[NoCoverage] ArrayDeclaration
blog/toc/desktop/BlogPostTocDesktopInner.tsx:417:6
 
   useEffect(() => {
     if (!isMagnetized) setIsCollapsed(false);
-  }, [isMagnetized, setIsCollapsed]);
+  }, []);
 
   useEffect(() => {

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:419:19
     if (!isMagnetized) setIsCollapsed(false);
   }, [isMagnetized, setIsCollapsed]);
 
-  useEffect(() => {
-    if (!isLargeScreen) return;
-
-    const headingsInstance = getRefCurrentPtr(headingsRef);
-    if (!headingsInstance) return;
-
-    const idx = slugAndIndexAssoc[currentHeading];
-    if (idx === undefined) return;
-
-    headingsInstance.scrollTo({
-      top: (headingsInstance.children[idx] as HTMLElement).offsetTop - TOC_SCROLL_TOP_OFFSET_IN_PX,
-      behavior: 'smooth'
-    });
-    return;
-  }, [currentHeading, isLargeScreen, slugAndIndexAssoc, headings]);
+  useEffect(() => {}, [currentHeading, isLargeScreen, slugAndIndexAssoc, headings]);
 
   useEffect(

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:420:9
   }, [isMagnetized, setIsCollapsed]);
 
   useEffect(() => {
-    if (!isLargeScreen) return;
+    if (true) return;
 
     const headingsInstance = getRefCurrentPtr(headingsRef);

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:420:9
   }, [isMagnetized, setIsCollapsed]);
 
   useEffect(() => {
-    if (!isLargeScreen) return;
+    if (false) return;
 
     const headingsInstance = getRefCurrentPtr(headingsRef);

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:423:9
     if (!isLargeScreen) return;
 
     const headingsInstance = getRefCurrentPtr(headingsRef);
-    if (!headingsInstance) return;
+    if (false) return;
 
     const idx = slugAndIndexAssoc[currentHeading];

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:423:9
     if (!isLargeScreen) return;
 
     const headingsInstance = getRefCurrentPtr(headingsRef);
-    if (!headingsInstance) return;
+    if (true) return;
 
     const idx = slugAndIndexAssoc[currentHeading];

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:426:9
     if (!headingsInstance) return;
 
     const idx = slugAndIndexAssoc[currentHeading];
-    if (idx === undefined) return;
+    if (false) return;
 
     headingsInstance.scrollTo({

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:426:9
     if (!headingsInstance) return;
 
     const idx = slugAndIndexAssoc[currentHeading];
-    if (idx === undefined) return;
+    if (idx !== undefined) return;
 
     headingsInstance.scrollTo({

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:429:12
     if (idx === undefined) return;
 
     headingsInstance.scrollTo({
-      top: (headingsInstance.children[idx] as HTMLElement).offsetTop - TOC_SCROLL_TOP_OFFSET_IN_PX,
+      top: (headingsInstance.children[idx] as HTMLElement).offsetTop + TOC_SCROLL_TOP_OFFSET_IN_PX,
       behavior: 'smooth'
     });

[NoCoverage] ArrayDeclaration
blog/toc/desktop/BlogPostTocDesktopInner.tsx:433:6
       behavior: 'smooth'
     });
     return;
-  }, [currentHeading, isLargeScreen, slugAndIndexAssoc, headings]);
+  }, []);
 
   useEffect(

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:437:11
 
   useEffect(
     () => {
-      if (!isLargeScreen) return;
+      if (isLargeScreen) return;
 
       const tocInstance = getRefCurrentPtr(tocRef);

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:437:11
 
   useEffect(
     () => {
-      if (!isLargeScreen) return;
+      if (true) return;
 
       const tocInstance = getRefCurrentPtr(tocRef);

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:440:11
       if (!isLargeScreen) return;
 
       const tocInstance = getRefCurrentPtr(tocRef);
-      if (!tocInstance) return;
+      if (false) return;
 
       function updateScrollOnUncollapse(event: TransitionEvent) {

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:440:11
       if (!isLargeScreen) return;
 
       const tocInstance = getRefCurrentPtr(tocRef);
-      if (!tocInstance) return;
+      if (true) return;
 
       function updateScrollOnUncollapse(event: TransitionEvent) {

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:442:65
       const tocInstance = getRefCurrentPtr(tocRef);
       if (!tocInstance) return;
 
-      function updateScrollOnUncollapse(event: TransitionEvent) {
-        const target = event.target as HTMLElement;
-        if (target.tagName !== 'NAV') return;
-
-        const headingsInstance = getRefCurrentPtr(headingsRef);
-        if (!headingsInstance) return;
-
-        const idx = slugAndIndexAssoc[currentHeading];
-        if (idx === undefined) return;
-
-        const HTMLElement = headingsInstance.children[idx];
-        if (!HTMLElement) return;
-
-        headingsInstance.scrollTo({
-          top: (HTMLElement as HTMLElement).offsetTop - TOC_SCROLL_TOP_OFFSET_IN_PX,
-          behavior: 'smooth'
-        });
-
-        tocInstance.removeEventListener('transitionend', (event) => updateScrollOnUncollapse(event));
-      }
+      function updateScrollOnUncollapse(event: TransitionEvent) {}
 
       function applyUncollapsedStyles() {

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:444:13
 
       function updateScrollOnUncollapse(event: TransitionEvent) {
         const target = event.target as HTMLElement;
-        if (target.tagName !== 'NAV') return;
+        if (true) return;
 
         const headingsInstance = getRefCurrentPtr(headingsRef);

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:444:13
 
       function updateScrollOnUncollapse(event: TransitionEvent) {
         const target = event.target as HTMLElement;
-        if (target.tagName !== 'NAV') return;
+        if (false) return;
 
         const headingsInstance = getRefCurrentPtr(headingsRef);

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:450:13
         if (!headingsInstance) return;
 
         const idx = slugAndIndexAssoc[currentHeading];
-        if (idx === undefined) return;
+        if (true) return;
 
         const HTMLElement = headingsInstance.children[idx];

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:453:13
         if (idx === undefined) return;
 
         const HTMLElement = headingsInstance.children[idx];
-        if (!HTMLElement) return;
+        if (true) return;
 
         headingsInstance.scrollTo({

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:453:13
         if (idx === undefined) return;
 
         const HTMLElement = headingsInstance.children[idx];
-        if (!HTMLElement) return;
+        if (false) return;
 
         headingsInstance.scrollTo({

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:456:16
         if (!HTMLElement) return;
 
         headingsInstance.scrollTo({
-          top: (HTMLElement as HTMLElement).offsetTop - TOC_SCROLL_TOP_OFFSET_IN_PX,
+          top: (HTMLElement as HTMLElement).offsetTop + TOC_SCROLL_TOP_OFFSET_IN_PX,
           behavior: 'smooth'
         });

[NoCoverage] ArrowFunction
blog/toc/desktop/BlogPostTocDesktopInner.tsx:460:58
           behavior: 'smooth'
         });
 
-        tocInstance.removeEventListener('transitionend', (event) => updateScrollOnUncollapse(event));
+        tocInstance.removeEventListener('transitionend', () => undefined);
       }
 

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:463:41
         tocInstance.removeEventListener('transitionend', (event) => updateScrollOnUncollapse(event));
       }
 
-      function applyUncollapsedStyles() {
-        tocInstance.style.marginTop = '0';
-      }
+      function applyUncollapsedStyles() {}
 
       function applyCollapsedStyles() {

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:467:39
         tocInstance.style.marginTop = '0';
       }
 
-      function applyCollapsedStyles() {
-        const height = tocInstance.getBoundingClientRect().height;
-        tocInstance.style.marginTop = '-' + (height + COLLAPSE_BUTTON_HEIGTH_IN_PX) + 'px';
-      }
+      function applyCollapsedStyles() {}
 
       if (!isCollapsed) {

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:469:46
 
       function applyCollapsedStyles() {
         const height = tocInstance.getBoundingClientRect().height;
-        tocInstance.style.marginTop = '-' + (height + COLLAPSE_BUTTON_HEIGTH_IN_PX) + 'px';
+        tocInstance.style.marginTop = '-' + (height - COLLAPSE_BUTTON_HEIGTH_IN_PX) + 'px';
       }
 

[NoCoverage] ArrowFunction
blog/toc/desktop/BlogPostTocDesktopInner.tsx:477:55
         const idx = slugAndIndexAssoc[currentHeading];
         if (idx === undefined) return;
 
-        tocInstance.addEventListener('transitionend', (event) => updateScrollOnUncollapse(event));
+        tocInstance.addEventListener('transitionend', () => undefined);
         return;
       }

[NoCoverage] ArrowFunction
blog/toc/desktop/BlogPostTocDesktopInner.tsx:483:14
 
       applyCollapsedStyles();
 
-      return () => tocInstance.removeEventListener('transitionend', updateScrollOnUncollapse);
+      return () => undefined;
     },
     // eslint-disable-next-line react-hooks/exhaustive-deps

[NoCoverage] ArrayDeclaration
blog/toc/desktop/BlogPostTocDesktopInner.tsx:486:5
       return () => tocInstance.removeEventListener('transitionend', updateScrollOnUncollapse);
     },
     // eslint-disable-next-line react-hooks/exhaustive-deps
-    [isCollapsed]
+    []
   );
 

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:489:19
     [isCollapsed]
   );
 
-  useEffect(() => {
-    if (!isLargeScreen) return;
-
-    const handleResize = () => {
-      const maybeInferedHeading = inferCurrentHeading();
-      if (maybeInferedHeading) {
-        dropOldHeadingFocusAndSetCurrentHeading(maybeInferedHeading.id);
-      }
-    };
-
-    const throttledResizeHandler = throttle(handleResize, APPROX_120_FPS_THROTTLE_TIMING_IN_MS);
-
-    window.addEventListener('resize', throttledResizeHandler);
-
-    return () => {
-      window.removeEventListener('resize', throttledResizeHandler);
-    };
-  }, [isLargeScreen, inferCurrentHeading, dropOldHeadingFocusAndSetCurrentHeading]);
+  useEffect(() => {}, [isLargeScreen, inferCurrentHeading, dropOldHeadingFocusAndSetCurrentHeading]);
 
   useEffect(() => {

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:490:9
   );
 
   useEffect(() => {
-    if (!isLargeScreen) return;
+    if (isLargeScreen) return;
 
     const handleResize = () => {

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:492:32
   useEffect(() => {
     if (!isLargeScreen) return;
 
-    const handleResize = () => {
-      const maybeInferedHeading = inferCurrentHeading();
-      if (maybeInferedHeading) {
-        dropOldHeadingFocusAndSetCurrentHeading(maybeInferedHeading.id);
-      }
-    };
+    const handleResize = () => {};
 
     const throttledResizeHandler = throttle(handleResize, APPROX_120_FPS_THROTTLE_TIMING_IN_MS);

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:494:32
 
     const handleResize = () => {
       const maybeInferedHeading = inferCurrentHeading();
-      if (maybeInferedHeading) {
-        dropOldHeadingFocusAndSetCurrentHeading(maybeInferedHeading.id);
-      }
+      if (maybeInferedHeading) {}
     };
 

[NoCoverage] StringLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:501:29
 
     const throttledResizeHandler = throttle(handleResize, APPROX_120_FPS_THROTTLE_TIMING_IN_MS);
 
-    window.addEventListener('resize', throttledResizeHandler);
+    window.addEventListener("", throttledResizeHandler);
 
     return () => {

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:503:18
 
     window.addEventListener('resize', throttledResizeHandler);
 
-    return () => {
-      window.removeEventListener('resize', throttledResizeHandler);
-    };
+    return () => {};
   }, [isLargeScreen, inferCurrentHeading, dropOldHeadingFocusAndSetCurrentHeading]);
 

[NoCoverage] StringLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:504:34
     window.addEventListener('resize', throttledResizeHandler);
 
     return () => {
-      window.removeEventListener('resize', throttledResizeHandler);
+      window.removeEventListener("", throttledResizeHandler);
     };
   }, [isLargeScreen, inferCurrentHeading, dropOldHeadingFocusAndSetCurrentHeading]);

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:508:19
     };
   }, [isLargeScreen, inferCurrentHeading, dropOldHeadingFocusAndSetCurrentHeading]);
 
-  useEffect(() => {
-    if (!isLargeScreen) return;
-
-    const handleHashchange = () => {
-      const heading = getCurrentHeadingSlugFromHash();
-      if (heading !== null) {
-        forcedHeadingSlugRef.current = heading;
-        dropOldHeadingFocusAndSetCurrentHeading(heading);
-      }
-    };
-
-    window.addEventListener('hashchange', handleHashchange);
-
-    return () => {
-      window.removeEventListener('hashchange', handleHashchange);
-    };
-  }, [isLargeScreen, getCurrentHeadingSlugFromHash, dropOldHeadingFocusAndSetCurrentHeading]);
+  useEffect(() => {}, [isLargeScreen, getCurrentHeadingSlugFromHash, dropOldHeadingFocusAndSetCurrentHeading]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:511:36
   useEffect(() => {
     if (!isLargeScreen) return;
 
-    const handleHashchange = () => {
-      const heading = getCurrentHeadingSlugFromHash();
-      if (heading !== null) {
-        forcedHeadingSlugRef.current = heading;
-        dropOldHeadingFocusAndSetCurrentHeading(heading);
-      }
-    };
+    const handleHashchange = () => {};
 
     window.addEventListener('hashchange', handleHashchange);

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:513:29
 
     const handleHashchange = () => {
       const heading = getCurrentHeadingSlugFromHash();
-      if (heading !== null) {
-        forcedHeadingSlugRef.current = heading;
-        dropOldHeadingFocusAndSetCurrentHeading(heading);
-      }
+      if (heading !== null) {}
     };
 

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:521:18
 
     window.addEventListener('hashchange', handleHashchange);
 
-    return () => {
-      window.removeEventListener('hashchange', handleHashchange);
-    };
+    return () => {};
   }, [isLargeScreen, getCurrentHeadingSlugFromHash, dropOldHeadingFocusAndSetCurrentHeading]);
 

[NoCoverage] StringLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:522:34
     window.addEventListener('hashchange', handleHashchange);
 
     return () => {
-      window.removeEventListener('hashchange', handleHashchange);
+      window.removeEventListener("", handleHashchange);
     };
   }, [isLargeScreen, getCurrentHeadingSlugFromHash, dropOldHeadingFocusAndSetCurrentHeading]);

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:529:75
   useEffect(() => {
     if (!isLargeScreen) return;
 
-    function handleScrollUp(currentScrollY: PxValue, oldScrollY: PxValue) {
-      const handleScrollUpInstance = getRefCurrentPtr(handleScrollUpRef);
-      if (handleScrollUpInstance) handleScrollUpInstance(currentScrollY, oldScrollY);
-    }
+    function handleScrollUp(currentScrollY: PxValue, oldScrollY: PxValue) {}
 
     function handleScrollDown(currentScrollY: PxValue, oldScrollY: PxValue) {

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:531:11
 
     function handleScrollUp(currentScrollY: PxValue, oldScrollY: PxValue) {
       const handleScrollUpInstance = getRefCurrentPtr(handleScrollUpRef);
-      if (handleScrollUpInstance) handleScrollUpInstance(currentScrollY, oldScrollY);
+      if (true) handleScrollUpInstance(currentScrollY, oldScrollY);
     }
 

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:531:11
 
     function handleScrollUp(currentScrollY: PxValue, oldScrollY: PxValue) {
       const handleScrollUpInstance = getRefCurrentPtr(handleScrollUpRef);
-      if (handleScrollUpInstance) handleScrollUpInstance(currentScrollY, oldScrollY);
+      if (false) handleScrollUpInstance(currentScrollY, oldScrollY);
     }
 

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:534:77
       if (handleScrollUpInstance) handleScrollUpInstance(currentScrollY, oldScrollY);
     }
 
-    function handleScrollDown(currentScrollY: PxValue, oldScrollY: PxValue) {
-      const handleScrollDownInstance = getRefCurrentPtr(handleScrollDownRef);
-      if (handleScrollDownInstance) handleScrollDownInstance(currentScrollY, oldScrollY);
-    }
+    function handleScrollDown(currentScrollY: PxValue, oldScrollY: PxValue) {}
 
     function handleScroll() {

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:536:11
 
     function handleScrollDown(currentScrollY: PxValue, oldScrollY: PxValue) {
       const handleScrollDownInstance = getRefCurrentPtr(handleScrollDownRef);
-      if (handleScrollDownInstance) handleScrollDownInstance(currentScrollY, oldScrollY);
+      if (true) handleScrollDownInstance(currentScrollY, oldScrollY);
     }
 

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:536:11
 
     function handleScrollDown(currentScrollY: PxValue, oldScrollY: PxValue) {
       const handleScrollDownInstance = getRefCurrentPtr(handleScrollDownRef);
-      if (handleScrollDownInstance) handleScrollDownInstance(currentScrollY, oldScrollY);
+      if (false) handleScrollDownInstance(currentScrollY, oldScrollY);
     }
 

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:539:29
       if (handleScrollDownInstance) handleScrollDownInstance(currentScrollY, oldScrollY);
     }
 
-    function handleScroll() {
-      const currentScrollY = window.scrollY;
-      const oldScrollY = lastScrollY.current;
-      lastScrollY.current = currentScrollY;
-
-      handleScrollUp(currentScrollY, oldScrollY);
-      handleScrollDown(currentScrollY, oldScrollY);
-    }
+    function handleScroll() {}
 
     const throttledMagnetizationHandler = throttle(handleMagnetization, APPROX_120_FPS_THROTTLE_TIMING_IN_MS);

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:554:18
     window.addEventListener('scroll', throttledMagnetizationHandler);
     window.addEventListener('scroll', throttledScrollHandler);
 
-    return () => {
-      window.removeEventListener('scroll', throttledMagnetizationHandler);
-      window.removeEventListener('scroll', throttledScrollHandler);
-    };
+    return () => {};
   }, [isLargeScreen, handleMagnetization]);
 

[NoCoverage] StringLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:556:34
 
     return () => {
       window.removeEventListener('scroll', throttledMagnetizationHandler);
-      window.removeEventListener('scroll', throttledScrollHandler);
+      window.removeEventListener("", throttledScrollHandler);
     };
   }, [isLargeScreen, handleMagnetization]);

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:561:11
   }, [isLargeScreen, handleMagnetization]);
 
   useEffect(
-    () => {
-      function initializeHeadingSlug(): MaybeNull<HeadingSlug> {
-        const maybeHeadingSlugFromHash = getCurrentHeadingSlugFromHash(true);
-        if (maybeHeadingSlugFromHash) {
-          dropOldHeadingFocusAndSetCurrentHeading(maybeHeadingSlugFromHash);
-          return maybeHeadingSlugFromHash;
-        }
-
-        const maybeInferedHeading: MaybeNull<HeadingSlug> = inferCurrentHeading()?.id ?? null;
-        if (maybeInferedHeading) {
-          dropOldHeadingFocusAndSetCurrentHeading(maybeInferedHeading);
-          return maybeInferedHeading;
-        }
-
-        return null;
-      }
-
-      const maybeHeadingSlug = initializeHeadingSlug();
-      if (maybeHeadingSlug) forcedHeadingSlugRef.current = maybeHeadingSlug;
-
-      populateHandleScrollUpAndHandleScrollDown();
-      handleMagnetization();
-    },
+    () => {},
     // eslint-disable-next-line react-hooks/exhaustive-deps
     []

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:563:72
   useEffect(
     () => {
       function initializeHeadingSlug(): MaybeNull<HeadingSlug> {
-        const maybeHeadingSlugFromHash = getCurrentHeadingSlugFromHash(true);
+        const maybeHeadingSlugFromHash = getCurrentHeadingSlugFromHash(false);
         if (maybeHeadingSlugFromHash) {
           dropOldHeadingFocusAndSetCurrentHeading(maybeHeadingSlugFromHash);

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:564:39
     () => {
       function initializeHeadingSlug(): MaybeNull<HeadingSlug> {
         const maybeHeadingSlugFromHash = getCurrentHeadingSlugFromHash(true);
-        if (maybeHeadingSlugFromHash) {
-          dropOldHeadingFocusAndSetCurrentHeading(maybeHeadingSlugFromHash);
-          return maybeHeadingSlugFromHash;
-        }
+        if (maybeHeadingSlugFromHash) {}
 
         const maybeInferedHeading: MaybeNull<HeadingSlug> = inferCurrentHeading()?.id ?? null;

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:570:34
         }
 
         const maybeInferedHeading: MaybeNull<HeadingSlug> = inferCurrentHeading()?.id ?? null;
-        if (maybeInferedHeading) {
-          dropOldHeadingFocusAndSetCurrentHeading(maybeInferedHeading);
-          return maybeInferedHeading;
-        }
+        if (maybeInferedHeading) {}
 
         return null;

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:588:19
     []
   );
 
-  useEffect(() => {
-    if (!isLargeScreen) {
-      setDocumentHeadingsOnClickEvent(false);
-      return;
-    }
-
-    setDocumentHeadingsOnClickEvent();
-
-    return () => setDocumentHeadingsOnClickEvent(false);
-  }, [isLargeScreen, setDocumentHeadingsOnClickEvent]);
+  useEffect(() => {}, [isLargeScreen, setDocumentHeadingsOnClickEvent]);
 
   return (

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:589:9
   );
 
   useEffect(() => {
-    if (!isLargeScreen) {
+    if (false) {
       setDocumentHeadingsOnClickEvent(false);
       return;

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:589:9
   );
 
   useEffect(() => {
-    if (!isLargeScreen) {
+    if (true) {
       setDocumentHeadingsOnClickEvent(false);
       return;

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:590:39
 
   useEffect(() => {
     if (!isLargeScreen) {
-      setDocumentHeadingsOnClickEvent(false);
+      setDocumentHeadingsOnClickEvent(true);
       return;
     }

[NoCoverage] ArrowFunction
blog/toc/desktop/BlogPostTocDesktopInner.tsx:596:12
 
     setDocumentHeadingsOnClickEvent();
 
-    return () => setDocumentHeadingsOnClickEvent(false);
+    return () => undefined;
   }, [isLargeScreen, setDocumentHeadingsOnClickEvent]);
 

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:596:50
 
     setDocumentHeadingsOnClickEvent();
 
-    return () => setDocumentHeadingsOnClickEvent(false);
+    return () => setDocumentHeadingsOnClickEvent(true);
   }, [isLargeScreen, setDocumentHeadingsOnClickEvent]);
 

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:611:23
           <li
             className={cn('w-fit list-none text-sm font-bold text-white transition-all duration-200 ease-in-out', {
               // eslint-disable-next-line no-magic-numbers
-              'mt-2': heading.slug === currentHeading && slugAndIndexAssoc[heading.slug] === 0,
+              'mt-2': false,
               // eslint-disable-next-line no-magic-numbers
               'font-medium': 3 <= heading.depth && heading.depth <= 6,

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:611:58
           <li
             className={cn('w-fit list-none text-sm font-bold text-white transition-all duration-200 ease-in-out', {
               // eslint-disable-next-line no-magic-numbers
-              'mt-2': heading.slug === currentHeading && slugAndIndexAssoc[heading.slug] === 0,
+              'mt-2': heading.slug === currentHeading && true,
               // eslint-disable-next-line no-magic-numbers
               'font-medium': 3 <= heading.depth && heading.depth <= 6,

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:613:52
               // eslint-disable-next-line no-magic-numbers
               'mt-2': heading.slug === currentHeading && slugAndIndexAssoc[heading.slug] === 0,
               // eslint-disable-next-line no-magic-numbers
-              'font-medium': 3 <= heading.depth && heading.depth <= 6,
+              'font-medium': 3 <= heading.depth && true,
               // eslint-disable-next-line no-magic-numbers
               'ml-6': heading.depth === 5 || heading.depth === 6,

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:613:52
               // eslint-disable-next-line no-magic-numbers
               'mt-2': heading.slug === currentHeading && slugAndIndexAssoc[heading.slug] === 0,
               // eslint-disable-next-line no-magic-numbers
-              'font-medium': 3 <= heading.depth && heading.depth <= 6,
+              'font-medium': 3 <= heading.depth && heading.depth > 6,
               // eslint-disable-next-line no-magic-numbers
               'ml-6': heading.depth === 5 || heading.depth === 6,

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:615:23
               // eslint-disable-next-line no-magic-numbers
               'font-medium': 3 <= heading.depth && heading.depth <= 6,
               // eslint-disable-next-line no-magic-numbers
-              'ml-6': heading.depth === 5 || heading.depth === 6,
+              'ml-6': true,
               // eslint-disable-next-line no-magic-numbers
               'ml-4': heading.depth === 4,

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:615:46
               // eslint-disable-next-line no-magic-numbers
               'font-medium': 3 <= heading.depth && heading.depth <= 6,
               // eslint-disable-next-line no-magic-numbers
-              'ml-6': heading.depth === 5 || heading.depth === 6,
+              'ml-6': heading.depth === 5 || heading.depth !== 6,
               // eslint-disable-next-line no-magic-numbers
               'ml-4': heading.depth === 4,

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:617:23
               // eslint-disable-next-line no-magic-numbers
               'ml-6': heading.depth === 5 || heading.depth === 6,
               // eslint-disable-next-line no-magic-numbers
-              'ml-4': heading.depth === 4,
+              'ml-4': false,
               // eslint-disable-next-line no-magic-numbers
               'ml-2': heading.depth === 3

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:617:23
               // eslint-disable-next-line no-magic-numbers
               'ml-6': heading.depth === 5 || heading.depth === 6,
               // eslint-disable-next-line no-magic-numbers
-              'ml-4': heading.depth === 4,
+              'ml-4': heading.depth !== 4,
               // eslint-disable-next-line no-magic-numbers
               'ml-2': heading.depth === 3

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:619:23
               // eslint-disable-next-line no-magic-numbers
               'ml-4': heading.depth === 4,
               // eslint-disable-next-line no-magic-numbers
-              'ml-2': heading.depth === 3
+              'ml-2': true
             })}
             key={heading.slug}

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:619:23
               // eslint-disable-next-line no-magic-numbers
               'ml-4': heading.depth === 4,
               // eslint-disable-next-line no-magic-numbers
-              'ml-2': heading.depth === 3
+              'ml-2': heading.depth !== 3
             })}
             key={heading.slug}

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:623:15
             })}
             key={heading.slug}
           >
-            {(!isCollapsed && (
+            {(isCollapsed && (
               <Link
                 className={cn('block transition-all', {
