[NoCoverage] LogicalOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:623:14
             })}
             key={heading.slug}
           >
-            {(!isCollapsed && (
-              <Link
-                className={cn('block transition-all', {
-                  'rounded-md bg-primary p-1 font-bold': heading.slug === currentHeading,
-                  'hover:underline focus:text-primary': heading.slug !== currentHeading,
-                  // eslint-disable-next-line no-magic-numbers
-                  'p-1': slugAndIndexAssoc[heading.slug] === headings.length - 1
-                })}
-                onClick={(event) => {
-                  onClickMagic(event, heading);
-                }}
-                href={`#${heading.slug}`}
-                replace
-              >
-                {heading.content}
-              </Link>
-            )) || (
-              <p className="cursor-default select-none" aria-hidden="true">
-                {heading.content}
-              </p>
-            )}
+            {!isCollapsed && <Link className={cn('block transition-all', {
+  'rounded-md bg-primary p-1 font-bold': heading.slug === currentHeading,
+  'hover:underline focus:text-primary': heading.slug !== currentHeading,
+  // eslint-disable-next-line no-magic-numbers
+  'p-1': slugAndIndexAssoc[heading.slug] === headings.length - 1
+})} onClick={event => {
+  onClickMagic(event, heading);
+}} href={`#${heading.slug}`} replace>
+                {heading.content}
+              </Link> && <p className="cursor-default select-none" aria-hidden="true">
+                {heading.content}
+              </p>}
           </li>
         ))}

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:626:58
             {(!isCollapsed && (
               <Link
                 className={cn('block transition-all', {
-                  'rounded-md bg-primary p-1 font-bold': heading.slug === currentHeading,
+                  'rounded-md bg-primary p-1 font-bold': true,
                   'hover:underline focus:text-primary': heading.slug !== currentHeading,
                   // eslint-disable-next-line no-magic-numbers

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:626:58
             {(!isCollapsed && (
               <Link
                 className={cn('block transition-all', {
-                  'rounded-md bg-primary p-1 font-bold': heading.slug === currentHeading,
+                  'rounded-md bg-primary p-1 font-bold': heading.slug !== currentHeading,
                   'hover:underline focus:text-primary': heading.slug !== currentHeading,
                   // eslint-disable-next-line no-magic-numbers

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:627:57
               <Link
                 className={cn('block transition-all', {
                   'rounded-md bg-primary p-1 font-bold': heading.slug === currentHeading,
-                  'hover:underline focus:text-primary': heading.slug !== currentHeading,
+                  'hover:underline focus:text-primary': heading.slug === currentHeading,
                   // eslint-disable-next-line no-magic-numbers
                   'p-1': slugAndIndexAssoc[heading.slug] === headings.length - 1

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopInner.tsx:627:57
               <Link
                 className={cn('block transition-all', {
                   'rounded-md bg-primary p-1 font-bold': heading.slug === currentHeading,
-                  'hover:underline focus:text-primary': heading.slug !== currentHeading,
+                  'hover:underline focus:text-primary': false,
                   // eslint-disable-next-line no-magic-numbers
                   'p-1': slugAndIndexAssoc[heading.slug] === headings.length - 1

[NoCoverage] ArithmeticOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:629:62
                   'rounded-md bg-primary p-1 font-bold': heading.slug === currentHeading,
                   'hover:underline focus:text-primary': heading.slug !== currentHeading,
                   // eslint-disable-next-line no-magic-numbers
-                  'p-1': slugAndIndexAssoc[heading.slug] === headings.length - 1
+                  'p-1': slugAndIndexAssoc[heading.slug] === headings.length + 1
                 })}
                 onClick={(event) => {

[NoCoverage] EqualityOperator
blog/toc/desktop/BlogPostTocDesktopInner.tsx:629:26
                   'rounded-md bg-primary p-1 font-bold': heading.slug === currentHeading,
                   'hover:underline focus:text-primary': heading.slug !== currentHeading,
                   // eslint-disable-next-line no-magic-numbers
-                  'p-1': slugAndIndexAssoc[heading.slug] === headings.length - 1
+                  'p-1': slugAndIndexAssoc[heading.slug] !== headings.length - 1
                 })}
                 onClick={(event) => {

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopInner.tsx:631:37
                   // eslint-disable-next-line no-magic-numbers
                   'p-1': slugAndIndexAssoc[heading.slug] === headings.length - 1
                 })}
-                onClick={(event) => {
-                  onClickMagic(event, heading);
-                }}
+                onClick={(event) => {}}
                 href={`#${heading.slug}`}
                 replace

[NoCoverage] StringLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:634:23
                 onClick={(event) => {
                   onClickMagic(event, heading);
                 }}
-                href={`#${heading.slug}`}
+                href={``}
                 replace
               >

[NoCoverage] StringLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:649:25
       </ol>
       {
         <BlogPostTocCollapseButton
-          className={cn('relative top-6 z-10 opacity-100 transition-opacity duration-200', {
+          className={cn("", {
             'opacity-0': !isMagnetized,
             'top-4': isCollapsed

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:650:26
       {
         <BlogPostTocCollapseButton
           className={cn('relative top-6 z-10 opacity-100 transition-opacity duration-200', {
-            'opacity-0': !isMagnetized,
+            'opacity-0': isMagnetized,
             'top-4': isCollapsed
           })}

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:654:24
             'top-4': isCollapsed
           })}
           setIsCollapsed={setIsCollapsed}
-          aria-hidden={!isMagnetized}
+          aria-hidden={isMagnetized}
           isDisabled={!isMagnetized}
           isCollapsed={isCollapsed}

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopInner.tsx:655:23
           })}
           setIsCollapsed={setIsCollapsed}
           aria-hidden={!isMagnetized}
-          isDisabled={!isMagnetized}
+          isDisabled={isMagnetized}
           isCollapsed={isCollapsed}
         />
