[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopLazy.tsx:26:61
   const isLargeScreen = useIsLargeScreen();
 
   const [Component, setComponent] = useState<MaybeNull<FunctionComponent<BlogPostTocDesktopInnerProps>>>(null);
-  const [isMagnetized, setIsMagnetized] = useState<boolean>(false);
+  const [isMagnetized, setIsMagnetized] = useState<boolean>(true);
   const [isCollapsed, setIsCollapsed] = useState<boolean>(false);
 

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopLazy.tsx:27:59
 
   const [Component, setComponent] = useState<MaybeNull<FunctionComponent<BlogPostTocDesktopInnerProps>>>(null);
   const [isMagnetized, setIsMagnetized] = useState<boolean>(false);
-  const [isCollapsed, setIsCollapsed] = useState<boolean>(false);
+  const [isCollapsed, setIsCollapsed] = useState<boolean>(true);
 
   useEffect(() => {

[NoCoverage] BlockStatement
blog/toc/desktop/BlogPostTocDesktopLazy.tsx:29:19
   const [isMagnetized, setIsMagnetized] = useState<boolean>(false);
   const [isCollapsed, setIsCollapsed] = useState<boolean>(false);
 
-  useEffect(() => {
-    if (!isLargeScreen || Component !== null) return;
-    // eslint-disable-next-line promise/catch-or-return
-    import('./BlogPostTocDesktopInner').then((component) => setComponent(() => component.default));
-  });
+  useEffect(() => {});
 
   if (Component === null) return placeholder;

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopLazy.tsx:30:27
   const [isCollapsed, setIsCollapsed] = useState<boolean>(false);
 
   useEffect(() => {
-    if (!isLargeScreen || Component !== null) return;
+    if (!isLargeScreen || false) return;
     // eslint-disable-next-line promise/catch-or-return
     import('./BlogPostTocDesktopInner').then((component) => setComponent(() => component.default));

[NoCoverage] ConditionalExpression
blog/toc/desktop/BlogPostTocDesktopLazy.tsx:30:9
   const [isCollapsed, setIsCollapsed] = useState<boolean>(false);
 
   useEffect(() => {
-    if (!isLargeScreen || Component !== null) return;
+    if (true) return;
     // eslint-disable-next-line promise/catch-or-return
     import('./BlogPostTocDesktopInner').then((component) => setComponent(() => component.default));

[NoCoverage] ArrowFunction
blog/toc/desktop/BlogPostTocDesktopLazy.tsx:32:46
   useEffect(() => {
     if (!isLargeScreen || Component !== null) return;
     // eslint-disable-next-line promise/catch-or-return
-    import('./BlogPostTocDesktopInner').then((component) => setComponent(() => component.default));
+    import('./BlogPostTocDesktopInner').then(() => undefined);
   });
 

[NoCoverage] ArrowFunction
blog/toc/desktop/BlogPostTocDesktopLazy.tsx:32:74
   useEffect(() => {
     if (!isLargeScreen || Component !== null) return;
     // eslint-disable-next-line promise/catch-or-return
-    import('./BlogPostTocDesktopInner').then((component) => setComponent(() => component.default));
+    import('./BlogPostTocDesktopInner').then((component) => setComponent(() => undefined));
   });
 

[NoCoverage] BooleanLiteral
blog/toc/desktop/BlogPostTocDesktopLazy.tsx:46:24
         className={cn('relative z-10 rounded-b-none rounded-t-lg bg-black transition-[border-radius] duration-150 dark:bg-card', {
           'rounded-t-none': isMagnetized,
           'rounded-b-lg': isCollapsed,
-          'delay-200': !isMagnetized
+          'delay-200': isMagnetized
         })}
       >
