[NoCoverage] BooleanLiteral
blog/toc/mobile/BlogPostTocMobile.tsx:9:136
 
 import type { SharedBlogPostTocProps } from '../types';
 
-const BlogPostTocMobileLazy = dynamic(() => import('./BlogPostTocMobileLazy'), { loading: () => <div className="min-h-[62px]" />, ssr: false });
+const BlogPostTocMobileLazy = dynamic(() => import('./BlogPostTocMobileLazy'), { loading: () => <div className="min-h-[62px]" />, ssr: true });
 
 interface BlogPostTocMobileProps extends SharedBlogPostTocProps {}

[NoCoverage] ArrowFunction
blog/toc/mobile/BlogPostTocMobile.tsx:13:70
 
 interface BlogPostTocMobileProps extends SharedBlogPostTocProps {}
 
-const BlogPostTocMobile: FunctionComponent<BlogPostTocMobileProps> = ({ headings }) => <BlogPostTocMobileLazy headings={headings} />;
+const BlogPostTocMobile: FunctionComponent<BlogPostTocMobileProps> = () => undefined;
 
 export default BlogPostTocMobile;
