[NoCoverage] ObjectLiteral
blog/toc/mobile/BlogPostTocMobileInner.tsx:17:106
   headings.map((heading) => (
     <AccordionContent data-pagefind-ignore="all" key={heading.slug}>
       <Link
-        className={cn('text-lg font-bold transition-colors duration-200 ease-in-out hover:text-primary', {
-          // eslint-disable-next-line no-magic-numbers
-          'font-medium': 3 <= heading.depth && heading.depth <= 6,
-          // eslint-disable-next-line no-magic-numbers
-          'ml-6': heading.depth === 5 || heading.depth === 6,
-          // eslint-disable-next-line no-magic-numbers
-          'ml-4': heading.depth === 4,
-          // eslint-disable-next-line no-magic-numbers
-          'ml-2': heading.depth === 3
-        })}
+        className={cn('text-lg font-bold transition-colors duration-200 ease-in-out hover:text-primary', {})}
         href={'#' + heading.slug}
         replace

[NoCoverage] StringLiteral
blog/toc/mobile/BlogPostTocMobileInner.tsx:17:23
   headings.map((heading) => (
     <AccordionContent data-pagefind-ignore="all" key={heading.slug}>
       <Link
-        className={cn('text-lg font-bold transition-colors duration-200 ease-in-out hover:text-primary', {
+        className={cn("", {
           // eslint-disable-next-line no-magic-numbers
           'font-medium': 3 <= heading.depth && heading.depth <= 6,

[NoCoverage] ConditionalExpression
blog/toc/mobile/BlogPostTocMobileInner.tsx:19:26
       <Link
         className={cn('text-lg font-bold transition-colors duration-200 ease-in-out hover:text-primary', {
           // eslint-disable-next-line no-magic-numbers
-          'font-medium': 3 <= heading.depth && heading.depth <= 6,
+          'font-medium': false,
           // eslint-disable-next-line no-magic-numbers
           'ml-6': heading.depth === 5 || heading.depth === 6,

[NoCoverage] ConditionalExpression
blog/toc/mobile/BlogPostTocMobileInner.tsx:21:42
           // eslint-disable-next-line no-magic-numbers
           'font-medium': 3 <= heading.depth && heading.depth <= 6,
           // eslint-disable-next-line no-magic-numbers
-          'ml-6': heading.depth === 5 || heading.depth === 6,
+          'ml-6': heading.depth === 5 || false,
           // eslint-disable-next-line no-magic-numbers
           'ml-4': heading.depth === 4,

[NoCoverage] StringLiteral
blog/toc/mobile/BlogPostTocMobileInner.tsx:27:15
           // eslint-disable-next-line no-magic-numbers
           'ml-2': heading.depth === 3
         })}
-        href={'#' + heading.slug}
+        href={"" + heading.slug}
         replace
       >
