[NoCoverage] BlockStatement
blog/toc/mobile/BlogPostTocMobileLazy.tsx:23:19
 
   const [Component, setComponent] = useState<MaybeNull<FunctionComponent<BlogPostTocMobileInnerProps>>>(null);
 
-  useEffect(() => {
-    if (isLargeScreen || Component !== null) return;
-    // eslint-disable-next-line promise/catch-or-return
-    import('./BlogPostTocMobileInner').then((component) => setComponent(() => component.default));
-  });
+  useEffect(() => {});
 
   if (Component === null) return placeholder;

[NoCoverage] EqualityOperator
blog/toc/mobile/BlogPostTocMobileLazy.tsx:24:26
   const [Component, setComponent] = useState<MaybeNull<FunctionComponent<BlogPostTocMobileInnerProps>>>(null);
 
   useEffect(() => {
-    if (isLargeScreen || Component !== null) return;
+    if (isLargeScreen || Component === null) return;
     // eslint-disable-next-line promise/catch-or-return
     import('./BlogPostTocMobileInner').then((component) => setComponent(() => component.default));

[NoCoverage] ConditionalExpression
blog/toc/mobile/BlogPostTocMobileLazy.tsx:24:9
   const [Component, setComponent] = useState<MaybeNull<FunctionComponent<BlogPostTocMobileInnerProps>>>(null);
 
   useEffect(() => {
-    if (isLargeScreen || Component !== null) return;
+    if (false) return;
     // eslint-disable-next-line promise/catch-or-return
     import('./BlogPostTocMobileInner').then((component) => setComponent(() => component.default));

[NoCoverage] ArrowFunction
blog/toc/mobile/BlogPostTocMobileLazy.tsx:26:45
   useEffect(() => {
     if (isLargeScreen || Component !== null) return;
     // eslint-disable-next-line promise/catch-or-return
-    import('./BlogPostTocMobileInner').then((component) => setComponent(() => component.default));
+    import('./BlogPostTocMobileInner').then(() => undefined);
   });
 

[NoCoverage] ArrowFunction
blog/toc/mobile/BlogPostTocMobileLazy.tsx:26:73
   useEffect(() => {
     if (isLargeScreen || Component !== null) return;
     // eslint-disable-next-line promise/catch-or-return
-    import('./BlogPostTocMobileInner').then((component) => setComponent(() => component.default));
+    import('./BlogPostTocMobileInner').then((component) => setComponent(() => undefined));
   });
 
