[NoCoverage] MethodExpression
components/ui/breadcrumbs/Breadcrumbs.tsx:37:30
 ): ReactElement[] {
   function buildCurrentPath(pathParts: string[], depth: Index) {
     // eslint-disable-next-line no-magic-numbers
-    const currentPathParts = pathParts.slice(0, depth + 1);
+    const currentPathParts = pathParts;
     const currentPath = buildAbsolutePathFromParts(...currentPathParts);
     return currentPath;

[NoCoverage] ArithmeticOperator
components/ui/breadcrumbs/Breadcrumbs.tsx:37:49
 ): ReactElement[] {
   function buildCurrentPath(pathParts: string[], depth: Index) {
     // eslint-disable-next-line no-magic-numbers
-    const currentPathParts = pathParts.slice(0, depth + 1);
+    const currentPathParts = pathParts.slice(0, depth - 1);
     const currentPath = buildAbsolutePathFromParts(...currentPathParts);
     return currentPath;

[NoCoverage] ArithmeticOperator
components/ui/breadcrumbs/Breadcrumbs.tsx:53:53
 
   function crumbGenerator(depth: Index, isLeaf: boolean, href: string) {
     // eslint-disable-next-line no-magic-numbers
-    if (customCrumbs && customCrumbsDepths.includes(depth + 1)) {
+    if (customCrumbs && customCrumbsDepths.includes(depth - 1)) {
       // eslint-disable-next-line no-magic-numbers
       return (customCrumbs.find(({ depth: _depth }) => _depth === depth + 1) as CustomCrumb).jsx;

[NoCoverage] BlockStatement
components/ui/breadcrumbs/Breadcrumbs.tsx:53:65
 
   function crumbGenerator(depth: Index, isLeaf: boolean, href: string) {
     // eslint-disable-next-line no-magic-numbers
-    if (customCrumbs && customCrumbsDepths.includes(depth + 1)) {
-      // eslint-disable-next-line no-magic-numbers
-      return (customCrumbs.find(({ depth: _depth }) => _depth === depth + 1) as CustomCrumb).jsx;
-    }
+    if (customCrumbs && customCrumbsDepths.includes(depth + 1)) {}
 
     const label = pagesTitlesParts[depth];

[NoCoverage] UpdateOperator
components/ui/breadcrumbs/Breadcrumbs.tsx:62:49
     return <Crumb isLeaf={isLeaf} label={label} href={href} />;
   }
 
-  for (let depth = 0; depth < pathParts.length; depth++) {
+  for (let depth = 0; depth < pathParts.length; depth--) {
     // eslint-disable-next-line no-magic-numbers
     const isLeaf = pathParts[depth + 1] === undefined;

[NoCoverage] ConditionalExpression
components/ui/breadcrumbs/Breadcrumbs.tsx:62:23
     return <Crumb isLeaf={isLeaf} label={label} href={href} />;
   }
 
-  for (let depth = 0; depth < pathParts.length; depth++) {
+  for (let depth = 0; false; depth++) {
     // eslint-disable-next-line no-magic-numbers
     const isLeaf = pathParts[depth + 1] === undefined;

[NoCoverage] ArithmeticOperator
components/ui/breadcrumbs/Breadcrumbs.tsx:64:30
 
   for (let depth = 0; depth < pathParts.length; depth++) {
     // eslint-disable-next-line no-magic-numbers
-    const isLeaf = pathParts[depth + 1] === undefined;
+    const isLeaf = pathParts[depth - 1] === undefined;
     const href = buildCurrentPath(pathParts, depth);
     const crumb = crumbGenerator(depth, isLeaf, href);

[NoCoverage] ConditionalExpression
components/ui/breadcrumbs/Breadcrumbs.tsx:64:20
 
   for (let depth = 0; depth < pathParts.length; depth++) {
     // eslint-disable-next-line no-magic-numbers
-    const isLeaf = pathParts[depth + 1] === undefined;
+    const isLeaf = false;
     const href = buildCurrentPath(pathParts, depth);
     const crumb = crumbGenerator(depth, isLeaf, href);

[NoCoverage] ArrayDeclaration
components/ui/breadcrumbs/Breadcrumbs.tsx:76:91
 const Breadcrumbs: FunctionComponent<BreadcrumbsProps> = ({ withHomepageElement: maybeWithHomepageElement, customCrumbs, className }) => {
   const pathname = usePathname();
   const globalT = getClientSideI18n();
-  const customCrumbsDepths = useMemo(() => customCrumbs?.map(({ depth }) => depth) ?? [], [customCrumbs]);
+  const customCrumbsDepths = useMemo(() => customCrumbs?.map(({ depth }) => depth) ?? [], []);
 
   const withHomepageElement = Boolean(maybeWithHomepageElement);

[NoCoverage] EqualityOperator
components/ui/breadcrumbs/Breadcrumbs.tsx:79:7
   const customCrumbsDepths = useMemo(() => customCrumbs?.map(({ depth }) => depth) ?? [], [customCrumbs]);
 
   const withHomepageElement = Boolean(maybeWithHomepageElement);
-  if (pathname === ROUTES_ROOTS.WEBSITE) return withHomepageElement ? <HomepageCrumb isLeaf /> : null;
+  if (pathname !== ROUTES_ROOTS.WEBSITE) return withHomepageElement ? <HomepageCrumb isLeaf /> : null;
 
   const pathParts = getPathParts(pathname);

[NoCoverage] ConditionalExpression
components/ui/breadcrumbs/Breadcrumbs.tsx:79:7
   const customCrumbsDepths = useMemo(() => customCrumbs?.map(({ depth }) => depth) ?? [], [customCrumbs]);
 
   const withHomepageElement = Boolean(maybeWithHomepageElement);
-  if (pathname === ROUTES_ROOTS.WEBSITE) return withHomepageElement ? <HomepageCrumb isLeaf /> : null;
+  if (true) return withHomepageElement ? <HomepageCrumb isLeaf /> : null;
 
   const pathParts = getPathParts(pathname);

[NoCoverage] ConditionalExpression
components/ui/breadcrumbs/Breadcrumbs.tsx:84:9
   const pathParts = getPathParts(pathname);
   const pagesTitlesParts = pathParts.reduce((acc, part, currentIndex) => {
     // eslint-disable-next-line no-magic-numbers
-    if (customCrumbsDepths.includes(currentIndex + 1)) {
+    if (true) {
       acc.push('');
       return acc;

[NoCoverage] ConditionalExpression
components/ui/breadcrumbs/Breadcrumbs.tsx:84:9
   const pathParts = getPathParts(pathname);
   const pagesTitlesParts = pathParts.reduce((acc, part, currentIndex) => {
     // eslint-disable-next-line no-magic-numbers
-    if (customCrumbsDepths.includes(currentIndex + 1)) {
+    if (false) {
       acc.push('');
       return acc;

[NoCoverage] StringLiteral
components/ui/breadcrumbs/Breadcrumbs.tsx:85:16
   const pagesTitlesParts = pathParts.reduce((acc, part, currentIndex) => {
     // eslint-disable-next-line no-magic-numbers
     if (customCrumbsDepths.includes(currentIndex + 1)) {
-      acc.push('');
+      acc.push("Stryker was here!");
       return acc;
     }

[NoCoverage] BooleanLiteral
components/ui/breadcrumbs/Breadcrumbs.tsx:89:26
       return acc;
     }
 
-    const missingLabel = !Object.keys(PAGES_TITLES).includes(part);
+    const missingLabel = Object.keys(PAGES_TITLES).includes(part);
     if (missingLabel) throw new Error(`Missing pages-titles label: ${part}`);
 

[NoCoverage] ConditionalExpression
components/ui/breadcrumbs/Breadcrumbs.tsx:90:9
     }
 
     const missingLabel = !Object.keys(PAGES_TITLES).includes(part);
-    if (missingLabel) throw new Error(`Missing pages-titles label: ${part}`);
+    if (false) throw new Error(`Missing pages-titles label: ${part}`);
 
     acc.push(globalT(`${i18ns.pagesTitles}.${part}` as I18nVocabTarget));

[NoCoverage] ConditionalExpression
components/ui/breadcrumbs/Breadcrumbs.tsx:90:9
     }
 
     const missingLabel = !Object.keys(PAGES_TITLES).includes(part);
-    if (missingLabel) throw new Error(`Missing pages-titles label: ${part}`);
+    if (true) throw new Error(`Missing pages-titles label: ${part}`);
 
     acc.push(globalT(`${i18ns.pagesTitles}.${part}` as I18nVocabTarget));
