[NoCoverage] StringLiteral
components/ui/breadcrumbs/Crumb.tsx:21:23
   return (
     <>
       <Link
-        className={cn('duration-250 transition-opacity', {
+        className={cn("", {
           'opacity-60 hover:opacity-100 focus:opacity-100': !isLeaf,
           'pointer-events-none font-semibold': isLeaf

[NoCoverage] ObjectLiteral
components/ui/breadcrumbs/Crumb.tsx:21:58
   return (
     <>
       <Link
-        className={cn('duration-250 transition-opacity', {
-          'opacity-60 hover:opacity-100 focus:opacity-100': !isLeaf,
-          'pointer-events-none font-semibold': isLeaf
-        })}
+        className={cn('duration-250 transition-opacity', {})}
         aria-disabled={isLeaf ? 'true' : undefined}
         aria-current={isLeaf ? 'page' : undefined}

[NoCoverage] BooleanLiteral
components/ui/breadcrumbs/Crumb.tsx:22:61
     <>
       <Link
         className={cn('duration-250 transition-opacity', {
-          'opacity-60 hover:opacity-100 focus:opacity-100': !isLeaf,
+          'opacity-60 hover:opacity-100 focus:opacity-100': isLeaf,
           'pointer-events-none font-semibold': isLeaf
         })}

[NoCoverage] ConditionalExpression
components/ui/breadcrumbs/Crumb.tsx:31:8
       >
         {label}
       </Link>
-      {!isLeaf && <CrumbSeparator />}
+      {false}
     </>
   );

[NoCoverage] ConditionalExpression
components/ui/breadcrumbs/Crumb.tsx:31:8
       >
         {label}
       </Link>
-      {!isLeaf && <CrumbSeparator />}
+      {true}
     </>
   );
