[NoCoverage] ArrowFunction
components/ui/breadcrumbs/CrumbSeparator.tsx:5:64
 
 interface CrumbSeparatorProps {}
 
-const CrumbSeparator: FunctionComponent<CrumbSeparatorProps> = () => (
-  <span className="mx-1 select-none text-black text-opacity-50 dark:text-white" aria-hidden="true">
-    /
-  </span>
-);
+const CrumbSeparator: FunctionComponent<CrumbSeparatorProps> = () => undefined;
 
 export default CrumbSeparator;
