[NoCoverage] ArrowFunction
ui/breadcrumbs/custom/BlogPostCrumb.tsx:10:62
   url: string;
 }
 
-const BlogPostCrumb: FunctionComponent<BlogPostCrumbProps> = ({ label, url }) => <Crumb label={label} href={url} isLeaf />;
+const BlogPostCrumb: FunctionComponent<BlogPostCrumbProps> = () => undefined;
 
 export default BlogPostCrumb;
