[NoCoverage] BlockStatement
components/ui/cta/Logo.tsx:34:44
   const [onLoadAnimation, setOnLoadAnimation] = useState<string>(onPageEnterAnimation ? ON_PAGE_ENTER_CLS : '');
   const globalT = getClientSideI18n();
 
-  const onMouseEnterCb = useCallback(() => {
-    if (onLoadAnimation || !animatedOnHover) return;
-
-    const imgInstance = getRefCurrentPtr(imgRef);
-    if (!imgInstance) return;
-
-    imgInstance.style.animationName = 'gelatine';
-    imgInstance.style.animationDuration = '285ms';
-    imgInstance.style.animationTimingFunction = 'ease-in-out';
-
-    const oldAnimationName = imgInstance.style.animationName;
-    imgInstance.style.animationName = 'none';
-    window.requestAnimationFrame(() => {
-      imgInstance.style.animationName = oldAnimationName;
-    });
-  }, [onLoadAnimation, animatedOnHover]);
+  const onMouseEnterCb = useCallback(() => {}, [onLoadAnimation, animatedOnHover]);
 
   useEffect(() => {

[NoCoverage] BooleanLiteral
components/ui/cta/Logo.tsx:35:28
   const globalT = getClientSideI18n();
 
   const onMouseEnterCb = useCallback(() => {
-    if (onLoadAnimation || !animatedOnHover) return;
+    if (onLoadAnimation || animatedOnHover) return;
 
     const imgInstance = getRefCurrentPtr(imgRef);

[NoCoverage] LogicalOperator
components/ui/cta/Logo.tsx:35:9
   const globalT = getClientSideI18n();
 
   const onMouseEnterCb = useCallback(() => {
-    if (onLoadAnimation || !animatedOnHover) return;
+    if (onLoadAnimation && !animatedOnHover) return;
 
     const imgInstance = getRefCurrentPtr(imgRef);

[NoCoverage] ConditionalExpression
components/ui/cta/Logo.tsx:38:9
     if (onLoadAnimation || !animatedOnHover) return;
 
     const imgInstance = getRefCurrentPtr(imgRef);
-    if (!imgInstance) return;
+    if (true) return;
 
     imgInstance.style.animationName = 'gelatine';

[NoCoverage] ConditionalExpression
components/ui/cta/Logo.tsx:38:9
     if (onLoadAnimation || !animatedOnHover) return;
 
     const imgInstance = getRefCurrentPtr(imgRef);
-    if (!imgInstance) return;
+    if (false) return;
 
     imgInstance.style.animationName = 'gelatine';

[NoCoverage] StringLiteral
components/ui/cta/Logo.tsx:40:39
     const imgInstance = getRefCurrentPtr(imgRef);
     if (!imgInstance) return;
 
-    imgInstance.style.animationName = 'gelatine';
+    imgInstance.style.animationName = "";
     imgInstance.style.animationDuration = '285ms';
     imgInstance.style.animationTimingFunction = 'ease-in-out';

[NoCoverage] StringLiteral
components/ui/cta/Logo.tsx:42:49
 
     imgInstance.style.animationName = 'gelatine';
     imgInstance.style.animationDuration = '285ms';
-    imgInstance.style.animationTimingFunction = 'ease-in-out';
+    imgInstance.style.animationTimingFunction = "";
 
     const oldAnimationName = imgInstance.style.animationName;

[NoCoverage] StringLiteral
components/ui/cta/Logo.tsx:45:39
     imgInstance.style.animationTimingFunction = 'ease-in-out';
 
     const oldAnimationName = imgInstance.style.animationName;
-    imgInstance.style.animationName = 'none';
+    imgInstance.style.animationName = "";
     window.requestAnimationFrame(() => {
       imgInstance.style.animationName = oldAnimationName;

[NoCoverage] BlockStatement
components/ui/cta/Logo.tsx:46:40
 
     const oldAnimationName = imgInstance.style.animationName;
     imgInstance.style.animationName = 'none';
-    window.requestAnimationFrame(() => {
-      imgInstance.style.animationName = oldAnimationName;
-    });
+    window.requestAnimationFrame(() => {});
   }, [onLoadAnimation, animatedOnHover]);
 

[NoCoverage] BlockStatement
components/ui/cta/Logo.tsx:51:19
     });
   }, [onLoadAnimation, animatedOnHover]);
 
-  useEffect(() => {
-    const imgInstance = getRefCurrentPtr(imgRef);
-    if (!imgInstance) return;
-
-    function firstAnimationEndHandler() {
-      setOnLoadAnimation('');
-      imgInstance.removeEventListener('animationend', firstAnimationEndHandler);
-    }
-
-    imgInstance.addEventListener('animationend', firstAnimationEndHandler);
-    return () => imgInstance.removeEventListener('animationend', firstAnimationEndHandler);
-  }, []);
+  useEffect(() => {}, []);
 
   useEffect(() => {

[NoCoverage] BlockStatement
components/ui/cta/Logo.tsx:55:41
     const imgInstance = getRefCurrentPtr(imgRef);
     if (!imgInstance) return;
 
-    function firstAnimationEndHandler() {
-      setOnLoadAnimation('');
-      imgInstance.removeEventListener('animationend', firstAnimationEndHandler);
-    }
+    function firstAnimationEndHandler() {}
 
     imgInstance.addEventListener('animationend', firstAnimationEndHandler);

[NoCoverage] ArrowFunction
components/ui/cta/Logo.tsx:61:12
     }
 
     imgInstance.addEventListener('animationend', firstAnimationEndHandler);
-    return () => imgInstance.removeEventListener('animationend', firstAnimationEndHandler);
+    return () => undefined;
   }, []);
 

[NoCoverage] StringLiteral
components/ui/cta/Logo.tsx:61:50
     }
 
     imgInstance.addEventListener('animationend', firstAnimationEndHandler);
-    return () => imgInstance.removeEventListener('animationend', firstAnimationEndHandler);
+    return () => imgInstance.removeEventListener("", firstAnimationEndHandler);
   }, []);
 

[NoCoverage] BlockStatement
components/ui/cta/Logo.tsx:64:19
     return () => imgInstance.removeEventListener('animationend', firstAnimationEndHandler);
   }, []);
 
-  useEffect(() => {
-    if (onLoadAnimation) return;
-
-    const imgInstance = getRefCurrentPtr(imgRef);
-    if (!imgInstance) return;
-
-    function animationEndHandler() {
-      imgInstance.style.animationName = 'none';
-      imgInstance.style.animationDuration = '0s';
-      imgInstance.style.animationTimingFunction = 'unset';
-    }
-
-    imgInstance.addEventListener('animationend', animationEndHandler);
-    return () => imgInstance.removeEventListener('animationend', animationEndHandler);
-  }, [onLoadAnimation]);
+  useEffect(() => {}, [onLoadAnimation]);
 
   const logo = (

[NoCoverage] ConditionalExpression
components/ui/cta/Logo.tsx:65:9
   }, []);
 
   useEffect(() => {
-    if (onLoadAnimation) return;
+    if (false) return;
 
     const imgInstance = getRefCurrentPtr(imgRef);

[NoCoverage] ConditionalExpression
components/ui/cta/Logo.tsx:65:9
   }, []);
 
   useEffect(() => {
-    if (onLoadAnimation) return;
+    if (true) return;
 
     const imgInstance = getRefCurrentPtr(imgRef);

[NoCoverage] BlockStatement
components/ui/cta/Logo.tsx:70:36
     const imgInstance = getRefCurrentPtr(imgRef);
     if (!imgInstance) return;
 
-    function animationEndHandler() {
-      imgInstance.style.animationName = 'none';
-      imgInstance.style.animationDuration = '0s';
-      imgInstance.style.animationTimingFunction = 'unset';
-    }
+    function animationEndHandler() {}
 
     imgInstance.addEventListener('animationend', animationEndHandler);

[NoCoverage] StringLiteral
components/ui/cta/Logo.tsx:76:34
       imgInstance.style.animationTimingFunction = 'unset';
     }
 
-    imgInstance.addEventListener('animationend', animationEndHandler);
+    imgInstance.addEventListener("", animationEndHandler);
     return () => imgInstance.removeEventListener('animationend', animationEndHandler);
   }, [onLoadAnimation]);

[NoCoverage] ArrowFunction
components/ui/cta/Logo.tsx:77:12
     }
 
     imgInstance.addEventListener('animationend', animationEndHandler);
-    return () => imgInstance.removeEventListener('animationend', animationEndHandler);
+    return () => undefined;
   }, [onLoadAnimation]);
 

[NoCoverage] StringLiteral
components/ui/cta/Logo.tsx:77:50
     }
 
     imgInstance.addEventListener('animationend', animationEndHandler);
-    return () => imgInstance.removeEventListener('animationend', animationEndHandler);
+    return () => imgInstance.removeEventListener("", animationEndHandler);
   }, [onLoadAnimation]);
 

[NoCoverage] BooleanLiteral
components/ui/cta/Logo.tsx:85:18
       className={cn('select-none', onLoadAnimation)}
       alt={globalT(`${i18ns.srOnly}.brand-logo`)}
       onMouseEnter={onMouseEnterCb}
-      draggable={false}
+      draggable={true}
       height={height}
       src={logoPic}

[NoCoverage] BooleanLiteral
components/ui/cta/Logo.tsx:94:7
     />
   );
 
-  if (!clickable) return logo;
+  if (clickable) return logo;
 
   return (

[NoCoverage] ConditionalExpression
components/ui/cta/Logo.tsx:94:7
     />
   );
 
-  if (!clickable) return logo;
+  if (true) return logo;
 
   return (
