[NoCoverage] ArrowFunction
components/ui/cta/LogoHead.tsx:17:52
   alt: string;
 }
 
-const LogoHead: FunctionComponent<LogoHeadProps> = ({ priority, height, width, alt }) => (
-  <Image priority={priority} src={logoHeadPic} height={height} width={width} alt={alt} />
-);
+const LogoHead: FunctionComponent<LogoHeadProps> = () => undefined;
 export default LogoHead;
 
