[Killed] ConditionalExpression
helpers/PaginatedElements/functions/client.tsx:11:5
 export function doGetMaybeFilteredPostsCollection(selectedTagsIds: BlogTagId[], postsCollection: BlogPostPreviewComponentWithMetadatas[]) {
   const maybeFilteredPostsCollection =
     // eslint-disable-next-line no-magic-numbers
-    selectedTagsIds.length === 0
+    false
       ? postsCollection
       : postsCollection.filter((post) => post.tagsIndexes.some((tagId) => selectedTagsIds.includes(tagId)));
killedBy: doGetMaybeFilteredPostsCollection should return the same list as its input, given no selected tags
statusReason: expected [] to strictly equal [ { …(7) }, { …(7) } ]

[Killed] EqualityOperator
helpers/PaginatedElements/functions/client.tsx:11:5
 export function doGetMaybeFilteredPostsCollection(selectedTagsIds: BlogTagId[], postsCollection: BlogPostPreviewComponentWithMetadatas[]) {
   const maybeFilteredPostsCollection =
     // eslint-disable-next-line no-magic-numbers
-    selectedTagsIds.length === 0
+    selectedTagsIds.length !== 0
       ? postsCollection
       : postsCollection.filter((post) => post.tagsIndexes.some((tagId) => selectedTagsIds.includes(tagId)));
killedBy: doGetMaybeFilteredPostsCollection should return the same list as its input, given no selected tags
statusReason: expected [] to strictly equal [ { …(7) }, { …(7) } ]

[Killed] ArrowFunction
helpers/PaginatedElements/functions/client.tsx:13:32
     // eslint-disable-next-line no-magic-numbers
     selectedTagsIds.length === 0
       ? postsCollection
-      : postsCollection.filter((post) => post.tagsIndexes.some((tagId) => selectedTagsIds.includes(tagId)));
+      : postsCollection.filter(() => undefined);
 
   return maybeFilteredPostsCollection;
killedBy: doGetMaybeFilteredPostsCollection should return a filtered list, given selected tags
statusReason: expected [] to strictly equal [ { tagsIndexes: [ +0, 1, 3 ], …(6) } ]

[Killed] MethodExpression
helpers/PaginatedElements/functions/client.tsx:13:42
     // eslint-disable-next-line no-magic-numbers
     selectedTagsIds.length === 0
       ? postsCollection
-      : postsCollection.filter((post) => post.tagsIndexes.some((tagId) => selectedTagsIds.includes(tagId)));
+      : postsCollection.filter((post) => post.tagsIndexes.every(tagId => selectedTagsIds.includes(tagId)));
 
   return maybeFilteredPostsCollection;
killedBy: doGetMaybeFilteredPostsCollection should return a filtered list, given selected tags
statusReason: expected [ { …(7) } ] to strictly equal [ { tagsIndexes: [ +0, 1, 3 ], …(6) } ]

[Killed] ConditionalExpression
helpers/PaginatedElements/functions/client.tsx:43:108
 }
 
 // eslint-disable-next-line no-magic-numbers
-export const shouldShowTopToolbar = (postsCollection: BlogPostPreviewComponentWithMetadatas[]): boolean => postsCollection.length > 1;
+export const shouldShowTopToolbar = (postsCollection: BlogPostPreviewComponentWithMetadatas[]): boolean => false;
 
 // eslint-disable-next-line no-magic-numbers
killedBy: shouldShowTopToolbar should return false or true depending on postsCollection length
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/PaginatedElements/functions/client.tsx:43:108
 }
 
 // eslint-disable-next-line no-magic-numbers
-export const shouldShowTopToolbar = (postsCollection: BlogPostPreviewComponentWithMetadatas[]): boolean => postsCollection.length > 1;
+export const shouldShowTopToolbar = (postsCollection: BlogPostPreviewComponentWithMetadatas[]): boolean => postsCollection.length <= 1;
 
 // eslint-disable-next-line no-magic-numbers
killedBy: shouldShowTopToolbar should return false or true depending on postsCollection length
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/PaginatedElements/functions/client.tsx:46:76
 export const shouldShowTopToolbar = (postsCollection: BlogPostPreviewComponentWithMetadatas[]): boolean => postsCollection.length > 1;
 
 // eslint-disable-next-line no-magic-numbers
-export const shouldShowBottomToolbar = (pagesAmount: Quantity): boolean => pagesAmount > 1;
+export const shouldShowBottomToolbar = (pagesAmount: Quantity): boolean => true;
 
killedBy: shouldShowBottomToolbar should return false or true depending on pagesAmount
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/PaginatedElements/functions/client.tsx:46:76
 export const shouldShowTopToolbar = (postsCollection: BlogPostPreviewComponentWithMetadatas[]): boolean => postsCollection.length > 1;
 
 // eslint-disable-next-line no-magic-numbers
-export const shouldShowBottomToolbar = (pagesAmount: Quantity): boolean => pagesAmount > 1;
+export const shouldShowBottomToolbar = (pagesAmount: Quantity): boolean => pagesAmount >= 1;
 
killedBy: shouldShowBottomToolbar should return false or true depending on pagesAmount
statusReason: expected true to be false // Object.is equality
