[Killed] ArithmeticOperator
helpers/PaginatedElements/functions/paginatedElements.ts:7:34
 
 function getPaginatedElementsCurrentSliceStartAndEndIndexes(page: Count, elementsPerPage: Quantity): Couple<Index> {
   // eslint-disable-next-line no-magic-numbers
-  const startIndex = Math.max(0, page - 1) * elementsPerPage;
+  const startIndex = Math.max(0, page + 1) * elementsPerPage;
   const endIndex = startIndex + elementsPerPage;
 
killedBy: getPaginatedElementsCurrentSlice should return the correct slice for the first page
statusReason: expected [ { …(9) }, { …(9) }, { …(9) }, …(7) ] to strictly equal [ { …(9) }, { …(9) }, { …(9) }, …(7) ]

[Killed] MethodExpression
helpers/PaginatedElements/functions/paginatedElements.ts:7:22
 
 function getPaginatedElementsCurrentSliceStartAndEndIndexes(page: Count, elementsPerPage: Quantity): Couple<Index> {
   // eslint-disable-next-line no-magic-numbers
-  const startIndex = Math.max(0, page - 1) * elementsPerPage;
+  const startIndex = Math.min(0, page - 1) * elementsPerPage;
   const endIndex = startIndex + elementsPerPage;
 
killedBy: getPaginatedElementsCurrentSlice should return the correct slice for the 5th page
statusReason: expected [ { …(9) }, { …(9) }, { …(9) }, …(7) ] to strictly equal [ { …(9) }, { …(9) }, { …(9) }, …(7) ]

[Killed] ArithmeticOperator
helpers/PaginatedElements/functions/paginatedElements.ts:8:20
 function getPaginatedElementsCurrentSliceStartAndEndIndexes(page: Count, elementsPerPage: Quantity): Couple<Index> {
   // eslint-disable-next-line no-magic-numbers
   const startIndex = Math.max(0, page - 1) * elementsPerPage;
-  const endIndex = startIndex + elementsPerPage;
+  const endIndex = startIndex - elementsPerPage;
 
   return [startIndex, endIndex];
killedBy: getPaginatedElementsCurrentSlice should return the correct slice for the first page
statusReason: expected [ { …(9) }, { …(9) }, { …(9) }, …(87) ] to strictly equal [ { …(9) }, { …(9) }, { …(9) }, …(7) ]

[Killed] EqualityOperator
helpers/PaginatedElements/functions/paginatedElements.ts:14:7
 }
 
 export function getPaginatedElementsCurrentSlice(page: Count, elementsPerPage: Quantity, paginatedElements: ReactElement[]): ReactElement[] {
-  if (paginatedElements.length <= elementsPerPage) return paginatedElements;
+  if (paginatedElements.length > elementsPerPage) return paginatedElements;
   const [startIndex, endIndex] = getPaginatedElementsCurrentSliceStartAndEndIndexes(page, elementsPerPage);
   const currentSlice = paginatedElements.slice(startIndex, endIndex);
killedBy: getPaginatedElementsCurrentSlice should return the correct slice for the first page
statusReason: expected [ { …(9) }, { …(9) }, { …(9) }, …(97) ] to strictly equal [ { …(9) }, { …(9) }, { …(9) }, …(7) ]

[Killed] ConditionalExpression
helpers/PaginatedElements/functions/paginatedElements.ts:14:7
 }
 
 export function getPaginatedElementsCurrentSlice(page: Count, elementsPerPage: Quantity, paginatedElements: ReactElement[]): ReactElement[] {
-  if (paginatedElements.length <= elementsPerPage) return paginatedElements;
+  if (true) return paginatedElements;
   const [startIndex, endIndex] = getPaginatedElementsCurrentSliceStartAndEndIndexes(page, elementsPerPage);
   const currentSlice = paginatedElements.slice(startIndex, endIndex);
killedBy: getPaginatedElementsCurrentSlice should return the correct slice for the first page
statusReason: expected [ { …(9) }, { …(9) }, { …(9) }, …(97) ] to strictly equal [ { …(9) }, { …(9) }, { …(9) }, …(7) ]

[Killed] MethodExpression
helpers/PaginatedElements/functions/paginatedElements.ts:16:24
 export function getPaginatedElementsCurrentSlice(page: Count, elementsPerPage: Quantity, paginatedElements: ReactElement[]): ReactElement[] {
   if (paginatedElements.length <= elementsPerPage) return paginatedElements;
   const [startIndex, endIndex] = getPaginatedElementsCurrentSliceStartAndEndIndexes(page, elementsPerPage);
-  const currentSlice = paginatedElements.slice(startIndex, endIndex);
+  const currentSlice = paginatedElements;
 
   return currentSlice;
killedBy: getPaginatedElementsCurrentSlice should return the correct slice for the first page
statusReason: expected [ { …(9) }, { …(9) }, { …(9) }, …(97) ] to strictly equal [ { …(9) }, { …(9) }, { …(9) }, …(7) ]
