[Killed] ConditionalExpression
helpers/PaginatedElements/functions/pagination.ts:10:29
 
 export function getSanitizedCurrentPage(searchParams: URLSearchParams, maxPage: Limit, pageKey: string) {
   const maybeUnsafePageFromUrl: MaybeNull<string> = searchParams.get(pageKey);
-  const unsafePageFromUrl = maybeUnsafePageFromUrl === null ? FIRST_PAGE_PARAM : Number(maybeUnsafePageFromUrl);
+  const unsafePageFromUrl = true ? FIRST_PAGE_PARAM : Number(maybeUnsafePageFromUrl);
 
   if (isNaN(unsafePageFromUrl)) return FIRST_PAGE_PARAM;
killedBy: getSanitizedCurrentPage should return the same page, given a valid page number
statusReason: expected 1 to be 8 // Object.is equality

[Killed] EqualityOperator
helpers/PaginatedElements/functions/pagination.ts:10:29
 
 export function getSanitizedCurrentPage(searchParams: URLSearchParams, maxPage: Limit, pageKey: string) {
   const maybeUnsafePageFromUrl: MaybeNull<string> = searchParams.get(pageKey);
-  const unsafePageFromUrl = maybeUnsafePageFromUrl === null ? FIRST_PAGE_PARAM : Number(maybeUnsafePageFromUrl);
+  const unsafePageFromUrl = maybeUnsafePageFromUrl !== null ? FIRST_PAGE_PARAM : Number(maybeUnsafePageFromUrl);
 
   if (isNaN(unsafePageFromUrl)) return FIRST_PAGE_PARAM;
killedBy: getSanitizedCurrentPage should return the same page, given a valid page number
statusReason: expected 1 to be 8 // Object.is equality

[Killed] ConditionalExpression
helpers/PaginatedElements/functions/pagination.ts:12:7
   const maybeUnsafePageFromUrl: MaybeNull<string> = searchParams.get(pageKey);
   const unsafePageFromUrl = maybeUnsafePageFromUrl === null ? FIRST_PAGE_PARAM : Number(maybeUnsafePageFromUrl);
 
-  if (isNaN(unsafePageFromUrl)) return FIRST_PAGE_PARAM;
+  if (false) return FIRST_PAGE_PARAM;
   if (unsafePageFromUrl < FIRST_PAGE_PARAM) return FIRST_PAGE_PARAM;
   if (unsafePageFromUrl > maxPage) return maxPage;
killedBy: getSanitizedCurrentPage should return FIRST_PAGE_PARAM, given an invalid page number
statusReason: expected NaN to be 1 // Object.is equality

[Killed] ConditionalExpression
helpers/PaginatedElements/functions/pagination.ts:12:7
   const maybeUnsafePageFromUrl: MaybeNull<string> = searchParams.get(pageKey);
   const unsafePageFromUrl = maybeUnsafePageFromUrl === null ? FIRST_PAGE_PARAM : Number(maybeUnsafePageFromUrl);
 
-  if (isNaN(unsafePageFromUrl)) return FIRST_PAGE_PARAM;
+  if (true) return FIRST_PAGE_PARAM;
   if (unsafePageFromUrl < FIRST_PAGE_PARAM) return FIRST_PAGE_PARAM;
   if (unsafePageFromUrl > maxPage) return maxPage;
killedBy: getSanitizedCurrentPage should return the same page, given a valid page number
statusReason: expected 1 to be 8 // Object.is equality

[Killed] ConditionalExpression
helpers/PaginatedElements/functions/pagination.ts:13:7
   const unsafePageFromUrl = maybeUnsafePageFromUrl === null ? FIRST_PAGE_PARAM : Number(maybeUnsafePageFromUrl);
 
   if (isNaN(unsafePageFromUrl)) return FIRST_PAGE_PARAM;
-  if (unsafePageFromUrl < FIRST_PAGE_PARAM) return FIRST_PAGE_PARAM;
+  if (false) return FIRST_PAGE_PARAM;
   if (unsafePageFromUrl > maxPage) return maxPage;
   return unsafePageFromUrl;
killedBy: getSanitizedCurrentPage should return FIRST_PAGE_PARAM, given a negative page number
statusReason: expected -4 to be 1 // Object.is equality

[Killed] ConditionalExpression
helpers/PaginatedElements/functions/pagination.ts:13:7
   const unsafePageFromUrl = maybeUnsafePageFromUrl === null ? FIRST_PAGE_PARAM : Number(maybeUnsafePageFromUrl);
 
   if (isNaN(unsafePageFromUrl)) return FIRST_PAGE_PARAM;
-  if (unsafePageFromUrl < FIRST_PAGE_PARAM) return FIRST_PAGE_PARAM;
+  if (true) return FIRST_PAGE_PARAM;
   if (unsafePageFromUrl > maxPage) return maxPage;
   return unsafePageFromUrl;
killedBy: getSanitizedCurrentPage should return the same page, given a valid page number
statusReason: expected 1 to be 8 // Object.is equality

[Killed] ConditionalExpression
helpers/PaginatedElements/functions/pagination.ts:14:7
 
   if (isNaN(unsafePageFromUrl)) return FIRST_PAGE_PARAM;
   if (unsafePageFromUrl < FIRST_PAGE_PARAM) return FIRST_PAGE_PARAM;
-  if (unsafePageFromUrl > maxPage) return maxPage;
+  if (true) return maxPage;
   return unsafePageFromUrl;
 }
killedBy: getSanitizedCurrentPage should return the same page, given a valid page number
statusReason: expected 10 to be 8 // Object.is equality

[Killed] EqualityOperator
helpers/PaginatedElements/functions/pagination.ts:14:7
 
   if (isNaN(unsafePageFromUrl)) return FIRST_PAGE_PARAM;
   if (unsafePageFromUrl < FIRST_PAGE_PARAM) return FIRST_PAGE_PARAM;
-  if (unsafePageFromUrl > maxPage) return maxPage;
+  if (unsafePageFromUrl <= maxPage) return maxPage;
   return unsafePageFromUrl;
 }
killedBy: getSanitizedCurrentPage should return the same page, given a valid page number
statusReason: expected 10 to be 8 // Object.is equality

[Killed] MethodExpression
helpers/PaginatedElements/functions/pagination.ts:20:33
 
 function findPageNumberByPaginatedElementIndex(paginatedElementIndex: Index, elementsPerPage: Quantity): Count {
   // eslint-disable-next-line no-magic-numbers
-  const sanitizedIndex: Index = Math.max(0, paginatedElementIndex);
+  const sanitizedIndex: Index = Math.min(0, paginatedElementIndex);
 
   // eslint-disable-next-line no-magic-numbers
killedBy: computeReconciliatedPageIndex should return the last page index, given the last page indexes in the old slice ids
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ArithmeticOperator
helpers/PaginatedElements/functions/pagination.ts:23:43
   const sanitizedIndex: Index = Math.max(0, paginatedElementIndex);
 
   // eslint-disable-next-line no-magic-numbers
-  const retrievedPage: Count = Math.trunc(sanitizedIndex / elementsPerPage) + 1;
+  const retrievedPage: Count = Math.trunc(sanitizedIndex * elementsPerPage) + 1;
   return retrievedPage;
 }
killedBy: computeReconciliatedPageIndex should return the last page index, given the last page indexes in the old slice ids
statusReason: expected 9 to be 3 // Object.is equality

[Killed] ArithmeticOperator
helpers/PaginatedElements/functions/pagination.ts:23:32
   const sanitizedIndex: Index = Math.max(0, paginatedElementIndex);
 
   // eslint-disable-next-line no-magic-numbers
-  const retrievedPage: Count = Math.trunc(sanitizedIndex / elementsPerPage) + 1;
+  const retrievedPage: Count = Math.trunc(sanitizedIndex / elementsPerPage) - 1;
   return retrievedPage;
 }
killedBy: computeReconciliatedPageIndex should return the last page index, given the last page indexes in the old slice ids
statusReason: expected 1 to be 3 // Object.is equality

[Killed] BlockStatement
helpers/PaginatedElements/functions/pagination.ts:32:37
   maybeFilteredPostsCollection: BlogPostPreviewComponentWithMetadatas[]
   // eslint-disable-next-line no-magic-numbers
 ): Index | -1 {
-  for (const postId of oldSliceIds) {
-    // eslint-disable-next-line no-magic-numbers
-    const maybeFirstCommonElementIndex: Index | -1 = maybeFilteredPostsCollection.findIndex((post) => post._id === postId);
-    // eslint-disable-next-line no-magic-numbers
-    if (maybeFirstCommonElementIndex !== -1) return maybeFirstCommonElementIndex;
-  }
+  for (const postId of oldSliceIds) {}
   // eslint-disable-next-line no-magic-numbers
   return -1;
killedBy: computeReconciliatedPageIndex should return the last page index, given the last page indexes in the old slice ids
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ConditionalExpression
helpers/PaginatedElements/functions/pagination.ts:34:103
 ): Index | -1 {
   for (const postId of oldSliceIds) {
     // eslint-disable-next-line no-magic-numbers
-    const maybeFirstCommonElementIndex: Index | -1 = maybeFilteredPostsCollection.findIndex((post) => post._id === postId);
+    const maybeFirstCommonElementIndex: Index | -1 = maybeFilteredPostsCollection.findIndex((post) => true);
     // eslint-disable-next-line no-magic-numbers
     if (maybeFirstCommonElementIndex !== -1) return maybeFirstCommonElementIndex;
killedBy: computeReconciliatedPageIndex should return the last page index, given the last page indexes in the old slice ids
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ArrowFunction
helpers/PaginatedElements/functions/pagination.ts:34:93
 ): Index | -1 {
   for (const postId of oldSliceIds) {
     // eslint-disable-next-line no-magic-numbers
-    const maybeFirstCommonElementIndex: Index | -1 = maybeFilteredPostsCollection.findIndex((post) => post._id === postId);
+    const maybeFirstCommonElementIndex: Index | -1 = maybeFilteredPostsCollection.findIndex(() => undefined);
     // eslint-disable-next-line no-magic-numbers
     if (maybeFirstCommonElementIndex !== -1) return maybeFirstCommonElementIndex;
killedBy: computeReconciliatedPageIndex should return the last page index, given the last page indexes in the old slice ids
statusReason: expected 1 to be 3 // Object.is equality

[Killed] EqualityOperator
helpers/PaginatedElements/functions/pagination.ts:36:9
     // eslint-disable-next-line no-magic-numbers
     const maybeFirstCommonElementIndex: Index | -1 = maybeFilteredPostsCollection.findIndex((post) => post._id === postId);
     // eslint-disable-next-line no-magic-numbers
-    if (maybeFirstCommonElementIndex !== -1) return maybeFirstCommonElementIndex;
+    if (maybeFirstCommonElementIndex === -1) return maybeFirstCommonElementIndex;
   }
   // eslint-disable-next-line no-magic-numbers
killedBy: computeReconciliatedPageIndex should return the last page index, given the last page indexes in the old slice ids
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ConditionalExpression
helpers/PaginatedElements/functions/pagination.ts:36:9
     // eslint-disable-next-line no-magic-numbers
     const maybeFirstCommonElementIndex: Index | -1 = maybeFilteredPostsCollection.findIndex((post) => post._id === postId);
     // eslint-disable-next-line no-magic-numbers
-    if (maybeFirstCommonElementIndex !== -1) return maybeFirstCommonElementIndex;
+    if (false) return maybeFirstCommonElementIndex;
   }
   // eslint-disable-next-line no-magic-numbers
killedBy: computeReconciliatedPageIndex should return the last page index, given the last page indexes in the old slice ids
statusReason: expected 1 to be 3 // Object.is equality

[Survived] UnaryOperator
helpers/PaginatedElements/functions/pagination.ts:39:10
     if (maybeFirstCommonElementIndex !== -1) return maybeFirstCommonElementIndex;
   }
   // eslint-disable-next-line no-magic-numbers
-  return -1;
+  return +1;
 }
 

[Killed] ConditionalExpression
helpers/PaginatedElements/functions/pagination.ts:51:7
   const commonElementIndex = findFirstCommonElementIndex(oldSliceIds, maybeFilteredPostsCollection);
 
   // eslint-disable-next-line no-magic-numbers
-  if (commonElementIndex === -1) return FIRST_PAGE_PARAM;
+  if (true) return FIRST_PAGE_PARAM;
 
   const newPage = findPageNumberByPaginatedElementIndex(commonElementIndex, elementsPerPage);
killedBy: computeReconciliatedPageIndex should return the last page index, given the last page indexes in the old slice ids
statusReason: expected 1 to be 3 // Object.is equality

[Killed] EqualityOperator
helpers/PaginatedElements/functions/pagination.ts:51:7
   const commonElementIndex = findFirstCommonElementIndex(oldSliceIds, maybeFilteredPostsCollection);
 
   // eslint-disable-next-line no-magic-numbers
-  if (commonElementIndex === -1) return FIRST_PAGE_PARAM;
+  if (commonElementIndex !== -1) return FIRST_PAGE_PARAM;
 
   const newPage = findPageNumberByPaginatedElementIndex(commonElementIndex, elementsPerPage);
killedBy: computeReconciliatedPageIndex should return the last page index, given the last page indexes in the old slice ids
statusReason: expected 1 to be 3 // Object.is equality
