[NoCoverage] ArrowFunction
components/ui/hoc/NavbarElement.tsx:13:62
  * @hoc
  * @generator NavbarDropdown?, NavbarButton?
  */
-const NavbarElement: FunctionComponent<NavbarElementProps> = ({ embeddedEntities, i18nTitle, path }) =>
-  embeddedEntities ? (
-    <NavbarDropdown embeddedEntities={embeddedEntities} i18nTitle={i18nTitle} path={path} />
-  ) : (
-    <NavbarButton i18nTitle={i18nTitle} path={path} />
-  );
+const NavbarElement: FunctionComponent<NavbarElementProps> = () => undefined;
 
 export default NavbarElement;
