[NoCoverage] BooleanLiteral
components/ui/misc/GoToTopButton.tsx:28:51
 const SCROLL_Y_THRESHOLD_DEFAULT = 400;
 
 const GoToTopButton: FunctionComponent<GoToTopButtonProps> = ({ scrollYthreshold: scrollYthresholdValue }) => {
-  const [isShown, setIsShown] = useState<boolean>(false);
+  const [isShown, setIsShown] = useState<boolean>(true);
   const scopedT = useScopedI18n(i18ns.srOnly);
 

[NoCoverage] BooleanLiteral
components/ui/misc/GoToTopButton.tsx:32:52
   const scopedT = useScopedI18n(i18ns.srOnly);
 
   const btnRef = useRef<HTMLButtonElement>(null);
-  const skipUpdateUntilScrollEnd = useRef<boolean>(false);
+  const skipUpdateUntilScrollEnd = useRef<boolean>(true);
   const scrollYthreshold = useRef<PxValue>(scrollYthresholdValue ?? SCROLL_Y_THRESHOLD_DEFAULT);
 

[NoCoverage] BlockStatement
components/ui/misc/GoToTopButton.tsx:37:39
 
   const ariaLabel = scopedT('goToTop');
 
-  const onClickFn = useCallback(() => {
-    skipUpdateUntilScrollEnd.current = true;
-    window.scrollTo({
-      behavior: 'smooth',
-      top: 0
-    });
-  }, []);
+  const onClickFn = useCallback(() => {}, []);
 
   const footerCollide = useCallback((): boolean => {

[NoCoverage] BooleanLiteral
components/ui/misc/GoToTopButton.tsx:38:40
   const ariaLabel = scopedT('goToTop');
 
   const onClickFn = useCallback(() => {
-    skipUpdateUntilScrollEnd.current = true;
+    skipUpdateUntilScrollEnd.current = false;
     window.scrollTo({
       behavior: 'smooth',

[NoCoverage] ArrayDeclaration
components/ui/misc/GoToTopButton.tsx:43:6
       behavior: 'smooth',
       top: 0
     });
-  }, []);
+  }, ["Stryker was here"]);
 
   const footerCollide = useCallback((): boolean => {

[NoCoverage] ArithmeticOperator
components/ui/misc/GoToTopButton.tsx:47:39
 
   const footerCollide = useCallback((): boolean => {
     const documentHeight = document.body.scrollHeight;
-    const currentBottomPx = Math.ceil(window.scrollY + window.innerHeight);
+    const currentBottomPx = Math.ceil(window.scrollY - window.innerHeight);
 
     if (currentBottomPx >= documentHeight) return true;

[NoCoverage] EqualityOperator
components/ui/misc/GoToTopButton.tsx:49:9
     const documentHeight = document.body.scrollHeight;
     const currentBottomPx = Math.ceil(window.scrollY + window.innerHeight);
 
-    if (currentBottomPx >= documentHeight) return true;
+    if (currentBottomPx < documentHeight) return true;
 
     const maybeFooter = getFooter();

[NoCoverage] ConditionalExpression
components/ui/misc/GoToTopButton.tsx:49:9
     const documentHeight = document.body.scrollHeight;
     const currentBottomPx = Math.ceil(window.scrollY + window.innerHeight);
 
-    if (currentBottomPx >= documentHeight) return true;
+    if (false) return true;
 
     const maybeFooter = getFooter();

[NoCoverage] BooleanLiteral
components/ui/misc/GoToTopButton.tsx:52:30
     if (currentBottomPx >= documentHeight) return true;
 
     const maybeFooter = getFooter();
-    if (!maybeFooter) return false;
+    if (!maybeFooter) return true;
 
     const distanceFromPageBottom = Math.abs(currentBottomPx - documentHeight);

[NoCoverage] ArithmeticOperator
components/ui/misc/GoToTopButton.tsx:54:45
     const maybeFooter = getFooter();
     if (!maybeFooter) return false;
 
-    const distanceFromPageBottom = Math.abs(currentBottomPx - documentHeight);
+    const distanceFromPageBottom = Math.abs(currentBottomPx + documentHeight);
 
     if (distanceFromPageBottom <= maybeFooter.getBoundingClientRect().height) return true;

[NoCoverage] EqualityOperator
components/ui/misc/GoToTopButton.tsx:56:9
 
     const distanceFromPageBottom = Math.abs(currentBottomPx - documentHeight);
 
-    if (distanceFromPageBottom <= maybeFooter.getBoundingClientRect().height) return true;
+    if (distanceFromPageBottom < maybeFooter.getBoundingClientRect().height) return true;
 
     return false;

[NoCoverage] BooleanLiteral
components/ui/misc/GoToTopButton.tsx:56:86
 
     const distanceFromPageBottom = Math.abs(currentBottomPx - documentHeight);
 
-    if (distanceFromPageBottom <= maybeFooter.getBoundingClientRect().height) return true;
+    if (distanceFromPageBottom <= maybeFooter.getBoundingClientRect().height) return false;
 
     return false;

[NoCoverage] BooleanLiteral
components/ui/misc/GoToTopButton.tsx:58:12
 
     if (distanceFromPageBottom <= maybeFooter.getBoundingClientRect().height) return true;
 
-    return false;
+    return true;
   }, []);
 

[NoCoverage] ArrayDeclaration
components/ui/misc/GoToTopButton.tsx:59:6
     if (distanceFromPageBottom <= maybeFooter.getBoundingClientRect().height) return true;
 
     return false;
-  }, []);
+  }, ["Stryker was here"]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
components/ui/misc/GoToTopButton.tsx:61:19
     return false;
   }, []);
 
-  useEffect(() => {
-    const handleScroll = () => {
-      if (skipUpdateUntilScrollEnd.current) return;
-
-      if (footerCollide()) {
-        setIsShown(false);
-        return;
-      }
-
-      if (window.scrollY > scrollYthreshold.current) setIsShown(true);
-      else setIsShown(false);
-    };
-
-    const throttledScrollHandler = throttle(handleScroll, APPROX_120_FPS_THROTTLE_TIMING_IN_MS);
-
-    window.addEventListener('scroll', throttledScrollHandler);
-
-    return () => window.removeEventListener('scroll', throttledScrollHandler);
-  }, [footerCollide]);
+  useEffect(() => {}, [footerCollide]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
components/ui/misc/GoToTopButton.tsx:62:32
   }, []);
 
   useEffect(() => {
-    const handleScroll = () => {
-      if (skipUpdateUntilScrollEnd.current) return;
-
-      if (footerCollide()) {
-        setIsShown(false);
-        return;
-      }
-
-      if (window.scrollY > scrollYthreshold.current) setIsShown(true);
-      else setIsShown(false);
-    };
+    const handleScroll = () => {};
 
     const throttledScrollHandler = throttle(handleScroll, APPROX_120_FPS_THROTTLE_TIMING_IN_MS);

[NoCoverage] ConditionalExpression
components/ui/misc/GoToTopButton.tsx:63:11
 
   useEffect(() => {
     const handleScroll = () => {
-      if (skipUpdateUntilScrollEnd.current) return;
+      if (true) return;
 
       if (footerCollide()) {

[NoCoverage] ConditionalExpression
components/ui/misc/GoToTopButton.tsx:63:11
 
   useEffect(() => {
     const handleScroll = () => {
-      if (skipUpdateUntilScrollEnd.current) return;
+      if (false) return;
 
       if (footerCollide()) {

[NoCoverage] ConditionalExpression
components/ui/misc/GoToTopButton.tsx:65:11
     const handleScroll = () => {
       if (skipUpdateUntilScrollEnd.current) return;
 
-      if (footerCollide()) {
+      if (true) {
         setIsShown(false);
         return;

[NoCoverage] ConditionalExpression
components/ui/misc/GoToTopButton.tsx:65:11
     const handleScroll = () => {
       if (skipUpdateUntilScrollEnd.current) return;
 
-      if (footerCollide()) {
+      if (false) {
         setIsShown(false);
         return;

[NoCoverage] BooleanLiteral
components/ui/misc/GoToTopButton.tsx:66:20
       if (skipUpdateUntilScrollEnd.current) return;
 
       if (footerCollide()) {
-        setIsShown(false);
+        setIsShown(true);
         return;
       }

[NoCoverage] EqualityOperator
components/ui/misc/GoToTopButton.tsx:70:11
         return;
       }
 
-      if (window.scrollY > scrollYthreshold.current) setIsShown(true);
+      if (window.scrollY >= scrollYthreshold.current) setIsShown(true);
       else setIsShown(false);
     };

[NoCoverage] BooleanLiteral
components/ui/misc/GoToTopButton.tsx:70:65
         return;
       }
 
-      if (window.scrollY > scrollYthreshold.current) setIsShown(true);
+      if (window.scrollY > scrollYthreshold.current) setIsShown(false);
       else setIsShown(false);
     };

[NoCoverage] BooleanLiteral
components/ui/misc/GoToTopButton.tsx:71:23
       }
 
       if (window.scrollY > scrollYthreshold.current) setIsShown(true);
-      else setIsShown(false);
+      else setIsShown(true);
     };
 

[NoCoverage] StringLiteral
components/ui/misc/GoToTopButton.tsx:76:29
 
     const throttledScrollHandler = throttle(handleScroll, APPROX_120_FPS_THROTTLE_TIMING_IN_MS);
 
-    window.addEventListener('scroll', throttledScrollHandler);
+    window.addEventListener("", throttledScrollHandler);
 
     return () => window.removeEventListener('scroll', throttledScrollHandler);

[NoCoverage] ArrowFunction
components/ui/misc/GoToTopButton.tsx:78:12
 
     window.addEventListener('scroll', throttledScrollHandler);
 
-    return () => window.removeEventListener('scroll', throttledScrollHandler);
+    return () => undefined;
   }, [footerCollide]);
 

[NoCoverage] BlockStatement
components/ui/misc/GoToTopButton.tsx:81:19
     return () => window.removeEventListener('scroll', throttledScrollHandler);
   }, [footerCollide]);
 
-  useEffect(() => {
-    const handleScrollEnd = () => {
-      if (!skipUpdateUntilScrollEnd.current) return;
-      skipUpdateUntilScrollEnd.current = false;
-
-      if (footerCollide()) {
-        setIsShown(false);
-        return;
-      }
-
-      if (window.scrollY > scrollYthreshold.current) setIsShown(true);
-      else setIsShown(false);
-    };
-
-    window.addEventListener('scrollend', handleScrollEnd);
-
-    return () => {
-      window.removeEventListener('scrollend', handleScrollEnd);
-    };
-  }, [footerCollide]);
+  useEffect(() => {}, [footerCollide]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
components/ui/misc/GoToTopButton.tsx:82:35
   }, [footerCollide]);
 
   useEffect(() => {
-    const handleScrollEnd = () => {
-      if (!skipUpdateUntilScrollEnd.current) return;
-      skipUpdateUntilScrollEnd.current = false;
-
-      if (footerCollide()) {
-        setIsShown(false);
-        return;
-      }
-
-      if (window.scrollY > scrollYthreshold.current) setIsShown(true);
-      else setIsShown(false);
-    };
+    const handleScrollEnd = () => {};
 
     window.addEventListener('scrollend', handleScrollEnd);

[NoCoverage] ConditionalExpression
components/ui/misc/GoToTopButton.tsx:83:11
 
   useEffect(() => {
     const handleScrollEnd = () => {
-      if (!skipUpdateUntilScrollEnd.current) return;
+      if (false) return;
       skipUpdateUntilScrollEnd.current = false;
 

[NoCoverage] ConditionalExpression
components/ui/misc/GoToTopButton.tsx:83:11
 
   useEffect(() => {
     const handleScrollEnd = () => {
-      if (!skipUpdateUntilScrollEnd.current) return;
+      if (true) return;
       skipUpdateUntilScrollEnd.current = false;
 

[NoCoverage] BooleanLiteral
components/ui/misc/GoToTopButton.tsx:84:42
   useEffect(() => {
     const handleScrollEnd = () => {
       if (!skipUpdateUntilScrollEnd.current) return;
-      skipUpdateUntilScrollEnd.current = false;
+      skipUpdateUntilScrollEnd.current = true;
 
       if (footerCollide()) {

[NoCoverage] BlockStatement
components/ui/misc/GoToTopButton.tsx:86:28
       if (!skipUpdateUntilScrollEnd.current) return;
       skipUpdateUntilScrollEnd.current = false;
 
-      if (footerCollide()) {
-        setIsShown(false);
-        return;
-      }
+      if (footerCollide()) {}
 
       if (window.scrollY > scrollYthreshold.current) setIsShown(true);

[NoCoverage] ConditionalExpression
components/ui/misc/GoToTopButton.tsx:91:11
         return;
       }
 
-      if (window.scrollY > scrollYthreshold.current) setIsShown(true);
+      if (true) setIsShown(true);
       else setIsShown(false);
     };

[NoCoverage] BlockStatement
components/ui/misc/GoToTopButton.tsx:97:18
 
     window.addEventListener('scrollend', handleScrollEnd);
 
-    return () => {
-      window.removeEventListener('scrollend', handleScrollEnd);
-    };
+    return () => {};
   }, [footerCollide]);
 

[NoCoverage] ArrayDeclaration
components/ui/misc/GoToTopButton.tsx:100:6
     return () => {
       window.removeEventListener('scrollend', handleScrollEnd);
     };
-  }, [footerCollide]);
+  }, []);
 
   useEffect(() => {

[NoCoverage] BlockStatement
components/ui/misc/GoToTopButton.tsx:102:19
     };
   }, [footerCollide]);
 
-  useEffect(() => {
-    setIsShown(window.scrollY > scrollYthreshold.current);
-  }, []);
+  useEffect(() => {}, []);
 
   useEffect(() => {

[NoCoverage] EqualityOperator
components/ui/misc/GoToTopButton.tsx:103:16
   }, [footerCollide]);
 
   useEffect(() => {
-    setIsShown(window.scrollY > scrollYthreshold.current);
+    setIsShown(window.scrollY >= scrollYthreshold.current);
   }, []);
 

[NoCoverage] ConditionalExpression
components/ui/misc/GoToTopButton.tsx:103:16
   }, [footerCollide]);
 
   useEffect(() => {
-    setIsShown(window.scrollY > scrollYthreshold.current);
+    setIsShown(false);
   }, []);
 

[NoCoverage] BlockStatement
components/ui/misc/GoToTopButton.tsx:106:19
     setIsShown(window.scrollY > scrollYthreshold.current);
   }, []);
 
-  useEffect(() => {
-    const btnInstance = getRefCurrentPtr(btnRef);
-    if (!btnInstance) return;
-
-    if (isShown) {
-      btnInstance.style.transform = '';
-      return;
-    }
-
-    const btnHeight = btnInstance.getBoundingClientRect().height;
-    btnInstance.style.transform = `translateY(${btnHeight}px)`;
-  }, [isShown]);
+  useEffect(() => {}, [isShown]);
 
   return (

[NoCoverage] ConditionalExpression
components/ui/misc/GoToTopButton.tsx:108:9
 
   useEffect(() => {
     const btnInstance = getRefCurrentPtr(btnRef);
-    if (!btnInstance) return;
+    if (false) return;
 
     if (isShown) {

[NoCoverage] ConditionalExpression
components/ui/misc/GoToTopButton.tsx:108:9
 
   useEffect(() => {
     const btnInstance = getRefCurrentPtr(btnRef);
-    if (!btnInstance) return;
+    if (true) return;
 
     if (isShown) {

[NoCoverage] ConditionalExpression
components/ui/misc/GoToTopButton.tsx:110:9
     const btnInstance = getRefCurrentPtr(btnRef);
     if (!btnInstance) return;
 
-    if (isShown) {
+    if (false) {
       btnInstance.style.transform = '';
       return;

[NoCoverage] BlockStatement
components/ui/misc/GoToTopButton.tsx:110:18
     const btnInstance = getRefCurrentPtr(btnRef);
     if (!btnInstance) return;
 
-    if (isShown) {
-      btnInstance.style.transform = '';
-      return;
-    }
+    if (isShown) {}
 
     const btnHeight = btnInstance.getBoundingClientRect().height;

[NoCoverage] StringLiteral
components/ui/misc/GoToTopButton.tsx:116:35
     }
 
     const btnHeight = btnInstance.getBoundingClientRect().height;
-    btnInstance.style.transform = `translateY(${btnHeight}px)`;
+    btnInstance.style.transform = ``;
   }, [isShown]);
 

[NoCoverage] BooleanLiteral
components/ui/misc/GoToTopButton.tsx:126:20
         { 'opacity-65 hover:opacity-100 focus:opacity-100': isShown }
       )}
       onClick={isShown ? onClickFn : undefined}
-      aria-hidden={!isShown}
+      aria-hidden={isShown}
       aria-label={ariaLabel}
       disabled={!isShown}

[NoCoverage] BooleanLiteral
components/ui/misc/GoToTopButton.tsx:128:17
       onClick={isShown ? onClickFn : undefined}
       aria-hidden={!isShown}
       aria-label={ariaLabel}
-      disabled={!isShown}
+      disabled={isShown}
       ref={btnRef}
     >
