[NoCoverage] ArrowFunction
components/ui/misc/HomepageVideo.tsx:7:62
 
 interface HomepageVideoProps {}
 
-const HomepageVideo: FunctionComponent<HomepageVideoProps> = () => (
-  <video
-    className="absolute bottom-0 left-0 h-full w-full object-cover"
-    style={{ zIndex: -1 }}
-    playsInline={true}
-    autoPlay={true}
-    preload="none"
-    muted={true}
-    loop={true}
-  >
-    <source src="/assets/medias/videos/rtm-demo.webm" type="video/webm; codecs=av01.0.05M.08" media="(min-width: 415px)" />
-  </video>
-);
+const HomepageVideo: FunctionComponent<HomepageVideoProps> = () => undefined;
 
 export default HomepageVideo;

[NoCoverage] UnaryOperator
components/ui/misc/HomepageVideo.tsx:10:22
 const HomepageVideo: FunctionComponent<HomepageVideoProps> = () => (
   <video
     className="absolute bottom-0 left-0 h-full w-full object-cover"
-    style={{ zIndex: -1 }}
+    style={{ zIndex: +1 }}
     playsInline={true}
     autoPlay={true}

[NoCoverage] ObjectLiteral
components/ui/misc/HomepageVideo.tsx:10:12
 const HomepageVideo: FunctionComponent<HomepageVideoProps> = () => (
   <video
     className="absolute bottom-0 left-0 h-full w-full object-cover"
-    style={{ zIndex: -1 }}
+    style={{}}
     playsInline={true}
     autoPlay={true}

[NoCoverage] BooleanLiteral
components/ui/misc/HomepageVideo.tsx:11:18
   <video
     className="absolute bottom-0 left-0 h-full w-full object-cover"
     style={{ zIndex: -1 }}
-    playsInline={true}
+    playsInline={false}
     autoPlay={true}
     preload="none"

[NoCoverage] BooleanLiteral
components/ui/misc/HomepageVideo.tsx:12:15
     className="absolute bottom-0 left-0 h-full w-full object-cover"
     style={{ zIndex: -1 }}
     playsInline={true}
-    autoPlay={true}
+    autoPlay={false}
     preload="none"
     muted={true}

[NoCoverage] BooleanLiteral
components/ui/misc/HomepageVideo.tsx:14:12
     playsInline={true}
     autoPlay={true}
     preload="none"
-    muted={true}
+    muted={false}
     loop={true}
   >

[NoCoverage] BooleanLiteral
components/ui/misc/HomepageVideo.tsx:15:11
     autoPlay={true}
     preload="none"
     muted={true}
-    loop={true}
+    loop={false}
   >
     <source src="/assets/medias/videos/rtm-demo.webm" type="video/webm; codecs=av01.0.05M.08" media="(min-width: 415px)" />
