[NoCoverage] StringLiteral
components/ui/navbar/SitewideNavbar.tsx:24:44
 interface SitewideNavbarProps {}
 
 const { LOGO_HEIGHT, LOGO_WIDTH } = NAVBAR_STYLE;
-const navbarExtrasForMobileClassNameBase = 'h-[40px]';
+const navbarExtrasForMobileClassNameBase = "";
 
 const buildNavbarExtrasForDesktop: () => ReactElement[] = () =>

[NoCoverage] ArrowFunction
components/ui/navbar/SitewideNavbar.tsx:27:55
 const navbarExtrasForMobileClassNameBase = 'h-[40px]';
 
 const buildNavbarExtrasForDesktop: () => ReactElement[] = () =>
-  Object.values(NAVBAR_EXTRAS_COMPONENTS_DESKTOP).map((jsx, index) => (
-    <li key={`${index}-navbar-extra-desktop`} className="flex h-fit w-fit p-[2px]">
-      {jsx}
-    </li>
-  ));
+  Object.values(NAVBAR_EXTRAS_COMPONENTS_DESKTOP).map(() => undefined);
 
 const buildNavbarExtrasForMobile: () => ReactElement[] = () =>

[NoCoverage] StringLiteral
components/ui/navbar/SitewideNavbar.tsx:28:14
 
 const buildNavbarExtrasForDesktop: () => ReactElement[] = () =>
   Object.values(NAVBAR_EXTRAS_COMPONENTS_DESKTOP).map((jsx, index) => (
-    <li key={`${index}-navbar-extra-desktop`} className="flex h-fit w-fit p-[2px]">
+    <li key={``} className="flex h-fit w-fit p-[2px]">
       {jsx}
     </li>

[NoCoverage] ArrowFunction
components/ui/navbar/SitewideNavbar.tsx:34:54
   ));
 
 const buildNavbarExtrasForMobile: () => ReactElement[] = () =>
-  Object.values(NAVBAR_EXTRAS_COMPONENTS_MOBILE).map((jsx, index) => (
-    <li className={navbarExtrasForMobileClassNameBase} key={`${index}-navbar-extra-mobile`}>
-      {jsx}
-    </li>
-  ));
+  Object.values(NAVBAR_EXTRAS_COMPONENTS_MOBILE).map(() => undefined);
 
 function buildNavbarItems(): NavbarItems {

[NoCoverage] ArrowFunction
components/ui/navbar/SitewideNavbar.tsx:56:46
 
   const navbarItemClassName = 'p-[5px]';
   const navbarItems = buildNavbarItems();
-  const desktopNavbarItems = navbarItems.map((item, index) => (
-    <li key={`${index}-navbar-btn-desktop`} className={navbarItemClassName}>
-      {item.jsx}
-    </li>
-  ));
+  const desktopNavbarItems = navbarItems.map(() => undefined);
 
   const mobileNavbarItems: NavbarItems = navbarItems.map((item) => ({
