[NoCoverage] ObjectLiteral
components/ui/search/Result.tsx:35:11
         className={cn(
           'search-menu-result-link',
           'flex h-fit w-full flex-col transition-transform duration-300 hover:delay-0 hover:duration-100 focus:delay-0 focus:duration-100 dark:hover:brightness-125 dark:focus:brightness-125',
-          {
-            'pointer-events-none opacity-50': exactMatch
-          },
+          {},
           className
         )}
