[NoCoverage] BlockStatement
search/helpers/functions/navbarSearchButton.tsx:16:3
   v: TabValue,
   memorizedTabValue: MutableRefObject<string>,
   setTabValue: (v: TabValue) => unknown
-) {
-  memorizedTabValue.current = v;
-  setTabValue(v);
-}
+) {}
 
 export const doBuildTabTrigger = <TabValue extends string>(

[NoCoverage] BlockStatement
search/helpers/functions/navbarSearchButton.tsx:28:28
   setTabValue: (v: TabValue) => unknown
 ) => (
   <TabsTrigger
-    onFocusCapture={(e) => {
-      if (memorizedTabValue.current) {
-        e.preventDefault();
-        setTabValue(memorizedTabValue.current);
-      }
-    }}
+    onFocusCapture={(e) => {}}
     onFocus={(e) => {
       e.preventDefault();

[NoCoverage] ConditionalExpression
search/helpers/functions/navbarSearchButton.tsx:29:11
 ) => (
   <TabsTrigger
     onFocusCapture={(e) => {
-      if (memorizedTabValue.current) {
+      if (true) {
         e.preventDefault();
         setTabValue(memorizedTabValue.current);

[NoCoverage] ConditionalExpression
search/helpers/functions/navbarSearchButton.tsx:29:11
 ) => (
   <TabsTrigger
     onFocusCapture={(e) => {
-      if (memorizedTabValue.current) {
+      if (false) {
         e.preventDefault();
         setTabValue(memorizedTabValue.current);

[NoCoverage] BlockStatement
search/helpers/functions/navbarSearchButton.tsx:34:21
         setTabValue(memorizedTabValue.current);
       }
     }}
-    onFocus={(e) => {
-      e.preventDefault();
-      doUpdateMemorizedTabValueAndSetTabValue(tabValue, memorizedTabValue, setTabValue);
-    }}
+    onFocus={(e) => {}}
     className="search-menu-tabslist-item w-full flex-1 font-semibold hover:bg-primary hover:text-white max-lg:h-10 lg:w-fit"
     value={tabValue}

[NoCoverage] ConditionalExpression
search/helpers/functions/navbarSearchButton.tsx:74:7
   resultsContainerRef: RefObject<MaybeNull<HTMLDivElement>>
 ): FocusEventHandler<HTMLAnchorElement> {
   // eslint-disable-next-line no-magic-numbers
-  if (currentElementIndex === 0) {
+  if (true) {
     return () => {
       const maybeContainer = getRefCurrentPtr(resultsContainerRef);

[NoCoverage] BlockStatement
search/helpers/functions/navbarSearchButton.tsx:74:34
   resultsContainerRef: RefObject<MaybeNull<HTMLDivElement>>
 ): FocusEventHandler<HTMLAnchorElement> {
   // eslint-disable-next-line no-magic-numbers
-  if (currentElementIndex === 0) {
-    return () => {
-      const maybeContainer = getRefCurrentPtr(resultsContainerRef);
-      if (maybeContainer === null) return;
-      // eslint-disable-next-line no-magic-numbers
-      maybeContainer.scrollTo(0, 0);
-    };
-  }
+  if (currentElementIndex === 0) {}
 
   if (currentElementIndex === maxIndex) {

[NoCoverage] BlockStatement
search/helpers/functions/navbarSearchButton.tsx:75:18
 ): FocusEventHandler<HTMLAnchorElement> {
   // eslint-disable-next-line no-magic-numbers
   if (currentElementIndex === 0) {
-    return () => {
-      const maybeContainer = getRefCurrentPtr(resultsContainerRef);
-      if (maybeContainer === null) return;
-      // eslint-disable-next-line no-magic-numbers
-      maybeContainer.scrollTo(0, 0);
-    };
+    return () => {};
   }
 

[NoCoverage] ConditionalExpression
search/helpers/functions/navbarSearchButton.tsx:83:7
     };
   }
 
-  if (currentElementIndex === maxIndex) {
+  if (false) {
     return () => {
       const maybeContainer = getRefCurrentPtr(resultsContainerRef);

[NoCoverage] EqualityOperator
search/helpers/functions/navbarSearchButton.tsx:83:7
     };
   }
 
-  if (currentElementIndex === maxIndex) {
+  if (currentElementIndex !== maxIndex) {
     return () => {
       const maybeContainer = getRefCurrentPtr(resultsContainerRef);

[NoCoverage] BlockStatement
search/helpers/functions/navbarSearchButton.tsx:84:18
   }
 
   if (currentElementIndex === maxIndex) {
-    return () => {
-      const maybeContainer = getRefCurrentPtr(resultsContainerRef);
-      if (maybeContainer === null) return;
-      // eslint-disable-next-line no-magic-numbers
-      maybeContainer.scrollTo(0, maybeContainer.scrollHeight);
-    };
+    return () => {};
   }
 

[NoCoverage] BlockStatement
search/helpers/functions/navbarSearchButton.tsx:92:17
     };
   }
 
-  return (e) => {
-    const maybeContainer = getRefCurrentPtr(resultsContainerRef);
-    const { target } = e;
-    if (maybeContainer === null) return;
-    target.scrollIntoView({ block: 'end' });
-    // eslint-disable-next-line no-magic-numbers
-    maybeContainer.scrollTo(0, maybeContainer.scrollTop + 15);
-  };
+  return (e) => {};
 }
 

[NoCoverage] ObjectLiteral
search/helpers/functions/navbarSearchButton.tsx:96:27
     const maybeContainer = getRefCurrentPtr(resultsContainerRef);
     const { target } = e;
     if (maybeContainer === null) return;
-    target.scrollIntoView({ block: 'end' });
+    target.scrollIntoView({});
     // eslint-disable-next-line no-magic-numbers
     maybeContainer.scrollTo(0, maybeContainer.scrollTop + 15);

[NoCoverage] ArithmeticOperator
search/helpers/functions/navbarSearchButton.tsx:98:32
     if (maybeContainer === null) return;
     target.scrollIntoView({ block: 'end' });
     // eslint-disable-next-line no-magic-numbers
-    maybeContainer.scrollTo(0, maybeContainer.scrollTop + 15);
+    maybeContainer.scrollTo(0, maybeContainer.scrollTop - 15);
   };
 }
