[Killed] ConditionalExpression
src/lib/blog/api.ts:30:72
   const allPosts = await getAllBlogPostsByCategory(categ);
   if (allPosts === null) return null;
 
-  const posts = allPosts.filter(({ language: currentPostLanguage }) => currentPostLanguage === language);
+  const posts = allPosts.filter(({ language: currentPostLanguage }) => true);
   return posts;
 }
killedBy: getAllBlogPostsByCategoryAndLanguage (happy paths) should pass
statusReason: expected 12 to be 3 // Object.is equality

[Killed] ArrowFunction
src/lib/blog/api.ts:30:33
   const allPosts = await getAllBlogPostsByCategory(categ);
   if (allPosts === null) return null;
 
-  const posts = allPosts.filter(({ language: currentPostLanguage }) => currentPostLanguage === language);
+  const posts = allPosts.filter(() => undefined);
   return posts;
 }
killedBy: getPostStrict (happy paths) should return a valid post
statusReason: Cannot read properties of null (reading 'category')

[Killed] LogicalOperator
src/lib/blog/api.ts:41:7
 ): Promise<BlogPostType[]> {
   // Stryker Workaround 1. Pointless mutants: there's no ambiguity here.
   // Stryker disable next-line ConditionalExpression,EqualityOperator
-  if (!ComputedBlogCtx.TESTING && category === BlogConfig.TESTING_CATEGORY) return [];
+  if (!ComputedBlogCtx.TESTING || category === BlogConfig.TESTING_CATEGORY) return [];
 
   const isValidPair: boolean = await isValidBlogCategoryAndSubcategoryPair(category, subcategory, language);
killedBy: getPostStrict (happy paths) should return a valid post
statusReason: Cannot read properties of null (reading 'category')

[Killed] BooleanLiteral
src/lib/blog/api.ts:41:7
 ): Promise<BlogPostType[]> {
   // Stryker Workaround 1. Pointless mutants: there's no ambiguity here.
   // Stryker disable next-line ConditionalExpression,EqualityOperator
-  if (!ComputedBlogCtx.TESTING && category === BlogConfig.TESTING_CATEGORY) return [];
+  if (ComputedBlogCtx.TESTING && category === BlogConfig.TESTING_CATEGORY) return [];
 
   const isValidPair: boolean = await isValidBlogCategoryAndSubcategoryPair(category, subcategory, language);
killedBy: getPostStrict (happy paths) should return a valid post
statusReason: Cannot read properties of null (reading 'category')

[Killed] BooleanLiteral
src/lib/blog/api.ts:46:7
   const isValidPair: boolean = await isValidBlogCategoryAndSubcategoryPair(category, subcategory, language);
   // Stryker Workaround 2. Mutant will be killed with `if (true)` as expected, but `if (false)` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
-  if (!isValidPair) return [];
+  if (isValidPair) return [];
 
   const getBlogPostsWithAllowedDraftsCtx = (postsCollection: BlogPostType[]): BlogPostType[] =>
killedBy: getPostStrict (happy paths) should return a valid post
statusReason: Cannot read properties of null (reading 'category')

[Killed] MethodExpression
src/lib/blog/api.ts:49:5
   if (!isValidPair) return [];
 
   const getBlogPostsWithAllowedDraftsCtx = (postsCollection: BlogPostType[]): BlogPostType[] =>
-    postsCollection.filter(
-      ({ subcategory: currentPostSubcategory, language: currentPostLanguage }) =>
-        // Stryker Workaround 3. Pointless mutants: there's no ambiguity here.
-        // Stryker disable next-line ConditionalExpression
-        currentPostSubcategory === subcategory && currentPostLanguage === language
-    );
+    postsCollection;
 
   const getBlogPostsWithDisallowedDraftsCtx = (postsCollection: BlogPostType[]): BlogPostType[] =>
killedBy: getBlogStaticParams should return static params, including the 'drafts' fake language
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(33) ] to strictly equal [ { …(4) }, { …(4) }, { …(4) }, …(9) ]

[Killed] ArrowFunction
src/lib/blog/api.ts:50:7
 
   const getBlogPostsWithAllowedDraftsCtx = (postsCollection: BlogPostType[]): BlogPostType[] =>
     postsCollection.filter(
-      ({ subcategory: currentPostSubcategory, language: currentPostLanguage }) =>
-        // Stryker Workaround 3. Pointless mutants: there's no ambiguity here.
-        // Stryker disable next-line ConditionalExpression
-        currentPostSubcategory === subcategory && currentPostLanguage === language
+      () => undefined
     );
 
killedBy: getPostStrict (happy paths) should return a valid post when picking a non-draft post in an authorized drafts CTX
statusReason: Cannot read properties of null (reading 'category')

[Killed] EqualityOperator
src/lib/blog/api.ts:53:51
       ({ subcategory: currentPostSubcategory, language: currentPostLanguage }) =>
         // Stryker Workaround 3. Pointless mutants: there's no ambiguity here.
         // Stryker disable next-line ConditionalExpression
-        currentPostSubcategory === subcategory && currentPostLanguage === language
+        currentPostSubcategory === subcategory && currentPostLanguage !== language
     );
 
killedBy: getBlogStaticParams should return static params, including the 'drafts' fake language
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(21) ] to strictly equal [ { …(4) }, { …(4) }, { …(4) }, …(9) ]

[Killed] LogicalOperator
src/lib/blog/api.ts:53:9
       ({ subcategory: currentPostSubcategory, language: currentPostLanguage }) =>
         // Stryker Workaround 3. Pointless mutants: there's no ambiguity here.
         // Stryker disable next-line ConditionalExpression
-        currentPostSubcategory === subcategory && currentPostLanguage === language
+        // Stryker Workaround 3. Pointless mutants: there's no ambiguity here.
+// Stryker disable next-line ConditionalExpression
+currentPostSubcategory === subcategory || currentPostLanguage === language
     );
 
killedBy: getBlogStaticParams should return static params, including the 'drafts' fake language
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(33) ] to strictly equal [ { …(4) }, { …(4) }, { …(4) }, …(9) ]

[Killed] MethodExpression
src/lib/blog/api.ts:57:5
     );
 
   const getBlogPostsWithDisallowedDraftsCtx = (postsCollection: BlogPostType[]): BlogPostType[] =>
-    postsCollection.filter(
-      ({ subcategory: currentPostSubcategory, language: currentPostLanguage, draft: currentPostDraft }) =>
-        // Stryker Workaround 4. Pointless mutants: there's no ambiguity here.
-        // Stryker disable next-line ConditionalExpression
-        !currentPostDraft && currentPostSubcategory === subcategory && currentPostLanguage === language
-    );
+    postsCollection;
 
   const postsCollection = (await getAllBlogPostsByCategory(category)) as BlogPostType[];
killedBy: getAllBlogPostsByCategoryAndSubcategoryAndLanguageStrict (happy paths) should return 5 posts, given the fake language 'posts'
statusReason: expected 12 to be 5 // Object.is equality

[Killed] ArrowFunction
src/lib/blog/api.ts:58:7
 
   const getBlogPostsWithDisallowedDraftsCtx = (postsCollection: BlogPostType[]): BlogPostType[] =>
     postsCollection.filter(
-      ({ subcategory: currentPostSubcategory, language: currentPostLanguage, draft: currentPostDraft }) =>
-        // Stryker Workaround 4. Pointless mutants: there's no ambiguity here.
-        // Stryker disable next-line ConditionalExpression
-        !currentPostDraft && currentPostSubcategory === subcategory && currentPostLanguage === language
+      () => undefined
     );
 
killedBy: getPostStrict (happy paths) should return a valid post
statusReason: Cannot read properties of null (reading 'category')

[Killed] LogicalOperator
src/lib/blog/api.ts:61:9
       ({ subcategory: currentPostSubcategory, language: currentPostLanguage, draft: currentPostDraft }) =>
         // Stryker Workaround 4. Pointless mutants: there's no ambiguity here.
         // Stryker disable next-line ConditionalExpression
-        !currentPostDraft && currentPostSubcategory === subcategory && currentPostLanguage === language
+        !currentPostDraft || currentPostSubcategory === subcategory && currentPostLanguage === language
     );
 
killedBy: getBlogStaticParams should return static params, excluding the 'drafts' fake language
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(9) ] to strictly equal [ { …(4) }, { …(4) }, { …(4) }, …(6) ]

[Killed] LogicalOperator
src/lib/blog/api.ts:61:9
       ({ subcategory: currentPostSubcategory, language: currentPostLanguage, draft: currentPostDraft }) =>
         // Stryker Workaround 4. Pointless mutants: there's no ambiguity here.
         // Stryker disable next-line ConditionalExpression
-        !currentPostDraft && currentPostSubcategory === subcategory && currentPostLanguage === language
+        // Stryker Workaround 4. Pointless mutants: there's no ambiguity here.
+// Stryker disable next-line ConditionalExpression
+!currentPostDraft && currentPostSubcategory === subcategory || currentPostLanguage === language
     );
 
killedBy: getAllBlogPostsByCategoryAndSubcategoryAndLanguageStrict (happy paths) should return 5 posts, given the fake language 'posts'
statusReason: expected 9 to be 5 // Object.is equality

[Killed] LogicalOperator
src/lib/blog/api.ts:77:7
 ): Promise<MaybeNull<BlogPostType>> {
   // Stryker Workaround 5. Pointless mutants: there's no ambiguity here.
   // Stryker disable next-line ConditionalExpression,EqualityOperator
-  if (!ComputedBlogCtx.TESTING && category === BlogConfig.TESTING_CATEGORY) return null;
+  if (!ComputedBlogCtx.TESTING || category === BlogConfig.TESTING_CATEGORY) return null;
 
   const getBlogPostWithAllowedDraftsCtx: () => MaybeNull<BlogPostType> = () =>
killedBy: getPostStrict (happy paths) should return a valid post when picking a non-draft post in an unauthorized drafts CTX
statusReason: Cannot read properties of null (reading 'category')

[Killed] BooleanLiteral
src/lib/blog/api.ts:77:7
 ): Promise<MaybeNull<BlogPostType>> {
   // Stryker Workaround 5. Pointless mutants: there's no ambiguity here.
   // Stryker disable next-line ConditionalExpression,EqualityOperator
-  if (!ComputedBlogCtx.TESTING && category === BlogConfig.TESTING_CATEGORY) return null;
+  if (ComputedBlogCtx.TESTING && category === BlogConfig.TESTING_CATEGORY) return null;
 
   const getBlogPostWithAllowedDraftsCtx: () => MaybeNull<BlogPostType> = () =>
killedBy: getPostStrict (happy paths) should return a valid post
statusReason: Cannot read properties of null (reading 'category')

[Killed] ConditionalExpression
src/lib/blog/api.ts:80:57
   if (!ComputedBlogCtx.TESTING && category === BlogConfig.TESTING_CATEGORY) return null;
 
   const getBlogPostWithAllowedDraftsCtx: () => MaybeNull<BlogPostType> = () =>
-    postsCollection.find(({ slug: currentPostSlug }) => currentPostSlug === targettedSlug) ?? null;
+    postsCollection.find(({ slug: currentPostSlug }) => true) ?? null;
 
   const getBlogPostWithDisallowedDraftsCtx: () => MaybeNull<BlogPostType> = () =>
killedBy: getBlogPostUnstrict (unhappy paths) should return null, given invalid slug
statusReason: expected { metadescription: 'FAKE', …(16) } to be null // Object.is equality

[Killed] ConditionalExpression
src/lib/blog/api.ts:80:57
   if (!ComputedBlogCtx.TESTING && category === BlogConfig.TESTING_CATEGORY) return null;
 
   const getBlogPostWithAllowedDraftsCtx: () => MaybeNull<BlogPostType> = () =>
-    postsCollection.find(({ slug: currentPostSlug }) => currentPostSlug === targettedSlug) ?? null;
+    postsCollection.find(({ slug: currentPostSlug }) => false) ?? null;
 
   const getBlogPostWithDisallowedDraftsCtx: () => MaybeNull<BlogPostType> = () =>
killedBy: getPostStrict (happy paths) should return a valid post when picking a non-draft post in an authorized drafts CTX
statusReason: Cannot read properties of null (reading 'category')

[Killed] ArrowFunction
src/lib/blog/api.ts:83:26
     postsCollection.find(({ slug: currentPostSlug }) => currentPostSlug === targettedSlug) ?? null;
 
   const getBlogPostWithDisallowedDraftsCtx: () => MaybeNull<BlogPostType> = () =>
-    postsCollection.find(({ draft: currentPostDraft, slug: currentPostSlug }) => !currentPostDraft && currentPostSlug === targettedSlug) ?? null;
+    postsCollection.find(() => undefined) ?? null;
 
   const postsCollection: BlogPostType[] = await getAllBlogPostsByCategoryAndSubcategoryAndLanguageUnstrict(category, subcategory, language);
killedBy: getPostStrict (happy paths) should return a valid post when picking a non-draft post in an unauthorized drafts CTX
statusReason: Cannot read properties of null (reading 'category')

[Killed] ConditionalExpression
src/lib/blog/api.ts:83:103
     postsCollection.find(({ slug: currentPostSlug }) => currentPostSlug === targettedSlug) ?? null;
 
   const getBlogPostWithDisallowedDraftsCtx: () => MaybeNull<BlogPostType> = () =>
-    postsCollection.find(({ draft: currentPostDraft, slug: currentPostSlug }) => !currentPostDraft && currentPostSlug === targettedSlug) ?? null;
+    postsCollection.find(({ draft: currentPostDraft, slug: currentPostSlug }) => !currentPostDraft && true) ?? null;
 
   const postsCollection: BlogPostType[] = await getAllBlogPostsByCategoryAndSubcategoryAndLanguageUnstrict(category, subcategory, language);
killedBy: getBlogPostPathWithoutI18nPart (happy paths) should return the path without its language part
statusReason: expected '/blog/blog-testing-category/fake-subc…' to be '/blog/blog-testing-category/fake-subc…' // Object.is equality

[Killed] EqualityOperator
src/lib/blog/api.ts:113:27
 export function blogSubcategoryShouldTriggerNotFound(postsCollection: Partial<BlogPostType>[]): boolean {
   const isForcedPath = BlogConfig.USE_BLOG_POSTS_NOTFOUND_WHEN_SUBCATEGORY_IS_EMPTY_INSTEAD_OF_NOT_FOUND;
   // eslint-disable-next-line no-magic-numbers
-  return !isForcedPath && postsCollection.length === 0;
+  return !isForcedPath && postsCollection.length !== 0;
 }
 
killedBy: blogSubcategoryShouldTriggerNotFound should return false only when the list is not empty
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/lib/blog/api.ts:113:10
 export function blogSubcategoryShouldTriggerNotFound(postsCollection: Partial<BlogPostType>[]): boolean {
   const isForcedPath = BlogConfig.USE_BLOG_POSTS_NOTFOUND_WHEN_SUBCATEGORY_IS_EMPTY_INSTEAD_OF_NOT_FOUND;
   // eslint-disable-next-line no-magic-numbers
-  return !isForcedPath && postsCollection.length === 0;
+  return !isForcedPath || postsCollection.length === 0;
 }
 
killedBy: blogSubcategoryShouldTriggerNotFound should return false only when the list is not empty
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/lib/blog/api.ts:120:71
   // Stryker Workaround 6. Mutant will be killed with `if (true)` as expected, but `if (false)` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
   // eslint-disable-next-line no-magic-numbers
-  const postDateHasTime = (date: IsoDateTimeString) => date.substring(date.indexOf('T') + 1) !== '00:00:00.000Z';
+  const postDateHasTime = (date: IsoDateTimeString) => date.substring(date.indexOf('T') - 1) !== '00:00:00.000Z';
 
   const giveTime = postDateHasTime(date);
killedBy: getBlogPostFormattedDate should return date without time, given valid ISO Date String with null timestamp
statusReason: expected 'Vendredi 24 décembre 2021 à 01:00' to be 'Vendredi 24 décembre 2021' // Object.is equality

[Killed] EqualityOperator
src/lib/blog/api.ts:120:56
   // Stryker Workaround 6. Mutant will be killed with `if (true)` as expected, but `if (false)` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
   // eslint-disable-next-line no-magic-numbers
-  const postDateHasTime = (date: IsoDateTimeString) => date.substring(date.indexOf('T') + 1) !== '00:00:00.000Z';
+  const postDateHasTime = (date: IsoDateTimeString) => date.substring(date.indexOf('T') + 1) === '00:00:00.000Z';
 
   const giveTime = postDateHasTime(date);
killedBy: getBlogPostFormattedDate should return date without time, given valid ISO Date String with null timestamp
statusReason: expected 'Vendredi 24 décembre 2021 à 01:00' to be 'Vendredi 24 décembre 2021' // Object.is equality

[Killed] BooleanLiteral
src/lib/blog/api.ts:130:84
 export function isValidBlogCategory(category: string): boolean {
   // Stryker Workaround 7. Testing "&& true" is pointless.
   // Stryker disable next-line ConditionalExpression
-  if (!ComputedBlogCtx.TESTING && category === BlogConfig.TESTING_CATEGORY) return false;
+  if (!ComputedBlogCtx.TESTING && category === BlogConfig.TESTING_CATEGORY) return true;
 
   const categories = getAllBlogCategories();
killedBy: isValidBlogCategory should return false, given testing category in not testing ctx
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/lib/blog/api.ts:130:7
 export function isValidBlogCategory(category: string): boolean {
   // Stryker Workaround 7. Testing "&& true" is pointless.
   // Stryker disable next-line ConditionalExpression
-  if (!ComputedBlogCtx.TESTING && category === BlogConfig.TESTING_CATEGORY) return false;
+  if (!ComputedBlogCtx.TESTING || category === BlogConfig.TESTING_CATEGORY) return false;
 
   const categories = getAllBlogCategories();
killedBy: getPostStrict (happy paths) should return a valid post when picking a non-draft post in an authorized drafts CTX
statusReason: Cannot read properties of null (reading 'category')

[Killed] ConditionalExpression
src/lib/blog/api.ts:133:7
   if (!ComputedBlogCtx.TESTING && category === BlogConfig.TESTING_CATEGORY) return false;
 
   const categories = getAllBlogCategories();
-  if (!categories.includes(category as any)) return false;
+  if (true) return false;
   return true;
 }
killedBy: getBlogStaticParams should return static params, excluding the 'drafts' fake language
statusReason: expected [] to strictly equal [ { …(4) }, { …(4) }, { …(4) }, …(6) ]

[Killed] BooleanLiteral
src/lib/blog/api.ts:133:7
   if (!ComputedBlogCtx.TESTING && category === BlogConfig.TESTING_CATEGORY) return false;
 
   const categories = getAllBlogCategories();
-  if (!categories.includes(category as any)) return false;
+  if (categories.includes((category as any))) return false;
   return true;
 }
killedBy: getPostStrict (happy paths) should return a valid post when picking a non-draft post in an authorized drafts CTX
statusReason: Cannot read properties of null (reading 'category')

[Killed] BooleanLiteral
src/lib/blog/api.ts:134:10
 
   const categories = getAllBlogCategories();
   if (!categories.includes(category as any)) return false;
-  return true;
+  return false;
 }
 
killedBy: getBlogStaticParams should return static params, excluding the 'drafts' fake language
statusReason: expected [] to strictly equal [ { …(4) }, { …(4) }, { …(4) }, …(6) ]

[Killed] BooleanLiteral
src/lib/blog/api.ts:143:46
 ): Promise<boolean> {
   // Stryker Workaround 8. Mutant will be killed with `if (true)` as expected, but `if (false)` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
-  if (!isValidBlogCategory(category)) return false;
+  if (!isValidBlogCategory(category)) return true;
 
   for (const language of LANGUAGES) {
killedBy: isValidBlogCategoryAndSubcategoryPairInAnyLanguage should return false, given an invalid category and subcategory
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/lib/blog/api.ts:143:7
 ): Promise<boolean> {
   // Stryker Workaround 8. Mutant will be killed with `if (true)` as expected, but `if (false)` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
-  if (!isValidBlogCategory(category)) return false;
+  if (isValidBlogCategory(category)) return false;
 
   for (const language of LANGUAGES) {
killedBy: blogPostGuard should not throw, given valid input
statusReason: promise rejected "Error: NEXT_REDIRECT { digest: 'NEXT…' }" instead of resolving

[Killed] BlockStatement
src/lib/blog/api.ts:145:37
   // Stryker disable next-line ConditionalExpression
   if (!isValidBlogCategory(category)) return false;
 
-  for (const language of LANGUAGES) {
-    const currentSubcategories = await getBlogSubcategoriesByCategory(category, language);
-    if (currentSubcategories.includes(subcategory)) return true;
-  }
+  for (const language of LANGUAGES) {}
   return false;
 }
killedBy: isValidBlogCategoryAndSubcategoryPairInAnyLanguage should return true, given a valid combination
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/blog/api.ts:147:9
 
   for (const language of LANGUAGES) {
     const currentSubcategories = await getBlogSubcategoriesByCategory(category, language);
-    if (currentSubcategories.includes(subcategory)) return true;
+    if (true) return true;
   }
   return false;
killedBy: blogPostGuard should throw redirect error, given invalid subcategory
statusReason: expected '/blog/blog-testing-category/__INVALID…' to be '/blog/blog-testing-category' // Object.is equality

[Killed] BooleanLiteral
src/lib/blog/api.ts:147:60
 
   for (const language of LANGUAGES) {
     const currentSubcategories = await getBlogSubcategoriesByCategory(category, language);
-    if (currentSubcategories.includes(subcategory)) return true;
+    if (currentSubcategories.includes(subcategory)) return false;
   }
   return false;
killedBy: blogPostGuard should not throw, given valid input
statusReason: promise rejected "Error: NEXT_REDIRECT { digest: 'NEXT…' }" instead of resolving

[Killed] ConditionalExpression
src/lib/blog/api.ts:162:7
   if (!isValidBlogCategory(category)) return false;
 
   const subcategories = await getBlogSubcategoriesByCategory(category, language);
-  if (!subcategories.includes(subcategory)) return false;
+  if (false) return false;
   return true;
 }
killedBy: isValidBlogCategoryAndSubcategoryPair should be false for invalid combinations, given invalid subcategory
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/lib/blog/api.ts:162:52
   if (!isValidBlogCategory(category)) return false;
 
   const subcategories = await getBlogSubcategoriesByCategory(category, language);
-  if (!subcategories.includes(subcategory)) return false;
+  if (!subcategories.includes(subcategory)) return true;
   return true;
 }
killedBy: isValidBlogCategoryAndSubcategoryPair should be false for invalid combinations, given invalid subcategory
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/lib/blog/api.ts:163:10
 
   const subcategories = await getBlogSubcategoriesByCategory(category, language);
   if (!subcategories.includes(subcategory)) return false;
-  return true;
+  return false;
 }
 
killedBy: getPostStrict (happy paths) should return a valid post
statusReason: Cannot read properties of null (reading 'category')

[Killed] StringLiteral
src/lib/blog/api.ts:172:51
   redirect(buildAbsolutePathFromParts(ROUTES_ROOTS.BLOG, category, subcategory));
 
 export function getBlogPostPathWithoutI18nPart(language: string, url: string): AppPath {
-  const blogPostPathWithoutI18nPart = url.replace(`/${language}/`, '/');
+  const blogPostPathWithoutI18nPart = url.replace(``, '/');
   return blogPostPathWithoutI18nPart;
 }
killedBy: getBlogPostPathWithoutI18nPart (happy paths) should return the path without its language part
statusReason: expected '//posts/blog/blog-testing-category/fa…' to be '/blog/blog-testing-category/fake-subc…' // Object.is equality

[Killed] StringLiteral
src/lib/blog/api.ts:172:68
   redirect(buildAbsolutePathFromParts(ROUTES_ROOTS.BLOG, category, subcategory));
 
 export function getBlogPostPathWithoutI18nPart(language: string, url: string): AppPath {
-  const blogPostPathWithoutI18nPart = url.replace(`/${language}/`, '/');
+  const blogPostPathWithoutI18nPart = url.replace(`/${language}/`, "");
   return blogPostPathWithoutI18nPart;
 }
killedBy: getBlogPostPathWithoutI18nPart (happy paths) should return the path without its language part
statusReason: expected 'blog/blog-testing-category/fake-subca…' to be '/blog/blog-testing-category/fake-subc…' // Object.is equality

[Killed] ArithmeticOperator
src/lib/blog/api.ts:178:21
 
 export function getSlicedBlogPostDescription(description: string): CroppedDescription | DescriptionAsIs {
   // eslint-disable-next-line no-magic-numbers
-  const takeLimit = BlogConfig.BLOG_POST_PREVIEW_DESCRIPTION_CHARACTERS_LIMIT - 1;
+  const takeLimit = BlogConfig.BLOG_POST_PREVIEW_DESCRIPTION_CHARACTERS_LIMIT + 1;
   if (description.length <= takeLimit) return description;
 
killedBy: getSlicedBlogPostDescription should slice description, given a too long description
statusReason: expected 251 to be 250 // Object.is equality

[Killed] EqualityOperator
src/lib/blog/api.ts:179:7
 export function getSlicedBlogPostDescription(description: string): CroppedDescription | DescriptionAsIs {
   // eslint-disable-next-line no-magic-numbers
   const takeLimit = BlogConfig.BLOG_POST_PREVIEW_DESCRIPTION_CHARACTERS_LIMIT - 1;
-  if (description.length <= takeLimit) return description;
+  if (description.length < takeLimit) return description;
 
   // eslint-disable-next-line no-magic-numbers
killedBy: getSlicedBlogPostDescription should not slice description, given a description that doesn't exceed the limit
statusReason: expected '$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$…' to strictly equal '$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$…'

[Killed] EqualityOperator
src/lib/blog/api.ts:179:7
 export function getSlicedBlogPostDescription(description: string): CroppedDescription | DescriptionAsIs {
   // eslint-disable-next-line no-magic-numbers
   const takeLimit = BlogConfig.BLOG_POST_PREVIEW_DESCRIPTION_CHARACTERS_LIMIT - 1;
-  if (description.length <= takeLimit) return description;
+  if (description.length > takeLimit) return description;
 
   // eslint-disable-next-line no-magic-numbers
killedBy: getSlicedBlogPostDescription should slice description, given a too long description
statusReason: expected 251 to be 250 // Object.is equality

[Killed] MethodExpression
src/lib/blog/api.ts:182:29
   if (description.length <= takeLimit) return description;
 
   // eslint-disable-next-line no-magic-numbers
-  const slicedDescription = description.substring(0, takeLimit) + '…';
+  const slicedDescription = description + '…';
   return slicedDescription;
 }
killedBy: getSlicedBlogPostDescription should slice description, given a too long description
statusReason: expected 252 to be 250 // Object.is equality
