[NoCoverage] BlockStatement
src/lib/blog/blogCategoryPageBuilder.tsx:26:29
   category: BlogCategory,
   language: LanguageFlag
 ): Promise<ReactElement[] | ReactElement> {
-  function buildHistogram() {
-    for (const post of posts) {
-      const curSubcateg = post.subcategory as BlogSubcategoryFromUnknownCategory;
-      if (histogram[curSubcateg] === undefined) continue;
-
-      // eslint-disable-next-line no-magic-numbers
-      if (histogram[curSubcateg].length < limit + 1 && post.language === language) {
-        histogram[curSubcateg].push(post);
-        // eslint-disable-next-line no-magic-numbers
-        if (Object.values(histogram).every((posts2) => posts2.length >= limit + 1)) break;
-      }
-    }
-  }
+  function buildHistogram() {}
 
   function buildPostsCollectionsSnippets() {

[NoCoverage] BlockStatement
src/lib/blog/blogCategoryPageBuilder.tsx:27:31
   language: LanguageFlag
 ): Promise<ReactElement[] | ReactElement> {
   function buildHistogram() {
-    for (const post of posts) {
-      const curSubcateg = post.subcategory as BlogSubcategoryFromUnknownCategory;
-      if (histogram[curSubcateg] === undefined) continue;
-
-      // eslint-disable-next-line no-magic-numbers
-      if (histogram[curSubcateg].length < limit + 1 && post.language === language) {
-        histogram[curSubcateg].push(post);
-        // eslint-disable-next-line no-magic-numbers
-        if (Object.values(histogram).every((posts2) => posts2.length >= limit + 1)) break;
-      }
-    }
+    for (const post of posts) {}
   }
 

[NoCoverage] EqualityOperator
src/lib/blog/blogCategoryPageBuilder.tsx:29:11
   function buildHistogram() {
     for (const post of posts) {
       const curSubcateg = post.subcategory as BlogSubcategoryFromUnknownCategory;
-      if (histogram[curSubcateg] === undefined) continue;
+      if (histogram[curSubcateg] !== undefined) continue;
 
       // eslint-disable-next-line no-magic-numbers

[NoCoverage] ConditionalExpression
src/lib/blog/blogCategoryPageBuilder.tsx:29:11
   function buildHistogram() {
     for (const post of posts) {
       const curSubcateg = post.subcategory as BlogSubcategoryFromUnknownCategory;
-      if (histogram[curSubcateg] === undefined) continue;
+      if (true) continue;
 
       // eslint-disable-next-line no-magic-numbers

[NoCoverage] ArithmeticOperator
src/lib/blog/blogCategoryPageBuilder.tsx:32:43
       if (histogram[curSubcateg] === undefined) continue;
 
       // eslint-disable-next-line no-magic-numbers
-      if (histogram[curSubcateg].length < limit + 1 && post.language === language) {
+      if (histogram[curSubcateg].length < limit - 1 && post.language === language) {
         histogram[curSubcateg].push(post);
         // eslint-disable-next-line no-magic-numbers

[NoCoverage] EqualityOperator
src/lib/blog/blogCategoryPageBuilder.tsx:32:11
       if (histogram[curSubcateg] === undefined) continue;
 
       // eslint-disable-next-line no-magic-numbers
-      if (histogram[curSubcateg].length < limit + 1 && post.language === language) {
+      if (histogram[curSubcateg].length >= limit + 1 && post.language === language) {
         histogram[curSubcateg].push(post);
         // eslint-disable-next-line no-magic-numbers

[NoCoverage] EqualityOperator
src/lib/blog/blogCategoryPageBuilder.tsx:35:56
       if (histogram[curSubcateg].length < limit + 1 && post.language === language) {
         histogram[curSubcateg].push(post);
         // eslint-disable-next-line no-magic-numbers
-        if (Object.values(histogram).every((posts2) => posts2.length >= limit + 1)) break;
+        if (Object.values(histogram).every((posts2) => posts2.length < limit + 1)) break;
       }
     }

[NoCoverage] ConditionalExpression
src/lib/blog/blogCategoryPageBuilder.tsx:35:56
       if (histogram[curSubcateg].length < limit + 1 && post.language === language) {
         histogram[curSubcateg].push(post);
         // eslint-disable-next-line no-magic-numbers
-        if (Object.values(histogram).every((posts2) => posts2.length >= limit + 1)) break;
+        if (Object.values(histogram).every((posts2) => true)) break;
       }
     }

[NoCoverage] BlockStatement
src/lib/blog/blogCategoryPageBuilder.tsx:40:44
     }
   }
 
-  function buildPostsCollectionsSnippets() {
-    for (const [subcategory, posts2] of Object.entries(histogram)) {
-      postsCollectionsSnippets[subcategory as BlogSubcategoryFromUnknownCategory] = posts2.map((post) => (
-        <BlogPostPreview key={`${post._raw.flattenedPath}-post-snippet`} isNotOnBlogSubcategoryPage language={language} post={post} />
-      ));
-    }
-  }
+  function buildPostsCollectionsSnippets() {}
 
   // eslint-disable-next-line no-magic-numbers

[NoCoverage] BlockStatement
src/lib/blog/blogCategoryPageBuilder.tsx:41:68
   }
 
   function buildPostsCollectionsSnippets() {
-    for (const [subcategory, posts2] of Object.entries(histogram)) {
-      postsCollectionsSnippets[subcategory as BlogSubcategoryFromUnknownCategory] = posts2.map((post) => (
-        <BlogPostPreview key={`${post._raw.flattenedPath}-post-snippet`} isNotOnBlogSubcategoryPage language={language} post={post} />
-      ));
-    }
+    for (const [subcategory, posts2] of Object.entries(histogram)) {}
   }
 

[NoCoverage] ArrowFunction
src/lib/blog/blogCategoryPageBuilder.tsx:42:96
 
   function buildPostsCollectionsSnippets() {
     for (const [subcategory, posts2] of Object.entries(histogram)) {
-      postsCollectionsSnippets[subcategory as BlogSubcategoryFromUnknownCategory] = posts2.map((post) => (
-        <BlogPostPreview key={`${post._raw.flattenedPath}-post-snippet`} isNotOnBlogSubcategoryPage language={language} post={post} />
-      ));
+      postsCollectionsSnippets[subcategory as BlogSubcategoryFromUnknownCategory] = posts2.map(() => undefined);
     }
   }

[NoCoverage] StringLiteral
src/lib/blog/blogCategoryPageBuilder.tsx:43:31
   function buildPostsCollectionsSnippets() {
     for (const [subcategory, posts2] of Object.entries(histogram)) {
       postsCollectionsSnippets[subcategory as BlogSubcategoryFromUnknownCategory] = posts2.map((post) => (
-        <BlogPostPreview key={`${post._raw.flattenedPath}-post-snippet`} isNotOnBlogSubcategoryPage language={language} post={post} />
+        <BlogPostPreview key={``} isNotOnBlogSubcategoryPage language={language} post={post} />
       ));
     }

[NoCoverage] ConditionalExpression
src/lib/blog/blogCategoryPageBuilder.tsx:49:91
   }
 
   // eslint-disable-next-line no-magic-numbers
-  const isEmptySnippets = () => Object.values(postsCollectionsSnippets).every((posts2) => posts2.length === 0);
+  const isEmptySnippets = () => Object.values(postsCollectionsSnippets).every((posts2) => true);
 
   function contentGenerator(): ReactElement[] {

[NoCoverage] MethodExpression
src/lib/blog/blogCategoryPageBuilder.tsx:49:33
   }
 
   // eslint-disable-next-line no-magic-numbers
-  const isEmptySnippets = () => Object.values(postsCollectionsSnippets).every((posts2) => posts2.length === 0);
+  const isEmptySnippets = () => Object.values(postsCollectionsSnippets).some(posts2 => posts2.length === 0);
 
   function contentGenerator(): ReactElement[] {

[NoCoverage] BooleanLiteral
src/lib/blog/blogCategoryPageBuilder.tsx:53:18
 
   function contentGenerator(): ReactElement[] {
     const result: ReactElement[] = [];
-    let isLast = false;
+    let isLast = true;
     const max = Object.entries(postsCollectionsSnippets).length;
     let counter = 0;

[NoCoverage] UpdateOperator
src/lib/blog/blogCategoryPageBuilder.tsx:58:7
     let counter = 0;
 
     for (const [subcategory, posts] of Object.entries(postsCollectionsSnippets)) {
-      ++counter;
+      --counter;
       isLast = counter >= max;
       // eslint-disable-next-line no-magic-numbers

[NoCoverage] EqualityOperator
src/lib/blog/blogCategoryPageBuilder.tsx:59:16
 
     for (const [subcategory, posts] of Object.entries(postsCollectionsSnippets)) {
       ++counter;
-      isLast = counter >= max;
+      isLast = counter > max;
       // eslint-disable-next-line no-magic-numbers
       if (posts.length === 0) continue;

[NoCoverage] EqualityOperator
src/lib/blog/blogCategoryPageBuilder.tsx:59:16
 
     for (const [subcategory, posts] of Object.entries(postsCollectionsSnippets)) {
       ++counter;
-      isLast = counter >= max;
+      isLast = counter < max;
       // eslint-disable-next-line no-magic-numbers
       if (posts.length === 0) continue;

[NoCoverage] ConditionalExpression
src/lib/blog/blogCategoryPageBuilder.tsx:61:11
       ++counter;
       isLast = counter >= max;
       // eslint-disable-next-line no-magic-numbers
-      if (posts.length === 0) continue;
+      if (false) continue;
       const narrowedCategoryAndSubcategoryAssoc = `${category}.${subcategory}` as BlogCategoriesAndSubcategoriesAssoc;
       const curSubcategTitle = globalT(`${i18ns.blogCategories}.${narrowedCategoryAndSubcategoryAssoc}.title`);

[NoCoverage] ConditionalExpression
src/lib/blog/blogCategoryPageBuilder.tsx:61:11
       ++counter;
       isLast = counter >= max;
       // eslint-disable-next-line no-magic-numbers
-      if (posts.length === 0) continue;
+      if (true) continue;
       const narrowedCategoryAndSubcategoryAssoc = `${category}.${subcategory}` as BlogCategoriesAndSubcategoriesAssoc;
       const curSubcategTitle = globalT(`${i18ns.blogCategories}.${narrowedCategoryAndSubcategoryAssoc}.title`);

[NoCoverage] EqualityOperator
src/lib/blog/blogCategoryPageBuilder.tsx:75:11
       );
 
       let showMoreLink = null;
-      if (posts.length > limit) {
+      if (posts.length >= limit) {
         showMoreLink = (
           <div className="flex w-full justify-center">

[NoCoverage] BlockStatement
src/lib/blog/blogCategoryPageBuilder.tsx:75:33
       );
 
       let showMoreLink = null;
-      if (posts.length > limit) {
-        showMoreLink = (
-          <div className="flex w-full justify-center">
-            <Button className={cn(BUTTON_CONFIG.CLASSNAME, 'mt-4 lg:mb-0')} size="lg" asChild>
-              <Link href={href}>{globalT(`${i18ns.vocab}.see-more`)}</Link>
-            </Button>
-          </div>
-        );
-        posts.pop();
-      }
+      if (posts.length > limit) {}
 
       const sep = <hr className="color-inherit m-auto my-5 w-36 opacity-50" key={`${subcategory}-${curSubcategTitle}-sep`} />;

[NoCoverage] StringLiteral
src/lib/blog/blogCategoryPageBuilder.tsx:91:16
       const section = (
         <section
           className="my-4 [&>article:not(:last-of-type)]:mb-6"
-          key={`${subcategory}-${curSubcategTitle}-section`}
+          key={``}
           id={slugger.slug(curSubcategTitle)}
         >

[NoCoverage] LogicalOperator
src/lib/blog/blogCategoryPageBuilder.tsx:102:11
 
       result.push(section);
       // eslint-disable-next-line no-magic-numbers
-      if (!isLast && !showMoreLink && max > 1) result.push(sep);
+      if (!isLast || !showMoreLink && max > 1) result.push(sep);
     }
 

[NoCoverage] ConditionalExpression
src/lib/blog/blogCategoryPageBuilder.tsx:102:39
 
       result.push(section);
       // eslint-disable-next-line no-magic-numbers
-      if (!isLast && !showMoreLink && max > 1) result.push(sep);
+      if (!isLast && !showMoreLink && true) result.push(sep);
     }
 

[NoCoverage] ConditionalExpression
src/lib/blog/blogCategoryPageBuilder.tsx:109:7
   }
 
   // eslint-disable-next-line no-magic-numbers
-  if (posts.length === 0) return <BlogPostsNotFound />;
+  if (false) return <BlogPostsNotFound />;
 
   const globalT = await getServerSideI18n();

[NoCoverage] ConditionalExpression
src/lib/blog/blogCategoryPageBuilder.tsx:109:7
   }
 
   // eslint-disable-next-line no-magic-numbers
-  if (posts.length === 0) return <BlogPostsNotFound />;
+  if (true) return <BlogPostsNotFound />;
 
   const globalT = await getServerSideI18n();

[NoCoverage] MethodExpression
src/lib/blog/blogCategoryPageBuilder.tsx:116:25
   const entries: [BlogSubcategoryFromUnknownCategory, unknown[]][] = subcategs.map((subcateg) => [subcateg, []]);
   const { pagesTitles } = i18ns;
 
-  const sortedEntries = entries.sort(([entry1], [entry2]) =>
-    BlogConfig.DEFAULT_COMPARE_FUNCTION_USED_TO_SORT_SUBCATEGORIES_ON_BLOG_CATEGORY_PAGE(
-      globalT(`${pagesTitles}.${entry1}`),
-      globalT(`${pagesTitles}.${entry2}`),
-      language
-    )
-  );
+  const sortedEntries = entries;
 
   const [histogram, postsCollectionsSnippets] = [

[NoCoverage] ConditionalExpression
src/lib/blog/blogCategoryPageBuilder.tsx:132:7
 
   buildHistogram();
   buildPostsCollectionsSnippets();
-  if (isEmptySnippets()) return <BlogPostsNotFound />;
+  if (false) return <BlogPostsNotFound />;
 
   const result: ReactElement[] = contentGenerator();

[NoCoverage] ConditionalExpression
src/lib/blog/blogCategoryPageBuilder.tsx:132:7
 
   buildHistogram();
   buildPostsCollectionsSnippets();
-  if (isEmptySnippets()) return <BlogPostsNotFound />;
+  if (true) return <BlogPostsNotFound />;
 
   const result: ReactElement[] = contentGenerator();
