[Killed] BlockStatement
lib/blog/guards/blogCategoryGuard.ts:8:78
 
 import { isValidBlogCategory } from '../api';
 
-export default function blogCategoryGuard({ params }: BlogCategoryPageProps) {
-  const category = params[BlogTaxonomy.CATEGORY];
-
-  if (!isValidBlogCategory(category)) notFound();
-}
+export default function blogCategoryGuard({ params }: BlogCategoryPageProps) {}
 
killedBy: blogCategoryGuard should throw not found error, given invalid category
statusReason: expected number of assertions to be 1, but got 0

[Killed] BooleanLiteral
lib/blog/guards/blogCategoryGuard.ts:11:7
 export default function blogCategoryGuard({ params }: BlogCategoryPageProps) {
   const category = params[BlogTaxonomy.CATEGORY];
 
-  if (!isValidBlogCategory(category)) notFound();
+  if (isValidBlogCategory(category)) notFound();
 }
 
killedBy: blogCategoryGuard should not throw not found error, given valid category
statusReason: expected [Function] to not throw an error but 'Error: NEXT_NOT_FOUND' was thrown

[Killed] ConditionalExpression
lib/blog/guards/blogCategoryGuard.ts:11:7
 export default function blogCategoryGuard({ params }: BlogCategoryPageProps) {
   const category = params[BlogTaxonomy.CATEGORY];
 
-  if (!isValidBlogCategory(category)) notFound();
+  if (true) notFound();
 }
 
killedBy: blogCategoryGuard should not throw not found error, given valid category
statusReason: expected [Function] to not throw an error but 'Error: NEXT_NOT_FOUND' was thrown
