[Killed] BlockStatement
lib/blog/guards/blogPostGuard.ts:17:76
   isValidBlogCategory
 } from '../api';
 
-export default async function blogPostGuard({ params }: BlogPostPageProps) {
-  const [category, subcategory] = [params[BlogTaxonomy.CATEGORY], params[BlogTaxonomy.SUBCATEGORY]];
-
-  const validCombination: boolean = await isValidBlogCategoryAndSubcategoryPairInAnyLanguage(category, subcategory);
-
-  const [slug, language] = [params[BlogTaxonomy.SLUG], params[I18nTaxonomy.LANGUAGE]];
-
-  const post = validCombination ? await getBlogPostUnstrict(category, subcategory, slug, language) : undefined;
-
-  if (!post && validCombination) {
-    redirectToBlogCategoryAndSubcategoryPairPageUnstrict(category, subcategory);
-  } else if (!post && isValidBlogCategory(category)) {
-    redirectToBlogCategoryPage(category);
-  } else if (!post) {
-    redirect(buildAbsolutePathFromParts(ROUTES_ROOTS.WEBSITE, category));
-  }
-}
+export default async function blogPostGuard({ params }: BlogPostPageProps) {}
 
killedBy: blogPostGuard should throw redirect error, given invalid slug
statusReason: expected number of assertions to be 2, but got 0

[Killed] BooleanLiteral
lib/blog/guards/blogPostGuard.ts:26:7
 
   const post = validCombination ? await getBlogPostUnstrict(category, subcategory, slug, language) : undefined;
 
-  if (!post && validCombination) {
+  if (post && validCombination) {
     redirectToBlogCategoryAndSubcategoryPairPageUnstrict(category, subcategory);
   } else if (!post && isValidBlogCategory(category)) {
killedBy: blogPostGuard should not throw, given valid input
statusReason: promise rejected "Error: NEXT_REDIRECT { digest: 'NEXT…' }" instead of resolving

[Killed] LogicalOperator
lib/blog/guards/blogPostGuard.ts:26:7
 
   const post = validCombination ? await getBlogPostUnstrict(category, subcategory, slug, language) : undefined;
 
-  if (!post && validCombination) {
+  if (!post || validCombination) {
     redirectToBlogCategoryAndSubcategoryPairPageUnstrict(category, subcategory);
   } else if (!post && isValidBlogCategory(category)) {
killedBy: blogPostGuard should not throw, given valid input
statusReason: promise rejected "Error: NEXT_REDIRECT { digest: 'NEXT…' }" instead of resolving

[Killed] BooleanLiteral
lib/blog/guards/blogPostGuard.ts:28:14
 
   if (!post && validCombination) {
     redirectToBlogCategoryAndSubcategoryPairPageUnstrict(category, subcategory);
-  } else if (!post && isValidBlogCategory(category)) {
+  } else if (post && isValidBlogCategory(category)) {
     redirectToBlogCategoryPage(category);
   } else if (!post) {
killedBy: blogPostGuard should not throw, given valid input
statusReason: promise rejected "Error: NEXT_REDIRECT { digest: 'NEXT…' }" instead of resolving

[Killed] ConditionalExpression
lib/blog/guards/blogPostGuard.ts:28:14
 
   if (!post && validCombination) {
     redirectToBlogCategoryAndSubcategoryPairPageUnstrict(category, subcategory);
-  } else if (!post && isValidBlogCategory(category)) {
+  } else if (true) {
     redirectToBlogCategoryPage(category);
   } else if (!post) {
killedBy: blogPostGuard should not throw, given valid input
statusReason: promise rejected "Error: NEXT_REDIRECT { digest: 'NEXT…' }" instead of resolving

[Killed] ConditionalExpression
lib/blog/guards/blogPostGuard.ts:30:14
     redirectToBlogCategoryAndSubcategoryPairPageUnstrict(category, subcategory);
   } else if (!post && isValidBlogCategory(category)) {
     redirectToBlogCategoryPage(category);
-  } else if (!post) {
+  } else if (true) {
     redirect(buildAbsolutePathFromParts(ROUTES_ROOTS.WEBSITE, category));
   }
killedBy: blogPostGuard should not throw, given valid input
statusReason: promise rejected "Error: NEXT_REDIRECT { digest: 'NEXT…' }" instead of resolving

[Killed] BooleanLiteral
lib/blog/guards/blogPostGuard.ts:30:14
     redirectToBlogCategoryAndSubcategoryPairPageUnstrict(category, subcategory);
   } else if (!post && isValidBlogCategory(category)) {
     redirectToBlogCategoryPage(category);
-  } else if (!post) {
+  } else if (post) {
     redirect(buildAbsolutePathFromParts(ROUTES_ROOTS.WEBSITE, category));
   }
killedBy: blogPostGuard should not throw, given valid input
statusReason: promise rejected "Error: NEXT_REDIRECT { digest: 'NEXT…' }" instead of resolving
