[Killed] BlockStatement
lib/blog/guards/blogSubcategoryGuard.ts:10:90
 
 import { isValidBlogCategoryAndSubcategoryPairInAnyLanguage, redirectToBlogCategoryPage, isValidBlogCategory } from '../api';
 
-export default async function blogSubcategoryGuard({ params }: BlogSubcategoryPageProps) {
-  const category = params[BlogTaxonomy.CATEGORY];
-
-  const validCategory = isValidBlogCategory(category);
-  // Stryker Workaround 1. Mutant will be killed with `= true` as expected, but `= false` mutant is pointless.
-  // Stryker disable next-line ConditionalExpression
-  const categServedAtRoot = ROUTES_ROOTS.WEBSITE + category === ROUTES_ROOTS.BLOG + category;
-  if (!validCategory && !categServedAtRoot) redirect(buildAbsolutePathFromParts(ROUTES_ROOTS.WEBSITE, category));
-
-  const subcategory = params[BlogTaxonomy.SUBCATEGORY];
-
-  const validCombination: boolean = await isValidBlogCategoryAndSubcategoryPairInAnyLanguage(category, subcategory);
-  if (!validCombination) redirectToBlogCategoryPage(category);
-}
+export default async function blogSubcategoryGuard({ params }: BlogSubcategoryPageProps) {}
 
killedBy: blogSubcategoryGuard should throw redirect error, given invalid category and valid subcategory
statusReason: expected number of assertions to be 2, but got 0

[Killed] EqualityOperator
lib/blog/guards/blogSubcategoryGuard.ts:16:29
   const validCategory = isValidBlogCategory(category);
   // Stryker Workaround 1. Mutant will be killed with `= true` as expected, but `= false` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
-  const categServedAtRoot = ROUTES_ROOTS.WEBSITE + category === ROUTES_ROOTS.BLOG + category;
+  const categServedAtRoot = ROUTES_ROOTS.WEBSITE + category !== ROUTES_ROOTS.BLOG + category;
   if (!validCategory && !categServedAtRoot) redirect(buildAbsolutePathFromParts(ROUTES_ROOTS.WEBSITE, category));
 
killedBy: blogSubcategoryGuard should throw redirect error, given invalid category and valid subcategory
statusReason: expected '/blog/__INVALID_CATEGORY__' to be '/__INVALID_CATEGORY__' // Object.is equality

[Killed] ConditionalExpression
lib/blog/guards/blogSubcategoryGuard.ts:17:7
   // Stryker Workaround 1. Mutant will be killed with `= true` as expected, but `= false` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
   const categServedAtRoot = ROUTES_ROOTS.WEBSITE + category === ROUTES_ROOTS.BLOG + category;
-  if (!validCategory && !categServedAtRoot) redirect(buildAbsolutePathFromParts(ROUTES_ROOTS.WEBSITE, category));
+  if (true) redirect(buildAbsolutePathFromParts(ROUTES_ROOTS.WEBSITE, category));
 
   const subcategory = params[BlogTaxonomy.SUBCATEGORY];
killedBy: blogSubcategoryGuard should not throw redirect error, given valid category and subcategory
statusReason: promise rejected "Error: NEXT_REDIRECT { digest: 'NEXT…' }" instead of resolving

[Killed] ConditionalExpression
lib/blog/guards/blogSubcategoryGuard.ts:17:7
   // Stryker Workaround 1. Mutant will be killed with `= true` as expected, but `= false` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
   const categServedAtRoot = ROUTES_ROOTS.WEBSITE + category === ROUTES_ROOTS.BLOG + category;
-  if (!validCategory && !categServedAtRoot) redirect(buildAbsolutePathFromParts(ROUTES_ROOTS.WEBSITE, category));
+  if (false) redirect(buildAbsolutePathFromParts(ROUTES_ROOTS.WEBSITE, category));
 
   const subcategory = params[BlogTaxonomy.SUBCATEGORY];
killedBy: blogSubcategoryGuard should throw redirect error, given invalid category and valid subcategory
statusReason: expected '/blog/__INVALID_CATEGORY__' to be '/__INVALID_CATEGORY__' // Object.is equality

[Killed] BooleanLiteral
lib/blog/guards/blogSubcategoryGuard.ts:22:7
   const subcategory = params[BlogTaxonomy.SUBCATEGORY];
 
   const validCombination: boolean = await isValidBlogCategoryAndSubcategoryPairInAnyLanguage(category, subcategory);
-  if (!validCombination) redirectToBlogCategoryPage(category);
+  if (validCombination) redirectToBlogCategoryPage(category);
 }
 
killedBy: blogSubcategoryGuard should not throw redirect error, given valid category and subcategory
statusReason: promise rejected "Error: NEXT_REDIRECT { digest: 'NEXT…' }" instead of resolving

[Killed] ConditionalExpression
lib/blog/guards/blogSubcategoryGuard.ts:22:7
   const subcategory = params[BlogTaxonomy.SUBCATEGORY];
 
   const validCombination: boolean = await isValidBlogCategoryAndSubcategoryPairInAnyLanguage(category, subcategory);
-  if (!validCombination) redirectToBlogCategoryPage(category);
+  if (false) redirectToBlogCategoryPage(category);
 }
 
killedBy: blogSubcategoryGuard should throw redirect error, given valid category and invalid subcategory
statusReason: expected number of assertions to be 2, but got 0
