[Killed] BlockStatement
lib/blog/static/getBlogStaticParams.ts:14:37
   const blogStaticParams: BlogStaticParams[] = [];
   const blogCategories = getAllBlogCategories();
 
-  for (const language of LANGUAGES) {
-    for (const categ of blogCategories) {
-      const category = categ as BlogCategory;
-      const curSubcategs: BlogSubcategoryFromUnknownCategory[] = await getBlogSubcategoriesByCategory(category, language);
-
-      for (const subcateg of curSubcategs) {
-        const subcategory = subcateg as BlogSubcategoryFromUnknownCategory;
-
-        const relatedPosts: BlogPostType[] = await getAllBlogPostsByCategoryAndSubcategoryAndLanguageUnstrict(category, subcategory, language);
-
-        for (const post of relatedPosts) {
-          const slug = post.slug as UnknownBlogSlug;
-
-          const entity: BlogStaticParams = {
-            [BlogTaxonomy.SUBCATEGORY]: subcategory,
-            [I18nTaxonomy.LANGUAGE]: language,
-            [BlogTaxonomy.CATEGORY]: category,
-            [BlogTaxonomy.SLUG]: slug
-          };
-          blogStaticParams.push(entity);
-        }
-      }
-    }
-  }
+  for (const language of LANGUAGES) {}
 
   return blogStaticParams;
killedBy: getBlogStaticParams should return static params, excluding the 'drafts' fake language
statusReason: expected [] to strictly equal [ { …(4) }, { …(4) }, { …(4) }, …(6) ]

[Killed] BlockStatement
lib/blog/static/getBlogStaticParams.ts:15:41
   const blogCategories = getAllBlogCategories();
 
   for (const language of LANGUAGES) {
-    for (const categ of blogCategories) {
-      const category = categ as BlogCategory;
-      const curSubcategs: BlogSubcategoryFromUnknownCategory[] = await getBlogSubcategoriesByCategory(category, language);
-
-      for (const subcateg of curSubcategs) {
-        const subcategory = subcateg as BlogSubcategoryFromUnknownCategory;
-
-        const relatedPosts: BlogPostType[] = await getAllBlogPostsByCategoryAndSubcategoryAndLanguageUnstrict(category, subcategory, language);
-
-        for (const post of relatedPosts) {
-          const slug = post.slug as UnknownBlogSlug;
-
-          const entity: BlogStaticParams = {
-            [BlogTaxonomy.SUBCATEGORY]: subcategory,
-            [I18nTaxonomy.LANGUAGE]: language,
-            [BlogTaxonomy.CATEGORY]: category,
-            [BlogTaxonomy.SLUG]: slug
-          };
-          blogStaticParams.push(entity);
-        }
-      }
-    }
+    for (const categ of blogCategories) {}
   }
 
killedBy: getBlogStaticParams should return static params, excluding the 'drafts' fake language
statusReason: expected [] to strictly equal [ { …(4) }, { …(4) }, { …(4) }, …(6) ]

[Killed] BlockStatement
lib/blog/static/getBlogStaticParams.ts:19:44
       const category = categ as BlogCategory;
       const curSubcategs: BlogSubcategoryFromUnknownCategory[] = await getBlogSubcategoriesByCategory(category, language);
 
-      for (const subcateg of curSubcategs) {
-        const subcategory = subcateg as BlogSubcategoryFromUnknownCategory;
-
-        const relatedPosts: BlogPostType[] = await getAllBlogPostsByCategoryAndSubcategoryAndLanguageUnstrict(category, subcategory, language);
-
-        for (const post of relatedPosts) {
-          const slug = post.slug as UnknownBlogSlug;
-
-          const entity: BlogStaticParams = {
-            [BlogTaxonomy.SUBCATEGORY]: subcategory,
-            [I18nTaxonomy.LANGUAGE]: language,
-            [BlogTaxonomy.CATEGORY]: category,
-            [BlogTaxonomy.SLUG]: slug
-          };
-          blogStaticParams.push(entity);
-        }
-      }
+      for (const subcateg of curSubcategs) {}
     }
   }
killedBy: getBlogStaticParams should return static params, excluding the 'drafts' fake language
statusReason: expected [] to strictly equal [ { …(4) }, { …(4) }, { …(4) }, …(6) ]

[Killed] BlockStatement
lib/blog/static/getBlogStaticParams.ts:24:42
 
         const relatedPosts: BlogPostType[] = await getAllBlogPostsByCategoryAndSubcategoryAndLanguageUnstrict(category, subcategory, language);
 
-        for (const post of relatedPosts) {
-          const slug = post.slug as UnknownBlogSlug;
-
-          const entity: BlogStaticParams = {
-            [BlogTaxonomy.SUBCATEGORY]: subcategory,
-            [I18nTaxonomy.LANGUAGE]: language,
-            [BlogTaxonomy.CATEGORY]: category,
-            [BlogTaxonomy.SLUG]: slug
-          };
-          blogStaticParams.push(entity);
-        }
+        for (const post of relatedPosts) {}
       }
     }
killedBy: getBlogStaticParams should return static params, excluding the 'drafts' fake language
statusReason: expected [] to strictly equal [ { …(4) }, { …(4) }, { …(4) }, …(6) ]
