[NoCoverage] BlockStatement
src/lib/blog/staticGeneration.ts:52:89
 /* v8 ignore stop */
 
 // {ToDo} Write tests
-export async function getBlogSubcategoryMetadatas({ params }: BlogSubcategoryPageProps) {
-  const [category, subcategory, language] = [params[BlogTaxonomy.CATEGORY], params[BlogTaxonomy.SUBCATEGORY], params[I18nTaxonomy.LANGUAGE]];
-
-  if (!isValidBlogCategoryAndSubcategoryPair(category, subcategory, language)) return {};
-
-  const globalT = await getServerSideI18n();
-  const { blogCategories, vocab } = i18ns;
-  const narrowedCategoryAndSubcategoryAssoc = `${category}.${subcategory}` as BlogCategoriesAndSubcategoriesAssoc;
-  const title = buildPageTitle(globalT(`${vocab}.brand-short`), globalT(`${blogCategories}.${narrowedCategoryAndSubcategoryAssoc}.title`));
-  const description = globalT(`${blogCategories}.${narrowedCategoryAndSubcategoryAssoc}.meta-description`);
-  return { description, title };
-}
+export async function getBlogSubcategoryMetadatas({ params }: BlogSubcategoryPageProps) {}
 
 async function getXDefaultAndCanonical(

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:55:7
 export async function getBlogSubcategoryMetadatas({ params }: BlogSubcategoryPageProps) {
   const [category, subcategory, language] = [params[BlogTaxonomy.CATEGORY], params[BlogTaxonomy.SUBCATEGORY], params[I18nTaxonomy.LANGUAGE]];
 
-  if (!isValidBlogCategoryAndSubcategoryPair(category, subcategory, language)) return {};
+  if (false) return {};
 
   const globalT = await getServerSideI18n();

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:55:7
 export async function getBlogSubcategoryMetadatas({ params }: BlogSubcategoryPageProps) {
   const [category, subcategory, language] = [params[BlogTaxonomy.CATEGORY], params[BlogTaxonomy.SUBCATEGORY], params[I18nTaxonomy.LANGUAGE]];
 
-  if (!isValidBlogCategoryAndSubcategoryPair(category, subcategory, language)) return {};
+  if (true) return {};
 
   const globalT = await getServerSideI18n();

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:75:22
 ): Promise<Couple<MaybeUndefined<Href>, Href>> {
   const maybeDefaultLanguageBlogPost = await getBlogPostUnstrict(category, subcategory, slug, DEFAULT_LANGUAGE);
 
-  const defaultUrl = middlewareStrategy !== 'redirect' ? getPathnameWithoutI18nFlag(currentPost.url) : currentPost.url;
+  const defaultUrl = true ? getPathnameWithoutI18nFlag(currentPost.url) : currentPost.url;
 
   const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguageBlogPost !== null ? defaultUrl : undefined;

[NoCoverage] EqualityOperator
src/lib/blog/staticGeneration.ts:75:22
 ): Promise<Couple<MaybeUndefined<Href>, Href>> {
   const maybeDefaultLanguageBlogPost = await getBlogPostUnstrict(category, subcategory, slug, DEFAULT_LANGUAGE);
 
-  const defaultUrl = middlewareStrategy !== 'redirect' ? getPathnameWithoutI18nFlag(currentPost.url) : currentPost.url;
+  const defaultUrl = middlewareStrategy === 'redirect' ? getPathnameWithoutI18nFlag(currentPost.url) : currentPost.url;
 
   const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguageBlogPost !== null ? defaultUrl : undefined;

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:77:53
 
   const defaultUrl = middlewareStrategy !== 'redirect' ? getPathnameWithoutI18nFlag(currentPost.url) : currentPost.url;
 
-  const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguageBlogPost !== null ? defaultUrl : undefined;
+  const xDefault = language !== DEFAULT_LANGUAGE && true ? defaultUrl : undefined;
 
   const canonical = language === DEFAULT_LANGUAGE ? defaultUrl : currentPost.url;

[NoCoverage] LogicalOperator
src/lib/blog/staticGeneration.ts:77:20
 
   const defaultUrl = middlewareStrategy !== 'redirect' ? getPathnameWithoutI18nFlag(currentPost.url) : currentPost.url;
 
-  const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguageBlogPost !== null ? defaultUrl : undefined;
+  const xDefault = language !== DEFAULT_LANGUAGE || maybeDefaultLanguageBlogPost !== null ? defaultUrl : undefined;
 
   const canonical = language === DEFAULT_LANGUAGE ? defaultUrl : currentPost.url;

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:79:21
 
   const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguageBlogPost !== null ? defaultUrl : undefined;
 
-  const canonical = language === DEFAULT_LANGUAGE ? defaultUrl : currentPost.url;
+  const canonical = true ? defaultUrl : currentPost.url;
   return [xDefault, canonical];
 }

[NoCoverage] EqualityOperator
src/lib/blog/staticGeneration.ts:79:21
 
   const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguageBlogPost !== null ? defaultUrl : undefined;
 
-  const canonical = language === DEFAULT_LANGUAGE ? defaultUrl : currentPost.url;
+  const canonical = language !== DEFAULT_LANGUAGE ? defaultUrl : currentPost.url;
   return [xDefault, canonical];
 }

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:98:7
   const globalT = await getServerSideI18n();
 
   const post: MaybeNull<BlogPostType> = await getBlogPostUnstrict(category, subcategory, slug, language);
-  if (post === null || !isValidBlogCategoryAndSubcategoryPair(category, subcategory, language)) return {};
+  if (false) return {};
 
   const currentPost = post as BlogPostType;

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:98:7
   const globalT = await getServerSideI18n();
 
   const post: MaybeNull<BlogPostType> = await getBlogPostUnstrict(category, subcategory, slug, language);
-  if (post === null || !isValidBlogCategoryAndSubcategoryPair(category, subcategory, language)) return {};
+  if (false || !isValidBlogCategoryAndSubcategoryPair(category, subcategory, language)) return {};
 
   const currentPost = post as BlogPostType;

[NoCoverage] EqualityOperator
src/lib/blog/staticGeneration.ts:107:62
   const title = buildPageTitle(globalT(`${i18ns.vocab}.brand-short`), currentPost.title);
   const { metadescription: description, seo } = currentPost;
 
-  const maybeAlternateLanguages = LANGUAGES.filter((lang) => lang !== language);
+  const maybeAlternateLanguages = LANGUAGES.filter((lang) => lang === language);
   const languages = {} as Record<LanguageFlag | 'x-default', Href>;
   const featuredPictureUrl = currentPost.featuredPictureUrl;

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:107:62
   const title = buildPageTitle(globalT(`${i18ns.vocab}.brand-short`), currentPost.title);
   const { metadescription: description, seo } = currentPost;
 
-  const maybeAlternateLanguages = LANGUAGES.filter((lang) => lang !== language);
+  const maybeAlternateLanguages = LANGUAGES.filter((lang) => false);
   const languages = {} as Record<LanguageFlag | 'x-default', Href>;
   const featuredPictureUrl = currentPost.featuredPictureUrl;

[NoCoverage] BlockStatement
src/lib/blog/staticGeneration.ts:111:65
   const languages = {} as Record<LanguageFlag | 'x-default', Href>;
   const featuredPictureUrl = currentPost.featuredPictureUrl;
 
-  for (const maybeAlternateLanguage of maybeAlternateLanguages) {
-    const maybePost = await getBlogPostUnstrict(category, subcategory, slug, maybeAlternateLanguage);
-    if (maybePost === null) continue;
-    languages[maybeAlternateLanguage] = maybePost.url;
-  }
+  for (const maybeAlternateLanguage of maybeAlternateLanguages) {}
 
   const [xDefault, canonical] = await getXDefaultAndCanonical(currentPost, category, subcategory, slug, language, middlewareStrategy);

[NoCoverage] ObjectLiteral
src/lib/blog/staticGeneration.ts:123:24
   const openGraphImages = featuredPictureUrl ? { url: featuredPictureUrl } : undefined;
 
   if (seo === undefined) {
-    const alternates = { canonical, languages };
+    const alternates = {};
     const openGraph: OpenGraph = { publishedTime, tags, type, url };
     if (openGraphImages === undefined) return { metadataBase, description, alternates, openGraph, title };

[NoCoverage] ObjectLiteral
src/lib/blog/staticGeneration.ts:124:34
 
   if (seo === undefined) {
     const alternates = { canonical, languages };
-    const openGraph: OpenGraph = { publishedTime, tags, type, url };
+    const openGraph: OpenGraph = {};
     if (openGraphImages === undefined) return { metadataBase, description, alternates, openGraph, title };
     openGraph.images = openGraphImages;

[NoCoverage] EqualityOperator
src/lib/blog/staticGeneration.ts:125:9
   if (seo === undefined) {
     const alternates = { canonical, languages };
     const openGraph: OpenGraph = { publishedTime, tags, type, url };
-    if (openGraphImages === undefined) return { metadataBase, description, alternates, openGraph, title };
+    if (openGraphImages !== undefined) return { metadataBase, description, alternates, openGraph, title };
     openGraph.images = openGraphImages;
     return { metadataBase, description, alternates, openGraph, title };

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:125:9
   if (seo === undefined) {
     const alternates = { canonical, languages };
     const openGraph: OpenGraph = { publishedTime, tags, type, url };
-    if (openGraphImages === undefined) return { metadataBase, description, alternates, openGraph, title };
+    if (false) return { metadataBase, description, alternates, openGraph, title };
     openGraph.images = openGraphImages;
     return { metadataBase, description, alternates, openGraph, title };

[NoCoverage] BlockStatement
src/lib/blog/staticGeneration.ts:133:24
   const { alternates, robots } = seo;
   let openGraph: OpenGraph = { publishedTime, type, tags, ...seo.openGraph };
 
-  if (openGraphImages) {
-    if (openGraph === undefined) openGraph = { images: [openGraphImages] };
-    else if (openGraph.images === undefined) openGraph.images = [openGraphImages];
-  }
+  if (openGraphImages) {}
 
   if (openGraph === undefined) openGraph = {};

[NoCoverage] ObjectLiteral
src/lib/blog/staticGeneration.ts:134:46
   let openGraph: OpenGraph = { publishedTime, type, tags, ...seo.openGraph };
 
   if (openGraphImages) {
-    if (openGraph === undefined) openGraph = { images: [openGraphImages] };
+    if (openGraph === undefined) openGraph = {};
     else if (openGraph.images === undefined) openGraph.images = [openGraphImages];
   }

[NoCoverage] EqualityOperator
src/lib/blog/staticGeneration.ts:135:14
 
   if (openGraphImages) {
     if (openGraph === undefined) openGraph = { images: [openGraphImages] };
-    else if (openGraph.images === undefined) openGraph.images = [openGraphImages];
+    else if (openGraph.images !== undefined) openGraph.images = [openGraphImages];
   }
 

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:135:14
 
   if (openGraphImages) {
     if (openGraph === undefined) openGraph = { images: [openGraphImages] };
-    else if (openGraph.images === undefined) openGraph.images = [openGraphImages];
+    else if (true) openGraph.images = [openGraphImages];
   }
 

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:138:7
     else if (openGraph.images === undefined) openGraph.images = [openGraphImages];
   }
 
-  if (openGraph === undefined) openGraph = {};
+  if (true) openGraph = {};
   (openGraph as OpenGraph).url = url;
   if (alternates) (alternates as AlternateURLs).languages = languages;

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:138:7
     else if (openGraph.images === undefined) openGraph.images = [openGraphImages];
   }
 
-  if (openGraph === undefined) openGraph = {};
+  if (false) openGraph = {};
   (openGraph as OpenGraph).url = url;
   if (alternates) (alternates as AlternateURLs).languages = languages;

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:140:7
 
   if (openGraph === undefined) openGraph = {};
   (openGraph as OpenGraph).url = url;
-  if (alternates) (alternates as AlternateURLs).languages = languages;
+  if (true) (alternates as AlternateURLs).languages = languages;
   if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;
 

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:140:7
 
   if (openGraph === undefined) openGraph = {};
   (openGraph as OpenGraph).url = url;
-  if (alternates) (alternates as AlternateURLs).languages = languages;
+  if (false) (alternates as AlternateURLs).languages = languages;
   if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;
 

[NoCoverage] BooleanLiteral
src/lib/blog/staticGeneration.ts:141:21
   if (openGraph === undefined) openGraph = {};
   (openGraph as OpenGraph).url = url;
   if (alternates) (alternates as AlternateURLs).languages = languages;
-  if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;
+  if (alternates && alternates.canonical) (alternates as AlternateURLs).canonical = canonical;
 
   return {

[NoCoverage] ConditionalExpression
src/lib/blog/staticGeneration.ts:141:7
   if (openGraph === undefined) openGraph = {};
   (openGraph as OpenGraph).url = url;
   if (alternates) (alternates as AlternateURLs).languages = languages;
-  if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;
+  if (false) (alternates as AlternateURLs).canonical = canonical;
 
   return {

[NoCoverage] ObjectLiteral
src/lib/blog/staticGeneration.ts:143:10
   if (alternates) (alternates as AlternateURLs).languages = languages;
   if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;
 
-  return {
-    metadataBase,
-    description,
-    alternates,
-    openGraph,
-    robots,
-    title
-  };
+  return {};
 }
 
