[Killed] UnaryOperator
src/lib/i18n.ts:13:73
 
 function computePathnameI18nFlagUnstrict(pathname: AppPath, providedEndIndex?: Index): string {
   // eslint-disable-next-line no-magic-numbers
-  const compute = (pathname: AppPath, endIndex: Index) => (endIndex === -1 ? pathname.substring(1) : pathname.substring(1, endIndex));
+  const compute = (pathname: AppPath, endIndex: Index) => (endIndex === +1 ? pathname.substring(1) : pathname.substring(1, endIndex));
 
   if (providedEndIndex !== undefined) return compute(pathname, providedEndIndex);
killedBy: hrefAndPathnameExactMatch should return true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/i18n.ts:13:60
 
 function computePathnameI18nFlagUnstrict(pathname: AppPath, providedEndIndex?: Index): string {
   // eslint-disable-next-line no-magic-numbers
-  const compute = (pathname: AppPath, endIndex: Index) => (endIndex === -1 ? pathname.substring(1) : pathname.substring(1, endIndex));
+  const compute = (pathname: AppPath, endIndex: Index) => (true ? pathname.substring(1) : pathname.substring(1, endIndex));
 
   if (providedEndIndex !== undefined) return compute(pathname, providedEndIndex);
killedBy: getPathnameMaybeI18nFlag should return null or a flag, given a pathname without i18n flag and a pathname with an i18n flag
statusReason: expected null to be 'fr' // Object.is equality

[Killed] StringLiteral
src/lib/i18n.ts:18:51
   if (providedEndIndex !== undefined) return compute(pathname, providedEndIndex);
 
   // eslint-disable-next-line no-magic-numbers
-  const endIndex = indexOfNthOccurrence(pathname, '/', 2);
+  const endIndex = indexOfNthOccurrence(pathname, "", 2);
   return compute(pathname, endIndex);
 }
killedBy: getPathnameMaybeI18nFlag should return null or a flag, given a pathname without i18n flag and a pathname with an i18n flag
statusReason: expected null to be 'fr' // Object.is equality

[Killed] StringLiteral
src/lib/i18n.ts:24:59
 
 export function getPathnameWithoutI18nFlag(pathname: AppPath): AppPathAsIs | AppPath {
   // eslint-disable-next-line no-magic-numbers
-  const secondSlashIndex = indexOfNthOccurrence(pathname, '/', 2);
+  const secondSlashIndex = indexOfNthOccurrence(pathname, "", 2);
 
   const pathnameI18nFlag = computePathnameI18nFlagUnstrict(pathname, secondSlashIndex);
killedBy: hrefMatchesPathname should return true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/i18n.ts:27:7
   const secondSlashIndex = indexOfNthOccurrence(pathname, '/', 2);
 
   const pathnameI18nFlag = computePathnameI18nFlagUnstrict(pathname, secondSlashIndex);
-  if (!isValidLanguageFlag(pathnameI18nFlag)) return pathname;
+  if (true) return pathname;
 
   // eslint-disable-next-line no-magic-numbers
killedBy: hrefMatchesPathname should return true
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/i18n.ts:27:7
   const secondSlashIndex = indexOfNthOccurrence(pathname, '/', 2);
 
   const pathnameI18nFlag = computePathnameI18nFlagUnstrict(pathname, secondSlashIndex);
-  if (!isValidLanguageFlag(pathnameI18nFlag)) return pathname;
+  if (isValidLanguageFlag(pathnameI18nFlag)) return pathname;
 
   // eslint-disable-next-line no-magic-numbers
killedBy: getPathnameWithoutI18nFlag should return the same path or the path without its i18n flag, given a pathname without i18n flag and a pathname with an i18n flag
statusReason: expected '/' to be '/afr' // Object.is equality

[Killed] EqualityOperator
src/lib/i18n.ts:30:31
   if (!isValidLanguageFlag(pathnameI18nFlag)) return pathname;
 
   // eslint-disable-next-line no-magic-numbers
-  const pathnameWithouti18n = secondSlashIndex === -1 ? ROUTES_ROOTS.WEBSITE : pathname.substring(secondSlashIndex);
+  const pathnameWithouti18n = secondSlashIndex !== -1 ? ROUTES_ROOTS.WEBSITE : pathname.substring(secondSlashIndex);
   return pathnameWithouti18n;
 }
killedBy: hrefMatchesPathname should return true
statusReason: expected false to be true // Object.is equality

[Killed] UnaryOperator
src/lib/i18n.ts:30:52
   if (!isValidLanguageFlag(pathnameI18nFlag)) return pathname;
 
   // eslint-disable-next-line no-magic-numbers
-  const pathnameWithouti18n = secondSlashIndex === -1 ? ROUTES_ROOTS.WEBSITE : pathname.substring(secondSlashIndex);
+  const pathnameWithouti18n = secondSlashIndex === +1 ? ROUTES_ROOTS.WEBSITE : pathname.substring(secondSlashIndex);
   return pathnameWithouti18n;
 }
killedBy: getPathnameWithoutI18nFlag should return the same path or the path without its i18n flag, given a pathname without i18n flag and a pathname with an i18n flag
statusReason: expected '/fr' to be '/' // Object.is equality
