[Killed] ConditionalExpression
src/lib/landingPages/api.ts:16:80
 export function getLandingPageByLanguageAndSlugUnstrict(language: LanguageFlag, slug: UnknownLandingPageSlug): MaybeNull<LandingPage> {
   const allLandingPages = getAllLandingPages();
   const matchingLandingPage =
-    allLandingPages.find(({ language: currentLanguage, slug: currentSlug }) => currentSlug === slug && currentLanguage === language) ?? null;
+    allLandingPages.find(({ language: currentLanguage, slug: currentSlug }) => true) ?? null;
 
   // Stryker Workaround 1. Mutant will be killed with `&& false` as expected, but `&& true` mutant is pointless.
killedBy: getLandingPagesStaticParams should return static params, including the mocked drafts
statusReason: expected [ { …(2) }, { …(2) }, { …(2) }, …(3) ] to strictly equal [ { …(2) }, { …(2) }, { …(2) }, …(3) ]

[Killed] ConditionalExpression
src/lib/landingPages/api.ts:16:80
 export function getLandingPageByLanguageAndSlugUnstrict(language: LanguageFlag, slug: UnknownLandingPageSlug): MaybeNull<LandingPage> {
   const allLandingPages = getAllLandingPages();
   const matchingLandingPage =
-    allLandingPages.find(({ language: currentLanguage, slug: currentSlug }) => currentSlug === slug && currentLanguage === language) ?? null;
+    allLandingPages.find(({ language: currentLanguage, slug: currentSlug }) => true && currentLanguage === language) ?? null;
 
   // Stryker Workaround 1. Mutant will be killed with `&& false` as expected, but `&& true` mutant is pointless.
killedBy: getLandingPagesStaticParams should return static params, including the mocked drafts
statusReason: expected [] to strictly equal [ { …(2) }, { …(2) } ]

[Killed] LogicalOperator
src/lib/landingPages/api.ts:20:7
 
   // Stryker Workaround 1. Mutant will be killed with `&& false` as expected, but `&& true` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
-  if (!ComputedLandingPagesCtx.TESTING && matchingLandingPage?.category === LandingPagesConfig.TESTING_CATEGORY) return null;
+  if (!ComputedLandingPagesCtx.TESTING || matchingLandingPage?.category === LandingPagesConfig.TESTING_CATEGORY) return null;
   if (matchingLandingPage && !ComputedLandingPagesCtx.ALLOWED_DRAFTS && matchingLandingPage.draft) return null;
   return matchingLandingPage;
killedBy: getLandingPageByLanguageAndSlugStrict (happy paths) should return a valid lp
statusReason: Cannot read properties of null (reading 'category')

[Killed] EqualityOperator
src/lib/landingPages/api.ts:20:43
 
   // Stryker Workaround 1. Mutant will be killed with `&& false` as expected, but `&& true` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
-  if (!ComputedLandingPagesCtx.TESTING && matchingLandingPage?.category === LandingPagesConfig.TESTING_CATEGORY) return null;
+  if (!ComputedLandingPagesCtx.TESTING && matchingLandingPage?.category !== LandingPagesConfig.TESTING_CATEGORY) return null;
   if (matchingLandingPage && !ComputedLandingPagesCtx.ALLOWED_DRAFTS && matchingLandingPage.draft) return null;
   return matchingLandingPage;
killedBy: getLandingPageByLanguageAndSlugStrict (unhappy paths) should return null, given testing category in not testing ctx
statusReason: expected { metadescription: 'FAKE', …(10) } to be null // Object.is equality

[Killed] BooleanLiteral
src/lib/landingPages/api.ts:21:30
   // Stryker Workaround 1. Mutant will be killed with `&& false` as expected, but `&& true` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
   if (!ComputedLandingPagesCtx.TESTING && matchingLandingPage?.category === LandingPagesConfig.TESTING_CATEGORY) return null;
-  if (matchingLandingPage && !ComputedLandingPagesCtx.ALLOWED_DRAFTS && matchingLandingPage.draft) return null;
+  if (matchingLandingPage && ComputedLandingPagesCtx.ALLOWED_DRAFTS && matchingLandingPage.draft) return null;
   return matchingLandingPage;
 }
killedBy: getLandingPageByLanguageAndSlugStrict (unhappy paths) should return NULL when picking a draft lp in an unauthorized drafts CTX
statusReason: expected { metadescription: 'FAKE', …(10) } to be null // Object.is equality

[Killed] ConditionalExpression
src/lib/landingPages/api.ts:21:7
   // Stryker Workaround 1. Mutant will be killed with `&& false` as expected, but `&& true` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
   if (!ComputedLandingPagesCtx.TESTING && matchingLandingPage?.category === LandingPagesConfig.TESTING_CATEGORY) return null;
-  if (matchingLandingPage && !ComputedLandingPagesCtx.ALLOWED_DRAFTS && matchingLandingPage.draft) return null;
+  if (true) return null;
   return matchingLandingPage;
 }
killedBy: getLandingPageByLanguageAndSlugStrict (happy paths) should return a valid lp
statusReason: Cannot read properties of null (reading 'category')
