[Killed] BlockStatement
lib/landingPages/static/getLandingPagesStaticParams.ts:7:40
 
 import { getLandingPageByLanguageAndSlugUnstrict, getAllLandingPages } from '../api';
 
-function getLandingPagesStaticParams() {
-  const staticParams = [];
-  const allLandingPages = getAllLandingPages();
-
-  for (const { language, slug } of allLandingPages) {
-    if (!isValidLanguageFlag(language)) continue;
-
-    const matchedLp = getLandingPageByLanguageAndSlugUnstrict(language, slug);
-    if (!matchedLp) continue;
-
-    staticParams.push({ [I18nTaxonomy.LANGUAGE]: matchedLp.language, [LandingPageTaxonomy.SLUG]: matchedLp.slug });
-  }
-
-  return staticParams;
-}
+function getLandingPagesStaticParams() {}
 
 export default getLandingPagesStaticParams;
killedBy: getLandingPagesStaticParams should return static params, including the mocked drafts
statusReason: expected undefined to strictly equal [ { …(2) }, { …(2) } ]
