[NoCoverage] ConditionalExpression
src/lib/landingPages/staticGeneration.ts:39:22
 ): Couple<MaybeUndefined<Href>, Href> {
   const maybeDefaultLanguageLp = getLandingPageByLanguageAndSlugUnstrict(language, slug);
 
-  const defaultUrl = middlewareStrategy !== 'redirect' ? getPathnameWithoutI18nFlag(currentLp.url) : currentLp.url;
+  const defaultUrl = false ? getPathnameWithoutI18nFlag(currentLp.url) : currentLp.url;
 
   const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguageLp !== null ? defaultUrl : undefined;

[NoCoverage] EqualityOperator
src/lib/landingPages/staticGeneration.ts:39:22
 ): Couple<MaybeUndefined<Href>, Href> {
   const maybeDefaultLanguageLp = getLandingPageByLanguageAndSlugUnstrict(language, slug);
 
-  const defaultUrl = middlewareStrategy !== 'redirect' ? getPathnameWithoutI18nFlag(currentLp.url) : currentLp.url;
+  const defaultUrl = middlewareStrategy === 'redirect' ? getPathnameWithoutI18nFlag(currentLp.url) : currentLp.url;
 
   const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguageLp !== null ? defaultUrl : undefined;

[NoCoverage] EqualityOperator
src/lib/landingPages/staticGeneration.ts:41:53
 
   const defaultUrl = middlewareStrategy !== 'redirect' ? getPathnameWithoutI18nFlag(currentLp.url) : currentLp.url;
 
-  const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguageLp !== null ? defaultUrl : undefined;
+  const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguageLp === null ? defaultUrl : undefined;
 
   const canonical = language === DEFAULT_LANGUAGE ? defaultUrl : currentLp.url;

[NoCoverage] ConditionalExpression
src/lib/landingPages/staticGeneration.ts:41:20
 
   const defaultUrl = middlewareStrategy !== 'redirect' ? getPathnameWithoutI18nFlag(currentLp.url) : currentLp.url;
 
-  const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguageLp !== null ? defaultUrl : undefined;
+  const xDefault = true ? defaultUrl : undefined;
 
   const canonical = language === DEFAULT_LANGUAGE ? defaultUrl : currentLp.url;

[NoCoverage] ConditionalExpression
src/lib/landingPages/staticGeneration.ts:43:21
 
   const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguageLp !== null ? defaultUrl : undefined;
 
-  const canonical = language === DEFAULT_LANGUAGE ? defaultUrl : currentLp.url;
+  const canonical = true ? defaultUrl : currentLp.url;
   return [xDefault, canonical];
 }

[NoCoverage] EqualityOperator
src/lib/landingPages/staticGeneration.ts:43:21
 
   const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguageLp !== null ? defaultUrl : undefined;
 
-  const canonical = language === DEFAULT_LANGUAGE ? defaultUrl : currentLp.url;
+  const canonical = language !== DEFAULT_LANGUAGE ? defaultUrl : currentLp.url;
   return [xDefault, canonical];
 }

[NoCoverage] ConditionalExpression
src/lib/landingPages/staticGeneration.ts:62:62
   const { vocab } = i18ns;
   const title = buildPageTitle(globalT(`${vocab}.brand-short`), lpTitle);
 
-  const maybeAlternateLanguages = LANGUAGES.filter((lang) => lang !== language);
+  const maybeAlternateLanguages = LANGUAGES.filter((lang) => true);
   const languages = {} as Record<LanguageFlag | 'x-default', Href>;
 

[NoCoverage] BlockStatement
src/lib/landingPages/staticGeneration.ts:65:65
   const maybeAlternateLanguages = LANGUAGES.filter((lang) => lang !== language);
   const languages = {} as Record<LanguageFlag | 'x-default', Href>;
 
-  for (const maybeAlternateLanguage of maybeAlternateLanguages) {
-    const maybeLp = getLandingPageByLanguageAndSlugUnstrict(maybeAlternateLanguage, slug);
-    if (maybeLp === null) continue;
-    languages[maybeAlternateLanguage] = maybeLp.url;
-  }
+  for (const maybeAlternateLanguage of maybeAlternateLanguages) {}
 
   const [xDefault, canonical] = getXDefaultAndCanonical(currentLp, slug, language, middlewareStrategy);

[NoCoverage] ObjectLiteral
src/lib/landingPages/staticGeneration.ts:74:39
   const [xDefault, canonical] = getXDefaultAndCanonical(currentLp, slug, language, middlewareStrategy);
   if (xDefault !== undefined) languages['x-default'] = xDefault;
 
-  const defaultOpenGraph: OpenGraph = { url };
+  const defaultOpenGraph: OpenGraph = {};
   if (seo === undefined) return { alternates: { canonical, languages }, openGraph: defaultOpenGraph, metadataBase, description, title };
 

[NoCoverage] ConditionalExpression
src/lib/landingPages/staticGeneration.ts:79:7
 
   const { openGraph = defaultOpenGraph, alternates, robots } = seo;
 
-  if ((openGraph as OpenGraph).url === undefined) (openGraph as OpenGraph).url = url;
+  if (true) (openGraph as OpenGraph).url = url;
   if (alternates) (alternates as AlternateURLs).languages = languages;
   if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;

[NoCoverage] EqualityOperator
src/lib/landingPages/staticGeneration.ts:79:7
 
   const { openGraph = defaultOpenGraph, alternates, robots } = seo;
 
-  if ((openGraph as OpenGraph).url === undefined) (openGraph as OpenGraph).url = url;
+  if ((openGraph as OpenGraph).url !== undefined) (openGraph as OpenGraph).url = url;
   if (alternates) (alternates as AlternateURLs).languages = languages;
   if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;

[NoCoverage] ConditionalExpression
src/lib/landingPages/staticGeneration.ts:80:7
   const { openGraph = defaultOpenGraph, alternates, robots } = seo;
 
   if ((openGraph as OpenGraph).url === undefined) (openGraph as OpenGraph).url = url;
-  if (alternates) (alternates as AlternateURLs).languages = languages;
+  if (true) (alternates as AlternateURLs).languages = languages;
   if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;
 

[NoCoverage] ConditionalExpression
src/lib/landingPages/staticGeneration.ts:80:7
   const { openGraph = defaultOpenGraph, alternates, robots } = seo;
 
   if ((openGraph as OpenGraph).url === undefined) (openGraph as OpenGraph).url = url;
-  if (alternates) (alternates as AlternateURLs).languages = languages;
+  if (false) (alternates as AlternateURLs).languages = languages;
   if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;
 

[NoCoverage] ConditionalExpression
src/lib/landingPages/staticGeneration.ts:81:7
 
   if ((openGraph as OpenGraph).url === undefined) (openGraph as OpenGraph).url = url;
   if (alternates) (alternates as AlternateURLs).languages = languages;
-  if (alternates && !alternates.canonical) (alternates as AlternateURLs).canonical = canonical;
+  if (true) (alternates as AlternateURLs).canonical = canonical;
 
   return { metadataBase, description, alternates, openGraph, robots, title };
