[Killed] ConditionalExpression
src/lib/misc/getPathParts.ts:8:7
 function getPathParts(pathname: AppPath) {
   let pathnameWithoutI18nFlag = getPathnameWithoutI18nFlag(pathname);
   // eslint-disable-next-line no-magic-numbers
-  if (pathnameWithoutI18nFlag.charAt(0) === '/') pathnameWithoutI18nFlag = pathnameWithoutI18nFlag.substring(1);
+  if (true) pathnameWithoutI18nFlag = pathnameWithoutI18nFlag.substring(1);
 
   return pathnameWithoutI18nFlag.split('/');
killedBy: getPathParts should return path parts, given path without i18n flag, not starting with '/'
statusReason: expected [ 'absolutely_not_lang', 'foo', 'bar' ] to strictly equal [ Array(3) ]

[Killed] MethodExpression
src/lib/misc/getPathParts.ts:8:7
 function getPathParts(pathname: AppPath) {
   let pathnameWithoutI18nFlag = getPathnameWithoutI18nFlag(pathname);
   // eslint-disable-next-line no-magic-numbers
-  if (pathnameWithoutI18nFlag.charAt(0) === '/') pathnameWithoutI18nFlag = pathnameWithoutI18nFlag.substring(1);
+  if (pathnameWithoutI18nFlag === '/') pathnameWithoutI18nFlag = pathnameWithoutI18nFlag.substring(1);
 
   return pathnameWithoutI18nFlag.split('/');
killedBy: getPathParts should return path parts, given path without i18n flag
statusReason: expected [ '', '_absolutely_not_lang', …(2) ] to strictly equal [ Array(3) ]
