[Killed] ArrowFunction
src/lib/misc/isProtectedRoute.ts:9:53
 
 function isProtectedRoute(pathname: AppPath) {
   const currentRoute = getPathnameWithoutI18nFlag(pathname);
-  const isProtectedRoute = APP_PROTECTED_PATHS.find((r) => currentRoute.startsWith(r));
+  const isProtectedRoute = APP_PROTECTED_PATHS.find(() => undefined);
   return Boolean(isProtectedRoute);
 }
killedBy: isProtectedRoute should return true, given simple valid input
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/misc/isProtectedRoute.ts:9:60
 
 function isProtectedRoute(pathname: AppPath) {
   const currentRoute = getPathnameWithoutI18nFlag(pathname);
-  const isProtectedRoute = APP_PROTECTED_PATHS.find((r) => currentRoute.startsWith(r));
+  const isProtectedRoute = APP_PROTECTED_PATHS.find((r) => currentRoute.endsWith(r));
   return Boolean(isProtectedRoute);
 }
killedBy: isProtectedRoute should return true, given valid prefixed input
statusReason: expected false to be true // Object.is equality
