[Killed] ConditionalExpression
src/lib/next.ts:35:7
 // eslint-disable-next-line no-magic-numbers
 export function stackMiddlewares(functions: MiddlewareFactory[] = [], index = 0): NextMiddleware {
   const currentMiddleware = functions[index];
-  if (currentMiddleware) {
+  if (false) {
     // eslint-disable-next-line no-magic-numbers
     const nextMiddleware = stackMiddlewares(functions, index + 1);
killedBy: stackMiddlewares calls each middleware with the correct arguments
statusReason: expected "spy" to be called at least once

[Timeout] ConditionalExpression
src/lib/next.ts:35:7
 // eslint-disable-next-line no-magic-numbers
 export function stackMiddlewares(functions: MiddlewareFactory[] = [], index = 0): NextMiddleware {
   const currentMiddleware = functions[index];
-  if (currentMiddleware) {
+  if (true) {
     // eslint-disable-next-line no-magic-numbers
     const nextMiddleware = stackMiddlewares(functions, index + 1);

[Killed] ArithmeticOperator
src/lib/next.ts:37:56
   const currentMiddleware = functions[index];
   if (currentMiddleware) {
     // eslint-disable-next-line no-magic-numbers
-    const nextMiddleware = stackMiddlewares(functions, index + 1);
+    const nextMiddleware = stackMiddlewares(functions, index - 1);
     return currentMiddleware(nextMiddleware);
   }
killedBy: stackMiddlewares calls each middleware with the correct arguments
statusReason: expected "spy" to be called at least once

[Killed] ArrowFunction
src/lib/next.ts:40:10
     const nextMiddleware = stackMiddlewares(functions, index + 1);
     return currentMiddleware(nextMiddleware);
   }
-  return () => NextResponse.next();
+  return () => undefined;
 }
 
killedBy: stackMiddlewares returns the final response correctly
statusReason: expected undefined to be an instance of NextResponse
