[Killed] ConditionalExpression
src/lib/pages/api.ts:15:97
 export function getPageByLanguageAndPathUnstrict(language: LanguageFlag, path: UnknownPagePath): MaybeNull<Page> {
   const allPages = getAllPages();
   const matchingPage =
-    allPages.find(({ language: currentLanguage, path: currentPath }) => currentPath === path && currentLanguage === language) ?? null;
+    allPages.find(({ language: currentLanguage, path: currentPath }) => currentPath === path && true) ?? null;
 
   // Stryker Workaround 1. Mutant will be killed with `&& false` as expected, but `&& true` mutant is pointless.
killedBy: getPageByLanguageAndPathStrict (unhappy paths) should return null, given invalid language
statusReason: expected { metadescription: 'FAKE', …(10) } to be null // Object.is equality

[Killed] EqualityOperator
src/lib/pages/api.ts:15:73
 export function getPageByLanguageAndPathUnstrict(language: LanguageFlag, path: UnknownPagePath): MaybeNull<Page> {
   const allPages = getAllPages();
   const matchingPage =
-    allPages.find(({ language: currentLanguage, path: currentPath }) => currentPath === path && currentLanguage === language) ?? null;
+    allPages.find(({ language: currentLanguage, path: currentPath }) => currentPath !== path && currentLanguage === language) ?? null;
 
   // Stryker Workaround 1. Mutant will be killed with `&& false` as expected, but `&& true` mutant is pointless.
killedBy: getPageByLanguageAndPathStrict (happy paths) should return a valid page
statusReason: expected 'index' to be 'testing-pages-root/fake-page-00' // Object.is equality

[Killed] EqualityOperator
src/lib/pages/api.ts:19:36
 
   // Stryker Workaround 1. Mutant will be killed with `&& false` as expected, but `&& true` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
-  if (!ComputedPagesCtx.TESTING && matchingPage?.root === PagesConfig.TESTING_ROOT) return null;
+  if (!ComputedPagesCtx.TESTING && matchingPage?.root !== PagesConfig.TESTING_ROOT) return null;
   if (matchingPage && !ComputedPagesCtx.ALLOWED_DRAFTS && matchingPage.draft) return null;
   return matchingPage;
killedBy: getPageByLanguageAndPathStrict (unhappy paths) should return null, given testing path in not testing ctx
statusReason: expected { metadescription: 'FAKE', …(10) } to be null // Object.is equality

[Killed] BooleanLiteral
src/lib/pages/api.ts:19:7
 
   // Stryker Workaround 1. Mutant will be killed with `&& false` as expected, but `&& true` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
-  if (!ComputedPagesCtx.TESTING && matchingPage?.root === PagesConfig.TESTING_ROOT) return null;
+  if (ComputedPagesCtx.TESTING && matchingPage?.root === PagesConfig.TESTING_ROOT) return null;
   if (matchingPage && !ComputedPagesCtx.ALLOWED_DRAFTS && matchingPage.draft) return null;
   return matchingPage;
killedBy: getPageByLanguageAndPathStrict (happy paths) should return a valid page
statusReason: Cannot read properties of null (reading 'path')

[Killed] ConditionalExpression
src/lib/pages/api.ts:20:7
   // Stryker Workaround 1. Mutant will be killed with `&& false` as expected, but `&& true` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
   if (!ComputedPagesCtx.TESTING && matchingPage?.root === PagesConfig.TESTING_ROOT) return null;
-  if (matchingPage && !ComputedPagesCtx.ALLOWED_DRAFTS && matchingPage.draft) return null;
+  if (true) return null;
   return matchingPage;
 }
killedBy: getPageByLanguageAndPathStrict (happy paths) should return a valid page
statusReason: Cannot read properties of null (reading 'path')

[Killed] ConditionalExpression
src/lib/pages/api.ts:20:7
   // Stryker Workaround 1. Mutant will be killed with `&& false` as expected, but `&& true` mutant is pointless.
   // Stryker disable next-line ConditionalExpression
   if (!ComputedPagesCtx.TESTING && matchingPage?.root === PagesConfig.TESTING_ROOT) return null;
-  if (matchingPage && !ComputedPagesCtx.ALLOWED_DRAFTS && matchingPage.draft) return null;
+  if (false) return null;
   return matchingPage;
 }
killedBy: getPageByLanguageAndPathStrict (unhappy paths) should return NULL when picking a draft page in an unauthorized drafts CTX
statusReason: expected { metadescription: 'FAKE', …(10) } to be null // Object.is equality
