[Killed] BlockStatement
lib/pages/static/getPageStaticParams.ts:8:32
 import { getPageByLanguageAndPathUnstrict, getAllPages } from '../api';
 import isSkippedPath from './helpers/isSkippedPath';
 
-function getPageStaticParams() {
-  const staticParams = [];
-  const allPages = getAllPages();
-
-  for (const { language, path } of allPages) {
-    if (!isValidLanguageFlag(language)) continue;
-    if (isSkippedPath(path)) continue;
-
-    const page = getPageByLanguageAndPathUnstrict(language, path);
-    if (!page) continue;
-
-    staticParams.push({ [PageTaxonomy.PATH]: page.path.split('/'), [I18nTaxonomy.LANGUAGE]: page.language });
-  }
-
-  return staticParams;
-}
+function getPageStaticParams() {}
 
 export default getPageStaticParams;
killedBy: getPageStaticParams should return static params according to the allPages mock
statusReason: expected undefined to strictly equal [ Array(11) ]

[Killed] ConditionalExpression
lib/pages/static/getPageStaticParams.ts:14:9
 
   for (const { language, path } of allPages) {
     if (!isValidLanguageFlag(language)) continue;
-    if (isSkippedPath(path)) continue;
+    if (false) continue;
 
     const page = getPageByLanguageAndPathUnstrict(language, path);
killedBy: getPageStaticParams should return static params according to the allPages mock
statusReason: expected [ { path: [ 'page-00' ], …(1) }, …(2) ] to strictly equal [ { …(2) } ]

[Killed] StringLiteral
lib/pages/static/getPageStaticParams.ts:19:62
     const page = getPageByLanguageAndPathUnstrict(language, path);
     if (!page) continue;
 
-    staticParams.push({ [PageTaxonomy.PATH]: page.path.split('/'), [I18nTaxonomy.LANGUAGE]: page.language });
+    staticParams.push({ [PageTaxonomy.PATH]: page.path.split(""), [I18nTaxonomy.LANGUAGE]: page.language });
   }
 
killedBy: getPageStaticParams should return static params according to the allPages mock
statusReason: expected [ { …(2) } ] to strictly equal [ { …(2) } ]
