[Killed] ArrowFunction
pages/static/helpers/isSkippedPath.ts:4:102
 import PagesConfig from '@/config/pages';
 
 const isSkippedPath = (path: string) =>
-  PagesConfig.SKIP_AUTOMOUNT.paths.includes(path as any) || PagesConfig.SKIP_AUTOMOUNT.prefixes.some((p) => path.startsWith(p));
+  PagesConfig.SKIP_AUTOMOUNT.paths.includes(path as any) || PagesConfig.SKIP_AUTOMOUNT.prefixes.some(() => undefined);
 
 export default isSkippedPath;
killedBy: getPageStaticParams should return static params according to the allPages mock
statusReason: expected [ { …(2) }, { …(2) } ] to strictly equal [ { …(2) } ]

[Killed] MethodExpression
pages/static/helpers/isSkippedPath.ts:4:61
 import PagesConfig from '@/config/pages';
 
 const isSkippedPath = (path: string) =>
-  PagesConfig.SKIP_AUTOMOUNT.paths.includes(path as any) || PagesConfig.SKIP_AUTOMOUNT.prefixes.some((p) => path.startsWith(p));
+  PagesConfig.SKIP_AUTOMOUNT.paths.includes(path as any) || PagesConfig.SKIP_AUTOMOUNT.prefixes.every(p => path.startsWith(p));
 
 export default isSkippedPath;
killedBy: getPageStaticParams should return static params according to the allPages mock
statusReason: expected [] to strictly equal [ Array(11) ]
