[NoCoverage] ConditionalExpression
src/lib/pages/staticGeneration.ts:40:22
 ): Couple<MaybeUndefined<Href>, Href> {
   const maybeDefaultLanguagePage = getPageByLanguageAndPathUnstrict(language, path);
 
-  const defaultUrl = middlewareStrategy !== 'redirect' ? getPathnameWithoutI18nFlag(currentPage.url) : currentPage.url;
+  const defaultUrl = false ? getPathnameWithoutI18nFlag(currentPage.url) : currentPage.url;
 
   const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguagePage !== null ? defaultUrl : undefined;

[NoCoverage] ConditionalExpression
src/lib/pages/staticGeneration.ts:40:22
 ): Couple<MaybeUndefined<Href>, Href> {
   const maybeDefaultLanguagePage = getPageByLanguageAndPathUnstrict(language, path);
 
-  const defaultUrl = middlewareStrategy !== 'redirect' ? getPathnameWithoutI18nFlag(currentPage.url) : currentPage.url;
+  const defaultUrl = true ? getPathnameWithoutI18nFlag(currentPage.url) : currentPage.url;
 
   const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguagePage !== null ? defaultUrl : undefined;

[NoCoverage] EqualityOperator
src/lib/pages/staticGeneration.ts:42:20
 
   const defaultUrl = middlewareStrategy !== 'redirect' ? getPathnameWithoutI18nFlag(currentPage.url) : currentPage.url;
 
-  const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguagePage !== null ? defaultUrl : undefined;
+  const xDefault = language === DEFAULT_LANGUAGE && maybeDefaultLanguagePage !== null ? defaultUrl : undefined;
 
   const canonical = language === DEFAULT_LANGUAGE ? defaultUrl : currentPage.url;

[NoCoverage] ConditionalExpression
src/lib/pages/staticGeneration.ts:42:20
 
   const defaultUrl = middlewareStrategy !== 'redirect' ? getPathnameWithoutI18nFlag(currentPage.url) : currentPage.url;
 
-  const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguagePage !== null ? defaultUrl : undefined;
+  const xDefault = false ? defaultUrl : undefined;
 
   const canonical = language === DEFAULT_LANGUAGE ? defaultUrl : currentPage.url;

[NoCoverage] ConditionalExpression
src/lib/pages/staticGeneration.ts:44:21
 
   const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguagePage !== null ? defaultUrl : undefined;
 
-  const canonical = language === DEFAULT_LANGUAGE ? defaultUrl : currentPage.url;
+  const canonical = false ? defaultUrl : currentPage.url;
   return [xDefault, canonical];
 }

[NoCoverage] EqualityOperator
src/lib/pages/staticGeneration.ts:44:21
 
   const xDefault = language !== DEFAULT_LANGUAGE && maybeDefaultLanguagePage !== null ? defaultUrl : undefined;
 
-  const canonical = language === DEFAULT_LANGUAGE ? defaultUrl : currentPage.url;
+  const canonical = language !== DEFAULT_LANGUAGE ? defaultUrl : currentPage.url;
   return [xDefault, canonical];
 }

[NoCoverage] ConditionalExpression
src/lib/pages/staticGeneration.ts:54:7
   metadataBase: MaybeUndefined<URL> = process.env.METADABASE_URL ? new URL(process.env.METADABASE_URL) : undefined
 ): Promise<Metadata> {
   const [path, language] = [params[PageTaxonomy.PATH].join('/'), params[I18nTaxonomy.LANGUAGE]];
-  if (isSkippedPath(path)) notFound();
+  if (false) notFound();
 
   const currentPage = getPageByLanguageAndPathUnstrict(language, path);

[NoCoverage] ConditionalExpression
src/lib/pages/staticGeneration.ts:65:57
   const { vocab } = i18ns;
   const title = buildPageTitle(globalT(`${vocab}.brand-short`), pageTitle);
 
-  const alternateLanguages = LANGUAGES.filter((lang) => lang !== language);
+  const alternateLanguages = LANGUAGES.filter((lang) => true);
   const languages = {} as Record<LanguageFlag | 'x-default', Href>;
 

[NoCoverage] ArrowFunction
src/lib/pages/staticGeneration.ts:65:47
   const { vocab } = i18ns;
   const title = buildPageTitle(globalT(`${vocab}.brand-short`), pageTitle);
 
-  const alternateLanguages = LANGUAGES.filter((lang) => lang !== language);
+  const alternateLanguages = LANGUAGES.filter(() => undefined);
   const languages = {} as Record<LanguageFlag | 'x-default', Href>;
 

[NoCoverage] BlockStatement
src/lib/pages/staticGeneration.ts:68:55
   const alternateLanguages = LANGUAGES.filter((lang) => lang !== language);
   const languages = {} as Record<LanguageFlag | 'x-default', Href>;
 
-  for (const alternateLanguage of alternateLanguages) {
-    const maybePage = getPageByLanguageAndPathUnstrict(alternateLanguage, path);
-    if (maybePage === null) continue;
-    languages[alternateLanguage] = maybePage.url;
-  }
+  for (const alternateLanguage of alternateLanguages) {}
 
   const maybeDefaultLanguagePage = getPageByLanguageAndPathUnstrict(DEFAULT_LANGUAGE, path);

[NoCoverage] ConditionalExpression
src/lib/pages/staticGeneration.ts:75:7
   }
 
   const maybeDefaultLanguagePage = getPageByLanguageAndPathUnstrict(DEFAULT_LANGUAGE, path);
-  if (maybeDefaultLanguagePage !== null) languages['x-default'] = getPathnameWithoutI18nFlag(url);
+  if (true) languages['x-default'] = getPathnameWithoutI18nFlag(url);
 
   const [xDefault, canonical] = getXDefaultAndCanonical(currentPage, path, language, middlewareStrategy);

[NoCoverage] EqualityOperator
src/lib/pages/staticGeneration.ts:75:7
   }
 
   const maybeDefaultLanguagePage = getPageByLanguageAndPathUnstrict(DEFAULT_LANGUAGE, path);
-  if (maybeDefaultLanguagePage !== null) languages['x-default'] = getPathnameWithoutI18nFlag(url);
+  if (maybeDefaultLanguagePage === null) languages['x-default'] = getPathnameWithoutI18nFlag(url);
 
   const [xDefault, canonical] = getXDefaultAndCanonical(currentPage, path, language, middlewareStrategy);
