[Killed] MethodExpression
lib/portable/str/capitalize.ts:2:45
 // eslint-disable-next-line no-magic-numbers
-const capitalize = (str: string): string => str.charAt(0).toUpperCase() + str.substring(1);
+const capitalize = (str: string): string => str.charAt(0).toLowerCase() + str.substring(1);
 
 export default capitalize;
killedBy: getBlogPostFormattedDate should return date without time, given valid ISO Date String with null timestamp
statusReason: expected 'vendredi 24 décembre 2021' to be 'Vendredi 24 décembre 2021' // Object.is equality

[Killed] MethodExpression
lib/portable/str/capitalize.ts:2:45
 // eslint-disable-next-line no-magic-numbers
-const capitalize = (str: string): string => str.charAt(0).toUpperCase() + str.substring(1);
+const capitalize = (str: string): string => str.toUpperCase() + str.substring(1);
 
 export default capitalize;
killedBy: getBlogPostFormattedDate should return date without time, given valid ISO Date String with null timestamp
statusReason: expected 'VENDREDI 24 DÉCEMBRE 2021endredi 24 d…' to be 'Vendredi 24 décembre 2021' // Object.is equality
