[NoCoverage] UnaryOperator
lib/portable/str/compareAlphabetically.ts:10:81
 
 // Stryker Workaround 1. Pointless mutant (no coverage on s2, locale, {}).
 // Stryker disable next-line ObjectLiteral
-export const compareAlphabeticallyDesc: StringsCompareFun = (s1, s2, locale) => -s1.localeCompare(s2, locale, { sensitivity: 'base' });
+export const compareAlphabeticallyDesc: StringsCompareFun = (s1, s2, locale) => +s1.localeCompare(s2, locale, {
+  sensitivity: 'base'
+});
 
 /* v8 ignore stop */
