[Killed] EqualityOperator
lib/portable/str/countCharacter.ts:10:7
   // Stryker Workaround 1. Pointless mutants (fault tolerant).
   // Stryker disable next-line ObjectLiteral,StringLiteral
   // eslint-disable-next-line no-magic-numbers
-  if (char.length !== 1) throw new InvalidArgumentsError(countCharacter.name, { char }, "char's length must be: 1");
+  if (char.length === 1) throw new InvalidArgumentsError(countCharacter.name, { char }, "char's length must be: 1");
 
   let count = 0;
killedBy: countCharacter should return a positive value, given strings containing the searched char
statusReason: Impossible to countCharacter with:
{
  "char": "a"
}
char's length must be: 1.

[Killed] ConditionalExpression
lib/portable/str/countCharacter.ts:10:7
   // Stryker Workaround 1. Pointless mutants (fault tolerant).
   // Stryker disable next-line ObjectLiteral,StringLiteral
   // eslint-disable-next-line no-magic-numbers
-  if (char.length !== 1) throw new InvalidArgumentsError(countCharacter.name, { char }, "char's length must be: 1");
+  if (false) throw new InvalidArgumentsError(countCharacter.name, { char }, "char's length must be: 1");
 
   let count = 0;
killedBy: countCharacter should throw, given char is not a char but a string
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
lib/portable/str/countCharacter.ts:13:38
   if (char.length !== 1) throw new InvalidArgumentsError(countCharacter.name, { char }, "char's length must be: 1");
 
   let count = 0;
-  for (const currentChar of str) if (currentChar === char) count++;
+  for (const currentChar of str) if (currentChar !== char) count++;
   return count;
 }
killedBy: countCharacter should return a positive value, given strings containing the searched char
statusReason: expected 43 to be 4 // Object.is equality

[Killed] ConditionalExpression
lib/portable/str/countCharacter.ts:13:38
   if (char.length !== 1) throw new InvalidArgumentsError(countCharacter.name, { char }, "char's length must be: 1");
 
   let count = 0;
-  for (const currentChar of str) if (currentChar === char) count++;
+  for (const currentChar of str) if (false) count++;
   return count;
 }
killedBy: countCharacter should return a positive value, given strings containing the searched char
statusReason: expected +0 to be 4 // Object.is equality
