[Killed] MethodExpression
lib/portable/str/endsWithChar.ts:1:92
-const endsWithChars = (str: string, endsChar: string) => endsChar.split('').some((char) => str.endsWith(char));
+const endsWithChars = (str: string, endsChar: string) => endsChar.split('').some((char) => str.startsWith(char));
 
 export default endsWithChars;
killedBy: InvalidArgumentsError should generate an error message with hint, without additional punctuation
statusReason: expected 'Impossible to FAKE_FUNCTION with:\n{\…' to be 'Impossible to FAKE_FUNCTION with:\n{\…' // Object.is equality

[Killed] MethodExpression
lib/portable/str/endsWithChar.ts:1:58
-const endsWithChars = (str: string, endsChar: string) => endsChar.split('').some((char) => str.endsWith(char));
+const endsWithChars = (str: string, endsChar: string) => endsChar.split('').every(char => str.endsWith(char));
 
 export default endsWithChars;
killedBy: InvalidArgumentsError should generate an error message with hint, without additional punctuation
statusReason: expected 'Impossible to FAKE_FUNCTION with:\n{\…' to be 'Impossible to FAKE_FUNCTION with:\n{\…' // Object.is equality
