[Killed] UnaryOperator
lib/portable/str/indexOfNthOccurrence.ts:5:15
 
 // eslint-disable-next-line no-magic-numbers
 function indexOfNthOccurrence(strHaystack: string, needle: string, n: Count): Index | -1 {
-  let index = -1;
+  let index = +1;
   for (let i = 0; i < n; i++) {
     // eslint-disable-next-line no-magic-numbers
killedBy: getPathnameMaybeI18nFlag should return null or a flag, given a pathname without i18n flag and a pathname with an i18n flag
statusReason: expected null to be 'fr' // Object.is equality

[Killed] BlockStatement
lib/portable/str/indexOfNthOccurrence.ts:6:31
 // eslint-disable-next-line no-magic-numbers
 function indexOfNthOccurrence(strHaystack: string, needle: string, n: Count): Index | -1 {
   let index = -1;
-  for (let i = 0; i < n; i++) {
-    // eslint-disable-next-line no-magic-numbers
-    index = strHaystack.indexOf(needle, index + 1);
-    // Stryker Workaround 1. Pointless mutants (out of scope: surviving is expected behavior).
-    // Stryker disable next-line ConditionalExpression,UnaryOperator
-    // eslint-disable-next-line no-magic-numbers
-    if (index === -1) break;
-  }
+  for (let i = 0; i < n; i++) {}
   return index;
 }
killedBy: getPathnameMaybeI18nFlag should return null or a flag, given a pathname without i18n flag and a pathname with an i18n flag
statusReason: expected null to be 'fr' // Object.is equality

[Killed] UpdateOperator
lib/portable/str/indexOfNthOccurrence.ts:6:26
 // eslint-disable-next-line no-magic-numbers
 function indexOfNthOccurrence(strHaystack: string, needle: string, n: Count): Index | -1 {
   let index = -1;
-  for (let i = 0; i < n; i++) {
+  for (let i = 0; i < n; i--) {
     // eslint-disable-next-line no-magic-numbers
     index = strHaystack.indexOf(needle, index + 1);
killedBy: hrefMatchesPathname should return true
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
lib/portable/str/indexOfNthOccurrence.ts:8:41
   let index = -1;
   for (let i = 0; i < n; i++) {
     // eslint-disable-next-line no-magic-numbers
-    index = strHaystack.indexOf(needle, index + 1);
+    index = strHaystack.indexOf(needle, index - 1);
     // Stryker Workaround 1. Pointless mutants (out of scope: surviving is expected behavior).
     // Stryker disable next-line ConditionalExpression,UnaryOperator
killedBy: hrefMatchesPathname should return true
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
lib/portable/str/indexOfNthOccurrence.ts:12:9
     // Stryker Workaround 1. Pointless mutants (out of scope: surviving is expected behavior).
     // Stryker disable next-line ConditionalExpression,UnaryOperator
     // eslint-disable-next-line no-magic-numbers
-    if (index === -1) break;
+    if (index !== -1) break;
   }
   return index;
killedBy: getPathnameMaybeI18nFlag should return null or a flag, given a pathname without i18n flag and a pathname with an i18n flag
statusReason: expected null to be 'fr' // Object.is equality
