[Killed] MethodExpression
lib/portable/str/surroundString.ts:2:5
 const surroundString = (str: string, envelope: string): string =>
-  (!str.startsWith(envelope) ? envelope : '') + str + (!str.endsWith(envelope) ? envelope : '');
+  (!str.endsWith(envelope) ? envelope : '') + str + (!str.endsWith(envelope) ? envelope : '');
 
 export default surroundString;
killedBy: getSlashEnvelope should return /foo/
statusReason: expected '//foo/' to be '/foo/' // Object.is equality

[Killed] BooleanLiteral
lib/portable/str/surroundString.ts:2:4
 const surroundString = (str: string, envelope: string): string =>
-  (!str.startsWith(envelope) ? envelope : '') + str + (!str.endsWith(envelope) ? envelope : '');
+  (str.startsWith(envelope) ? envelope : '') + str + (!str.endsWith(envelope) ? envelope : '');
 
 export default surroundString;
killedBy: hrefAndPathnameExactMatch should return true
statusReason: expected false to be true // Object.is equality
