[Killed] MethodExpression
lib/portable/typescript/getEnumKeys.ts:2:3
 const getEnumKeys = <T extends Record<string, unknown>>(enumerableObject: T): (keyof T)[] =>
-  Object.keys(enumerableObject).filter((key) => isNaN(Number(key)));
+  Object.keys(enumerableObject);
 
 export default getEnumKeys;
killedBy: getEnumKeys should return an array of enum keys, given a fake enum
statusReason: expected [ '0', '1', 'foo', 'bar' ] to strictly equal [ 'foo', 'bar' ]

[Killed] ArrowFunction
lib/portable/typescript/getEnumKeys.ts:2:40
 const getEnumKeys = <T extends Record<string, unknown>>(enumerableObject: T): (keyof T)[] =>
-  Object.keys(enumerableObject).filter((key) => isNaN(Number(key)));
+  Object.keys(enumerableObject).filter(() => undefined);
 
 export default getEnumKeys;
killedBy: getPathnameMaybeI18nFlag should return null or a flag, given a pathname without i18n flag and a pathname with an i18n flag
statusReason: expected null to be 'fr' // Object.is equality
