[Killed] BooleanLiteral
src/lib/str.ts:22:45
 
   // Stryker Workaround 1. Tautology is pointless.
   // Stryker disable next-line ConditionalExpression
-  if (pathnameWithoutI18n === _href) return true;
+  if (pathnameWithoutI18n === _href) return false;
   if (_href !== _root && pathnameWithoutI18n.startsWith(_href)) return true;
   return false;
killedBy: hrefMatchesPathname should return true
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/str.ts:22:7
 
   // Stryker Workaround 1. Tautology is pointless.
   // Stryker disable next-line ConditionalExpression
-  if (pathnameWithoutI18n === _href) return true;
+  if (pathnameWithoutI18n !== _href) return true;
   if (_href !== _root && pathnameWithoutI18n.startsWith(_href)) return true;
   return false;
killedBy: hrefMatchesPathname should return false
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/lib/str.ts:23:26
   // Stryker Workaround 1. Tautology is pointless.
   // Stryker disable next-line ConditionalExpression
   if (pathnameWithoutI18n === _href) return true;
-  if (_href !== _root && pathnameWithoutI18n.startsWith(_href)) return true;
+  if (_href !== _root && pathnameWithoutI18n.endsWith(_href)) return true;
   return false;
 }
killedBy: hrefMatchesPathname should return true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/str.ts:23:7
   // Stryker Workaround 1. Tautology is pointless.
   // Stryker disable next-line ConditionalExpression
   if (pathnameWithoutI18n === _href) return true;
-  if (_href !== _root && pathnameWithoutI18n.startsWith(_href)) return true;
+  if (false) return true;
   return false;
 }
killedBy: hrefMatchesPathname should return true
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/str.ts:24:10
   // Stryker disable next-line ConditionalExpression
   if (pathnameWithoutI18n === _href) return true;
   if (_href !== _root && pathnameWithoutI18n.startsWith(_href)) return true;
-  return false;
+  return true;
 }
 
killedBy: hrefMatchesPathname should return false
statusReason: expected true to be false // Object.is equality

[Killed] Regex
src/lib/str.ts:29:30
 
 export function hrefAndPathnameExactMatch(href: AppPath, pathname: AppPath): boolean {
   const _pathname = pathname.replace(/\/+$/, '');
-  const _href = href.replace(/\/+$/, '');
+  const _href = href.replace(/\/+/, '');
 
   if (_pathname === _href) return true;
killedBy: hrefAndPathnameExactMatch should return true
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/lib/str.ts:29:30
 
 export function hrefAndPathnameExactMatch(href: AppPath, pathname: AppPath): boolean {
   const _pathname = pathname.replace(/\/+$/, '');
-  const _href = href.replace(/\/+$/, '');
+  const _href = href.replace(/\/$/, '');
 
   if (_pathname === _href) return true;
killedBy: hrefAndPathnameExactMatch should return true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/str.ts:31:7
   const _pathname = pathname.replace(/\/+$/, '');
   const _href = href.replace(/\/+$/, '');
 
-  if (_pathname === _href) return true;
+  if (false) return true;
 
   const pathnameI18nFlag = getPathnameMaybeI18nFlag(_pathname);
killedBy: hrefAndPathnameExactMatch should return true
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/str.ts:31:7
   const _pathname = pathname.replace(/\/+$/, '');
   const _href = href.replace(/\/+$/, '');
 
-  if (_pathname === _href) return true;
+  if (_pathname !== _href) return true;
 
   const pathnameI18nFlag = getPathnameMaybeI18nFlag(_pathname);
killedBy: hrefAndPathnameExactMatch should return true
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/str.ts:36:79
   const pathnameI18nFlag = getPathnameMaybeI18nFlag(_pathname);
   const pathnameWithoutI18nflag = getPathnameWithoutI18nFlag(_pathname);
 
-  if ((pathnameI18nFlag === DEFAULT_LANGUAGE || pathnameI18nFlag === null) && pathnameWithoutI18nflag === _href) return true;
+  if ((pathnameI18nFlag === DEFAULT_LANGUAGE || pathnameI18nFlag === null) && pathnameWithoutI18nflag !== _href) return true;
 
   const hrefWithoutI18nFlag = getPathnameWithoutI18nFlag(_href);
killedBy: hrefAndPathnameExactMatch should return false
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/lib/str.ts:36:7
   const pathnameI18nFlag = getPathnameMaybeI18nFlag(_pathname);
   const pathnameWithoutI18nflag = getPathnameWithoutI18nFlag(_pathname);
 
-  if ((pathnameI18nFlag === DEFAULT_LANGUAGE || pathnameI18nFlag === null) && pathnameWithoutI18nflag === _href) return true;
+  if (pathnameI18nFlag === DEFAULT_LANGUAGE || pathnameI18nFlag === null || pathnameWithoutI18nflag === _href) return true;
 
   const hrefWithoutI18nFlag = getPathnameWithoutI18nFlag(_href);
killedBy: hrefAndPathnameExactMatch should return false
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/lib/str.ts:41:44
   const hrefWithoutI18nFlag = getPathnameWithoutI18nFlag(_href);
   const hrefI18nFlag = getPathnameMaybeI18nFlag(_href);
 
-  if (hrefI18nFlag === DEFAULT_LANGUAGE && pathnameWithoutI18nflag === hrefWithoutI18nFlag) return true;
+  if (hrefI18nFlag === DEFAULT_LANGUAGE && pathnameWithoutI18nflag !== hrefWithoutI18nFlag) return true;
   if (hrefI18nFlag === null && pathnameWithoutI18nflag === _href) return true;
   if (hrefI18nFlag === null && pathnameWithoutI18nflag === href) return true;
killedBy: hrefAndPathnameExactMatch should return true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/str.ts:41:44
   const hrefWithoutI18nFlag = getPathnameWithoutI18nFlag(_href);
   const hrefI18nFlag = getPathnameMaybeI18nFlag(_href);
 
-  if (hrefI18nFlag === DEFAULT_LANGUAGE && pathnameWithoutI18nflag === hrefWithoutI18nFlag) return true;
+  if (hrefI18nFlag === DEFAULT_LANGUAGE && true) return true;
   if (hrefI18nFlag === null && pathnameWithoutI18nflag === _href) return true;
   if (hrefI18nFlag === null && pathnameWithoutI18nflag === href) return true;
killedBy: hrefAndPathnameExactMatch should return false
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/str.ts:42:32
   const hrefI18nFlag = getPathnameMaybeI18nFlag(_href);
 
   if (hrefI18nFlag === DEFAULT_LANGUAGE && pathnameWithoutI18nflag === hrefWithoutI18nFlag) return true;
-  if (hrefI18nFlag === null && pathnameWithoutI18nflag === _href) return true;
+  if (hrefI18nFlag === null && true) return true;
   if (hrefI18nFlag === null && pathnameWithoutI18nflag === href) return true;
 
killedBy: hrefAndPathnameExactMatch should return false
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/str.ts:42:7
   const hrefI18nFlag = getPathnameMaybeI18nFlag(_href);
 
   if (hrefI18nFlag === DEFAULT_LANGUAGE && pathnameWithoutI18nflag === hrefWithoutI18nFlag) return true;
-  if (hrefI18nFlag === null && pathnameWithoutI18nflag === _href) return true;
+  if (true) return true;
   if (hrefI18nFlag === null && pathnameWithoutI18nflag === href) return true;
 
killedBy: hrefAndPathnameExactMatch should return false
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/str.ts:43:7
 
   if (hrefI18nFlag === DEFAULT_LANGUAGE && pathnameWithoutI18nflag === hrefWithoutI18nFlag) return true;
   if (hrefI18nFlag === null && pathnameWithoutI18nflag === _href) return true;
-  if (hrefI18nFlag === null && pathnameWithoutI18nflag === href) return true;
+  if (true) return true;
 
   return false;
killedBy: hrefAndPathnameExactMatch should return false
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/lib/str.ts:43:7
 
   if (hrefI18nFlag === DEFAULT_LANGUAGE && pathnameWithoutI18nflag === hrefWithoutI18nFlag) return true;
   if (hrefI18nFlag === null && pathnameWithoutI18nflag === _href) return true;
-  if (hrefI18nFlag === null && pathnameWithoutI18nflag === href) return true;
+  if (hrefI18nFlag === null || pathnameWithoutI18nflag === href) return true;
 
   return false;
killedBy: hrefAndPathnameExactMatch should return false
statusReason: expected true to be false // Object.is equality
